{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "[UNK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "[CLS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "[SEP]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "[PAD]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 4,
      "content": "[MASK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 5,
      "content": "жь",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 6,
      "content": "ку",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 7,
      "content": "кӀ",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 8,
      "content": "кIу",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 9,
      "content": "къ",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 10,
      "content": "къу",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 11,
      "content": "кхъ",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 12,
      "content": "кхъу",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 13,
      "content": "лъ",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 14,
      "content": "лI",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 15,
      "content": "пI",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 16,
      "content": "тI",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 17,
      "content": "фI",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 18,
      "content": "ху",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 19,
      "content": "хь",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 20,
      "content": "хъ",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 21,
      "content": "хъу",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 22,
      "content": "цI",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 23,
      "content": "щI",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 24,
      "content": "Ӏу",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 25,
      "content": "хуэ",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 26,
      "content": "во",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 27,
      "content": "рэ",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 28,
      "content": "зэ",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 29,
      "content": "де",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 30,
      "content": "зо",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 31,
      "content": "ар",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 32,
      "content": "ди",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 33,
      "content": "ремы",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 34,
      "content": "эрэ",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 35,
      "content": "дэ",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 36,
      "content": "ры",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 37,
      "content": "эж",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 38,
      "content": "ри",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 39,
      "content": "ыж",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 40,
      "content": "фы",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 41,
      "content": "мы",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 42,
      "content": "ау",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 43,
      "content": "щы",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 44,
      "content": "къым",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 45,
      "content": "хуа",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 46,
      "content": "эм",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 47,
      "content": "ат",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 48,
      "content": "хэ",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 49,
      "content": "нщ",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 50,
      "content": "зы",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 51,
      "content": "жы",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 52,
      "content": "тэ",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 53,
      "content": "ро",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 54,
      "content": "ды",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 55,
      "content": "хы",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 56,
      "content": "къэ",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 57,
      "content": "рызы",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 58,
      "content": "ащ",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 59,
      "content": "ре",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 60,
      "content": "да",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 61,
      "content": "до",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 62,
      "content": "ам",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 63,
      "content": "гъэ",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 64,
      "content": "вэ",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 65,
      "content": "ми",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 66,
      "content": "къы",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 67,
      "content": "ын",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 68,
      "content": "ха",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 69,
      "content": "эн",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 70,
      "content": "фӀэ",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 71,
      "content": "ущ",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 72,
      "content": "ра",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "WhitespaceSplit"
  },
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": null,
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "vocab": {
      "[UNK]": 0,
      "[CLS]": 1,
      "[SEP]": 2,
      "[PAD]": 3,
      "[MASK]": 4,
      "!": 5,
      "\"": 6,
      "#": 7,
      "%": 8,
      "&": 9,
      "'": 10,
      "(": 11,
      ")": 12,
      "*": 13,
      "+": 14,
      ",": 15,
      "-": 16,
      ".": 17,
      "/": 18,
      "0": 19,
      "1": 20,
      "2": 21,
      "3": 22,
      "4": 23,
      "5": 24,
      "6": 25,
      "7": 26,
      "8": 27,
      "9": 28,
      ":": 29,
      ";": 30,
      "<": 31,
      "=": 32,
      ">": 33,
      "?": 34,
      "@": 35,
      "A": 36,
      "B": 37,
      "C": 38,
      "D": 39,
      "E": 40,
      "F": 41,
      "G": 42,
      "H": 43,
      "I": 44,
      "J": 45,
      "K": 46,
      "L": 47,
      "M": 48,
      "N": 49,
      "O": 50,
      "P": 51,
      "Q": 52,
      "R": 53,
      "S": 54,
      "T": 55,
      "U": 56,
      "V": 57,
      "W": 58,
      "X": 59,
      "Y": 60,
      "Z": 61,
      "[": 62,
      "\\": 63,
      "]": 64,
      "_": 65,
      "a": 66,
      "b": 67,
      "c": 68,
      "d": 69,
      "e": 70,
      "f": 71,
      "g": 72,
      "h": 73,
      "i": 74,
      "j": 75,
      "k": 76,
      "l": 77,
      "m": 78,
      "n": 79,
      "o": 80,
      "p": 81,
      "q": 82,
      "r": 83,
      "s": 84,
      "t": 85,
      "u": 86,
      "v": 87,
      "w": 88,
      "x": 89,
      "y": 90,
      "z": 91,
      "«": 92,
      "¬": 93,
      "°": 94,
      "»": 95,
      "¼": 96,
      "Ç": 97,
      "à": 98,
      "è": 99,
      "é": 100,
      "ò": 101,
      "ü": 102,
      "ĭ": 103,
      "́": 104,
      "̆": 105,
      "Ё": 106,
      "І": 107,
      "А": 108,
      "Б": 109,
      "В": 110,
      "Г": 111,
      "Д": 112,
      "Е": 113,
      "Ж": 114,
      "З": 115,
      "И": 116,
      "Й": 117,
      "К": 118,
      "Л": 119,
      "М": 120,
      "Н": 121,
      "О": 122,
      "П": 123,
      "Р": 124,
      "С": 125,
      "Т": 126,
      "У": 127,
      "Ф": 128,
      "Х": 129,
      "Ц": 130,
      "Ч": 131,
      "Ш": 132,
      "Щ": 133,
      "Ъ": 134,
      "Ы": 135,
      "Ь": 136,
      "Э": 137,
      "Ю": 138,
      "Я": 139,
      "а": 140,
      "б": 141,
      "в": 142,
      "г": 143,
      "д": 144,
      "е": 145,
      "ж": 146,
      "з": 147,
      "и": 148,
      "й": 149,
      "к": 150,
      "л": 151,
      "м": 152,
      "н": 153,
      "о": 154,
      "п": 155,
      "р": 156,
      "с": 157,
      "т": 158,
      "у": 159,
      "ф": 160,
      "х": 161,
      "ц": 162,
      "ч": 163,
      "ш": 164,
      "щ": 165,
      "ъ": 166,
      "ы": 167,
      "ь": 168,
      "э": 169,
      "ю": 170,
      "я": 171,
      "ё": 172,
      "і": 173,
      "ҩ": 174,
      "Ӏ": 175,
      "–": 176,
      "—": 177,
      "‘": 178,
      "’": 179,
      "“": 180,
      "”": 181,
      "„": 182,
      "•": 183,
      "…": 184,
      "′": 185,
      "№": 186,
      "→": 187,
      "−": 188,
      "♦": 189,
      "⠀": 190,
      "уэ": 191,
      "гъ": 192,
      "Iэ": 193,
      "къ": 194,
      "эм": 195,
      "эр": 196,
      "ым": 197,
      "лъ": 198,
      "кI": 199,
      "гъэ": 200,
      "хь": 201,
      "ащ": 202,
      "хъ": 203,
      "ху": 204,
      "щы": 205,
      "щI": 206,
      "хэм": 207,
      "зэ": 208,
      "къы": 209,
      "кIэ": 210,
      "зы": 211,
      "нэ": 212,
      "хуэ": 213,
      "хьэ": 214,
      "ар": 215,
      "щIэ": 216,
      "ыр": 217,
      "жь": 218,
      "ей": 219,
      "дэ": 220,
      "рэ": 221,
      "ал": 222,
      "хэр": 223,
      "гу": 224,
      "ын": 225,
      "гъуэ": 226,
      "зэр": 227,
      "ри": 228,
      "пс": 229,
      "хъу": 230,
      "хэ": 231,
      "Iы": 232,
      "лъэ": 233,
      "ра": 234,
      "те": 235,
      "гъу": 236,
      "кIуэ": 237,
      "аб": 238,
      "дж": 239,
      "ан": 240,
      "ды": 241,
      "мы": 242,
      "ап": 243,
      "ны": 244,
      "ауэ": 245,
      "ст": 246,
      "ди": 247,
      "ат": 248,
      "Къ": 249,
      "гъэм": 250,
      "ам": 251,
      "ащ.": 252,
      "зэры": 253,
      "ры": 254,
      "ун": 255,
      "Iу": 256,
      "эн": 257,
      "ми": 258,
      "къым": 259,
      "Iуэ": 260,
      "къу": 261,
      "пэ": 262,
      "ли": 263,
      "ен": 264,
      "къэ": 265,
      "-м": 266,
      "сы": 267,
      "щIы": 268,
      "алъ": 269,
      "агъэ": 270,
      "къуэ": 271,
      "ро": 272,
      "эу": 273,
      "хы": 274,
      "нэхъ": 275,
      "бы": 276,
      "цIы": 277,
      "лэ": 278,
      "ко": 279,
      "абы": 280,
      "ит": 281,
      "щ.": 282,
      "мэ": 283,
      "де": 284,
      "ну": 285,
      "и,": 286,
      "зи": 287,
      "ку": 288,
      "щхьэ": 289,
      "ет": 290,
      "20": 291,
      "ор": 292,
      "ла": 293,
      "ма": 294,
      "Iэм": 295,
      "ре": 296,
      "жы": 297,
      "къэр": 298,
      "кIу": 299,
      "ыну": 300,
      "эб": 301,
      "фIэ": 302,
      "ин": 303,
      "щыт": 304,
      "ер": 305,
      "си": 306,
      "лъы": 307,
      "цIыху": 308,
      "акIуэ": 309,
      "дыг": 310,
      "хуэдэ": 311,
      "у,": 312,
      "19": 313,
      "да": 314,
      "ужь": 315,
      "зэм": 316,
      "лъа": 317,
      "но": 318,
      "Iуэху": 319,
      "игъэ": 320,
      "фэ": 321,
      "кIы": 322,
      "сп": 323,
      "он": 324,
      "лэжь": 325,
      "джэ": 326,
      "ем": 327,
      "шы": 328,
      "ов": 329,
      "ий": 330,
      "хъуэ": 331,
      "хэт": 332,
      "уб": 333,
      "сэ": 334,
      "псо": 335,
      "Ар": 336,
      "пIэ": 337,
      "ка": 338,
      "щ,": 339,
      "Абы": 340,
      "хьэм": 341,
      "ныгъэ": 342,
      "къи": 343,
      "гъэр": 344,
      "ейм": 345,
      "ащIэ": 346,
      "кIи": 347,
      "за": 348,
      "на": 349,
      "щэ": 350,
      "кIа": 351,
      "ту": 352,
      "т.": 353,
      "ль": 354,
      "тэ": 355,
      "уэд": 356,
      "дыгэ": 357,
      "нэхъы": 358,
      "къыщы": 359,
      "лI": 360,
      "рыс": 361,
      "ты": 362,
      "шхуэ": 363,
      "уна": 364,
      "фI": 365,
      "дей": 366,
      "бэ": 367,
      "тхы": 368,
      "анэ": 369,
      "лъэп": 370,
      "зым": 371,
      "ув": 372,
      "къэрал": 373,
      "гуэ": 374,
      "та": 375,
      "кIэ,": 376,
      "цIэ": 377,
      "куэд": 378,
      "шэ": 379,
      "щыщ": 380,
      "къым.": 381,
      "лIэ": 382,
      "ха": 383,
      "..": 384,
      "алэ": 385,
      "ащ,": 386,
      "жэ": 387,
      "тым": 388,
      "апIэ": 389,
      "кэм": 390,
      "джы": 391,
      "лы": 392,
      "жи": 393,
      "до": 394,
      "ни": 395,
      "илъэ": 396,
      "дун": 397,
      "хьэр": 398,
      "ще": 399,
      "щIа": 400,
      "бжь": 401,
      "ур": 402,
      "гъуэм": 403,
      "Къэб": 404,
      "Хь": 405,
      "по": 406,
      "жа": 407,
      "фIы": 408,
      "кэ": 409,
      "ти": 410,
      "Къэбэр": 411,
      "хэмрэ": 412,
      "то": 413,
      "дэм": 414,
      "хуа": 415,
      "хуей": 416,
      "псэ": 417,
      "пы": 418,
      "ри,": 419,
      "про": 420,
      "махуэ": 421,
      "убли": 422,
      "ек": 423,
      "къа": 424,
      "къе": 425,
      "т,": 426,
      "Урыс": 427,
      "спубли": 428,
      "хаб": 429,
      "эрэ": 430,
      "Къэбэрдей": 431,
      "сым": 432,
      "адыгэ": 433,
      "псэу": 434,
      "го": 435,
      "алъкъэр": 436,
      "хи": 437,
      "со": 438,
      "деж": 439,
      "ев": 440,
      "псы": 441,
      "рагъэ": 442,
      "ав": 443,
      "-Б": 444,
      "ло": 445,
      "икIи": 446,
      "ес": 447,
      "алъэ": 448,
      "зыгъэ": 449,
      "ыгъэ": 450,
      "ири": 451,
      "къыщ": 452,
      "уи": 453,
      "кIуэкI": 454,
      "япэ": 455,
      "ус": 456,
      "ным": 457,
      "плъ": 458,
      "аз": 459,
      "бл": 460,
      "урэ": 461,
      "ств": 462,
      "гуэр": 463,
      "дзэ": 464,
      "ыным": 465,
      "Къэбэрдей-Б": 466,
      "Къэбэрдей-Балъкъэр": 467,
      "унафэ": 468,
      "ме": 469,
      "Р-м": 470,
      "э,": 471,
      "дз": 472,
      "зыр": 473,
      "Хьэ": 474,
      "спубликэм": 475,
      "зэхуэ": 476,
      "къал": 477,
      "тыр": 478,
      "илъэс": 479,
      "тI": 480,
      "щIын": 481,
      "»,": 482,
      "щыIэ": 483,
      "ахуэ": 484,
      "мэ,": 485,
      "щым": 486,
      "ск": 487,
      "лъагъу": 488,
      "къызэр": 489,
      "бгъэ": 490,
      "хэр,": 491,
      "хуащ": 492,
      "са": 493,
      "эмы": 494,
      "у.": 495,
      "зе": 496,
      "хъы": 497,
      "ныбжь": 498,
      "пи": 499,
      "къым,": 500,
      "иIэ": 501,
      "гъа": 502,
      "р.": 503,
      "рыIуэ": 504,
      "теу": 505,
      "-рэ": 506,
      "пщ": 507,
      "я,": 508,
      "Ап": 509,
      "ви": 510,
      "бо": 511,
      "къызэры": 512,
      "хъуну": 513,
      "дуней": 514,
      "щIи": 515,
      "ящыщ": 516,
      "зэIу": 517,
      "жьэ": 518,
      "ныгъэм": 519,
      "къыхэ": 520,
      "эры": 521,
      "лIы": 522,
      "Нал": 523,
      "лъэпкъ": 524,
      "202": 525,
      "р,": 526,
      "ие": 527,
      "ныкъуэ": 528,
      "эп": 529,
      "пщIэ": 530,
      "ут": 531,
      "дыдэ": 532,
      "мо": 533,
      "шык": 534,
      "хуэдэу": 535,
      "хэм,": 536,
      "апщIэ": 537,
      "къалъ": 538,
      "ман": 539,
      "гра": 540,
      "егъэ": 541,
      "адэ": 542,
      "цIыкIу": 543,
      "Мы": 544,
      "кт": 545,
      "убы": 546,
      "алъэм": 547,
      "18": 548,
      "къуа": 549,
      "цэм": 550,
      "КъБ": 551,
      "Ре": 552,
      "хуи": 553,
      "ент": 554,
      "итI": 555,
      "«С": 556,
      "хьа": 557,
      "унэ": 558,
      "Налшык": 559,
      "Зэ": 560,
      "фи": 561,
      "ща": 562,
      "пе": 563,
      "аль": 564,
      "папщIэ": 565,
      "гъуэщI": 566,
      "щIэныгъэ": 567,
      "щи": 568,
      "щIалэ": 569,
      "ас": 570,
      "Iащ": 571,
      "ым,": 572,
      "ауэ,": 573,
      "хъэ": 574,
      "ад": 575,
      "гум": 576,
      "лагъуэ": 577,
      "хэр.": 578,
      "му": 579,
      "тIэ": 580,
      "хэри": 581,
      "гъуа": 582,
      "Жы": 583,
      "дэт": 584,
      "хэлъ": 585,
      "зиIэ": 586,
      "ригъэ": 587,
      "во": 588,
      "кум": 589,
      "зэман": 590,
      "зауэ": 591,
      "щIыхь": 592,
      "унафэщI": 593,
      "ар.": 594,
      "зэфIэ": 595,
      "бр": 596,
      "рей": 597,
      "♦19": 598,
      "гугъу": 599,
      "едж": 600,
      "00": 601,
      "ягъэ": 602,
      "нэгъуэщI": 603,
      "Му": 604,
      "тхылъ": 605,
      "ци": 606,
      "ыт": 607,
      "ыгъэм": 608,
      "абыхэм": 609,
      "еде": 610,
      "къызэ": 611,
      "ыр.": 612,
      "хъуа": 613,
      "хэмкIэ": 614,
      "Урысей": 615,
      "Гъ": 616,
      "гуп": 617,
      "али": 618,
      "сыт": 619,
      "Республикэм": 620,
      "бзэ": 621,
      "орт": 622,
      "иужь": 623,
      "Ди": 624,
      "ва": 625,
      "хъум": 626,
      "ыр,": 627,
      "Нэ": 628,
      "кIыж": 629,
      "нат": 630,
      "бж": 631,
      "пщI": 632,
      "эри": 633,
      "КъБР-м": 634,
      "ымрэ": 635,
      "гъащIэ": 636,
      "ми,": 637,
      "хабзэ": 638,
      "ле": 639,
      "кIэм": 640,
      "абий": 641,
      "....": 642,
      "Адыгэ": 643,
      "къри": 644,
      "ша": 645,
      "хэми": 646,
      "су": 647,
      "амэ": 648,
      "тащ": 649,
      "ари": 650,
      "ахэр": 651,
      "щэн": 652,
      "Мэ": 653,
      "блэ": 654,
      "же": 655,
      "пар": 656,
      "щIэм": 657,
      "».": 658,
      "05": 659,
      "ябр": 660,
      "мыгъэ": 661,
      "ки": 662,
      "тер": 663,
      "СС": 664,
      "кIын": 665,
      "Къы": 666,
      "щхьэкIэ": 667,
      "джэгу": 668,
      "щIэу": 669,
      "мини": 670,
      "гупсы": 671,
      "ащIэм": 672,
      "Кав": 673,
      "адыг": 674,
      "псалъэ": 675,
      "апэ": 676,
      "бар": 677,
      "Кавка": 678,
      "жу": 679,
      "кIыу": 680,
      "щызэ": 681,
      "къыщIэ": 682,
      "гъуэгу": 683,
      "Ауэ": 684,
      "дгъэ": 685,
      "рым": 686,
      "об": 687,
      "Iэмал": 688,
      "пщы": 689,
      "рацэм": 690,
      "газ": 691,
      "жын": 692,
      "цIэрыIуэ": 693,
      "тIы": 694,
      "Хъ": 695,
      "ани": 696,
      "дунейм": 697,
      "тх": 698,
      "ствэм": 699,
      "ыгъуэ": 700,
      "къыдэ": 701,
      "ыри": 702,
      "Iа": 703,
      "ат.": 704,
      "овет": 705,
      "хьэзэхуэ": 706,
      "Урысейм": 707,
      "хо": 708,
      "так": 709,
      "Жылагъуэ": 710,
      "па": 711,
      "Ма": 712,
      "Гу": 713,
      "тын": 714,
      "2021": 715,
      "апхуэдэ": 716,
      "ащэ": 717,
      "газет": 718,
      "зэри": 719,
      "ба": 720,
      "Iэу": 721,
      "ис": 722,
      "не": 723,
      "пщэ": 724,
      "ру": 725,
      "къыт": 726,
      "хэм.": 727,
      "къалъхуащ": 728,
      "анэм": 729,
      "къэралым": 730,
      "псори": 731,
      "лим": 732,
      "сабий": 733,
      "щыпсэу": 734,
      "15": 735,
      "уа": 736,
      "уэрэ": 737,
      "ил": 738,
      "иджы": 739,
      "сэб": 740,
      "17": 741,
      "щIыпIэ": 742,
      "хуауэ": 743,
      "згъэ": 744,
      "эт": 745,
      "плъы": 746,
      "къо": 747,
      "хуит": 748,
      "12": 749,
      "що": 750,
      "Си": 751,
      "ду": 752,
      "апIэм": 753,
      "Лъ": 754,
      "рат": 755,
      "зу": 756,
      "зыхуэ": 757,
      "лэжьакIуэ": 758,
      "цIэр": 759,
      "гъы": 760,
      "щIэр": 761,
      "10": 762,
      "хьащ": 763,
      "щыта": 764,
      "Феде": 765,
      "жыр": 766,
      "тера": 767,
      "зэфIэкI": 768,
      "хуагъэ": 769,
      "зэхьэзэхуэ": 770,
      "сэн": 771,
      "жыну": 772,
      "ля": 773,
      "щагъэ": 774,
      "зэгу": 775,
      "тель": 776,
      "зо": 777,
      "плъэ": 778,
      "хэу": 779,
      "кIэлъы": 780,
      "Сэ": 781,
      "хуэди": 782,
      "къалэ": 783,
      "дунейпсо": 784,
      "пхъу": 785,
      "закъуэ": 786,
      "16": 787,
      "се": 788,
      "къалэм": 789,
      "пIэм": 790,
      "нэужь": 791,
      "увы": 792,
      "хъыбар": 793,
      "сэбэп": 794,
      "им": 795,
      "бжы": 796,
      "шын": 797,
      "узы": 798,
      "фэм": 799,
      "лым": 800,
      "Апхуэдэ": 801,
      "тра": 802,
      "нэмы": 803,
      "»-м": 804,
      "чем": 805,
      "эгъу": 806,
      "благъэ": 807,
      "лъэгъу": 808,
      "псом": 809,
      "хабзэм": 810,
      "жэм": 811,
      "эну": 812,
      "бг": 813,
      "къигъэ": 814,
      "жащ.": 815,
      "ымы": 816,
      "щи,": 817,
      "щащ": 818,
      "лъху": 819,
      "бий": 820,
      "къэс": 821,
      "идж": 822,
      "ЩI": 823,
      "пI": 824,
      "Iэр": 825,
      "ЦIы": 826,
      "цI": 827,
      "гъуэр": 828,
      "дэр": 829,
      "Къэбэрдей-Балъкъэрым": 830,
      "ныгъэр": 831,
      "мыхьэ": 832,
      "ирагъэ": 833,
      "Ан": 834,
      "тет": 835,
      "чемпи": 836,
      "алэм": 837,
      "лэжьыгъэ": 838,
      "гъуэн": 839,
      "хъулIэ": 840,
      "УФ": 841,
      "ров": 842,
      "коман": 843,
      "сс": 844,
      "лъхьэ": 845,
      "ух": 846,
      "пащ": 847,
      "Федерацэм": 848,
      "фы": 849,
      "ым.": 850,
      "05:": 851,
      "Зы": 852,
      "ков": 853,
      "хьащ.": 854,
      "щхьэм": 855,
      "урыс": 856,
      "лек": 857,
      "ден": 858,
      "хъун": 859,
      "терату": 860,
      "анд": 861,
      "дин": 862,
      "щхьэр": 863,
      "къар": 864,
      "шх": 865,
      "зэхэ": 866,
      "Со": 867,
      "кIуэкIа": 868,
      "лъыт": 869,
      "Iэнат": 870,
      "теухуауэ": 871,
      "жиIащ": 872,
      "тIу": 873,
      "дэу": 874,
      "нэс": 875,
      "Ин": 876,
      "къызы": 877,
      "Хэ": 878,
      "м,": 879,
      "пкъ": 880,
      "щIагъэ": 881,
      "щекIуэкI": 882,
      "пре": 883,
      "хив": 884,
      "зэра": 885,
      "пэм": 886,
      "зыбж": 887,
      "рад": 888,
      "зэпе": 889,
      "республикэм": 890,
      "«Спар": 891,
      "фIыуэ": 892,
      "«Спартак": 893,
      "2020": 894,
      "имы": 895,
      "щIыналъэм": 896,
      "2019": 897,
      "УФ-м": 898,
      "щхьэу": 899,
      "чемпион": 900,
      "Мо": 901,
      "хъуащ": 902,
      "сти": 903,
      "Абыхэм": 904,
      "жьы": 905,
      "уд": 906,
      "цэ": 907,
      "лIэужь": 908,
      "щхъ": 909,
      "ти,": 910,
      "хьэлI": 911,
      "Махуэ": 912,
      "дыдэу": 913,
      "шэу": 914,
      "теухуа": 915,
      "ЦIыху": 916,
      "ахъ": 917,
      "хуе": 918,
      "гъэхэм": 919,
      "тхьэм": 920,
      "лъапIэ": 921,
      "лъэпкъым": 922,
      "зэпеуэ": 923,
      "лу": 924,
      "бэр": 925,
      "щт": 926,
      "IуэхущI": 927,
      "Къэ": 928,
      "ктор": 929,
      "абжь": 930,
      "хагъэ": 931,
      "енер": 932,
      "ком": 933,
      "Архив": 934,
      "хьэзыр": 935,
      "лъэныкъуэ": 936,
      "ира": 937,
      "къыс": 938,
      "жыпIэ": 939,
      "ги": 940,
      "спорт": 941,
      "лъаг": 942,
      "лъэн": 943,
      "щымы": 944,
      "эным": 945,
      "11": 946,
      "ар,": 947,
      "къыз": 948,
      "жьым": 949,
      "гъуэт": 950,
      "кІ": 951,
      "дэс": 952,
      "хыхьэ": 953,
      "ве": 954,
      "гъащIэм": 955,
      "Iуэхум": 956,
      "лыкъу": 957,
      "альнэ": 958,
      "щIащ": 959,
      "шэр": 960,
      "Ды": 961,
      "арэ": 962,
      "хъуащ.": 963,
      "ши": 964,
      "би": 965,
      "ныбжьэгъу": 966,
      "еплъ": 967,
      "),": 968,
      "къагъэ": 969,
      "фыну": 970,
      "гъунэ": 971,
      "14": 972,
      "мурад": 973,
      "ать": 974,
      "щIым": 975,
      "хигъэ": 976,
      "мед": 977,
      "кIащ": 978,
      "пэщIэ": 979,
      "ыщIэ": 980,
      "гъус": 981,
      "Уэ": 982,
      "жэр": 983,
      "тр": 984,
      "мен": 985,
      "шу": 986,
      "кIыр": 987,
      "цIыхухэм": 988,
      "хъур": 989,
      "зэманым": 990,
      "пэщ": 991,
      "хьэлIэ": 992,
      "Сы": 993,
      "езы": 994,
      "три": 995,
      "щIыналъэ": 996,
      "псоми": 997,
      "Мар": 998,
      "къулыкъу": 999,
      "джэр": 1000,
      "13": 1001,
      "эми": 1002,
      "Кавказ": 1003,
      "грам": 1004,
      "вер": 1005,
      "зэрыщыт": 1006,
      "сыр": 1007,
      "сурэ": 1008,
      "шхуэм": 1009,
      "кIэр": 1010,
      "тетым": 1011,
      "ста": 1012,
      "зыIэ": 1013,
      "хуэдиз": 1014,
      "атэ": 1015,
      "къуажэм": 1016,
      "рави": 1017,
      "тыхь": 1018,
      "анэр": 1019,
      "30": 1020,
      "хуэмы": 1021,
      "По": 1022,
      "гъэпс": 1023,
      "алым": 1024,
      "эм,": 1025,
      "убыд": 1026,
      "мащIэ": 1027,
      "хьэт": 1028,
      "дахэ": 1029,
      "кIыну": 1030,
      "кIуа": 1031,
      "езым": 1032,
      "щыте": 1033,
      "арти": 1034,
      "псэлъы": 1035,
      "чес": 1036,
      "къуд": 1037,
      "иту": 1038,
      "лажьэ": 1039,
      "лIэужьыгъуэ": 1040,
      "къыте": 1041,
      "къащ": 1042,
      "сто": 1043,
      "Но": 1044,
      "щыты": 1045,
      "-р": 1046,
      "куу": 1047,
      "лей": 1048,
      "Илъэ": 1049,
      "уэрэд": 1050,
      "равитель": 1051,
      "гъэщIэ": 1052,
      "минист": 1053,
      "Олим": 1054,
      "лен": 1055,
      "Къэр": 1056,
      "макъ": 1057,
      "къалэн": 1058,
      "гъунэгъу": 1059,
      "мин": 1060,
      "кон": 1061,
      "уни": 1062,
      "лъагъуэ": 1063,
      "Совет": 1064,
      "адыгэб": 1065,
      "эмрэ": 1066,
      "артист": 1067,
      "тхакIуэ": 1068,
      "хащ": 1069,
      "эмэ": 1070,
      "уты": 1071,
      "шко": 1072,
      "мет": 1073,
      "ещ": 1074,
      "ско": 1075,
      "Iэпы": 1076,
      "къуажэ": 1077,
      "Iуащ": 1078,
      "Иджы": 1079,
      "200": 1080,
      "вэ": 1081,
      "пэщы": 1082,
      "лий": 1083,
      "Ро": 1084,
      "лан": 1085,
      "зэрагъэ": 1086,
      "иджыри": 1087,
      "Дэ": 1088,
      "жащ": 1089,
      "пхъэ": 1090,
      "ехъулIэ": 1091,
      "2022": 1092,
      "тхьэ": 1093,
      "ау": 1094,
      "Iэтащ": 1095,
      "ран": 1096,
      "амэ,": 1097,
      "Дун": 1098,
      "Тыр": 1099,
      "сом": 1100,
      "утбо": 1101,
      "щытащ.": 1102,
      "щыгъуэ": 1103,
      "Сыт": 1104,
      "адэм": 1105,
      "ся": 1106,
      "ами": 1107,
      "зэмы": 1108,
      "ай": 1109,
      "бе": 1110,
      "куэдым": 1111,
      "СР-м": 1112,
      "Правитель": 1113,
      "гупсыс": 1114,
      "тэкъым.": 1115,
      "вро": 1116,
      "от": 1117,
      "........": 1118,
      "ами,": 1119,
      "щытащ": 1120,
      "Iуэхур": 1121,
      "псым": 1122,
      "жаIэ": 1123,
      "ыгъэр": 1124,
      "эмэ,": 1125,
      "эр,": 1126,
      "Ас": 1127,
      "гур": 1128,
      "гуэрым": 1129,
      "лъытэ": 1130,
      "Пс": 1131,
      "мыр": 1132,
      "цIыхуб": 1133,
      "мэхъу": 1134,
      "гъуазэ": 1135,
      "рэ,": 1136,
      "зыху": 1137,
      "Бо": 1138,
      "емы": 1139,
      "кIуэну": 1140,
      "из": 1141,
      "яIэ": 1142,
      "нэхъыщхьэ": 1143,
      "нэужь,": 1144,
      "джэб": 1145,
      "их": 1146,
      "кIащ.": 1147,
      "иужькIэ": 1148,
      "ам,": 1149,
      "Правительствэм": 1150,
      ").": 1151,
      "дэтхэ": 1152,
      "литерату": 1153,
      "лов": 1154,
      "махуэм": 1155,
      "урн": 1156,
      "джакIуэ": 1157,
      "щIигъу": 1158,
      "Сп": 1159,
      "фа": 1160,
      "иригъэ": 1161,
      "мыхъу": 1162,
      "рэ.": 1163,
      "гупым": 1164,
      "усакIуэ": 1165,
      "къыр": 1166,
      "фIэкIа": 1167,
      "агъ": 1168,
      "бзэм": 1169,
      "зыбжанэ": 1170,
      "25": 1171,
      "ухуэ": 1172,
      "бгъэдэ": 1173,
      "эр.": 1174,
      "деми": 1175,
      "гуры": 1176,
      "аным": 1177,
      "прос": 1178,
      "кIэ.": 1179,
      "умы": 1180,
      "щIыр": 1181,
      "адрей": 1182,
      "Лъэп": 1183,
      "Тхы": 1184,
      "цIыхубэ": 1185,
      "ября,": 1186,
      "Вла": 1187,
      "хэмы": 1188,
      "Апхуэдэу": 1189,
      "къару": 1190,
      "футбо": 1191,
      "че": 1192,
      "етIу": 1193,
      "лити": 1194,
      "кур": 1195,
      "ныр": 1196,
      "дигъэ": 1197,
      "йо": 1198,
      "зыхьэ": 1199,
      "стер": 1200,
      "махуэщ": 1201,
      "Уна": 1202,
      "Моск": 1203,
      "жым": 1204,
      "Ко": 1205,
      "мар": 1206,
      "зэкIэ": 1207,
      "За": 1208,
      "жэу": 1209,
      "къаб": 1210,
      "зэгухьэ": 1211,
      "къэзы": 1212,
      "лог": 1213,
      "Те": 1214,
      "нэхъыфI": 1215,
      "унагъуэ": 1216,
      "лэжьыгъэм": 1217,
      "Аб": 1218,
      "Ищхъ": 1219,
      "Іэ": 1220,
      "чэ": 1221,
      "Влади": 1222,
      "рай": 1223,
      "бзы": 1224,
      "яхуэ": 1225,
      "Ли": 1226,
      "жиIэ": 1227,
      "ат,": 1228,
      "кин": 1229,
      "хъумэ": 1230,
      "пхъ": 1231,
      "джэм": 1232,
      "бзэр": 1233,
      "япэу": 1234,
      "пащтыхь": 1235,
      "Уи": 1236,
      "вы": 1237,
      "уры": 1238,
      "хьэмэ": 1239,
      "ж.": 1240,
      "Махуэгъэпс": 1241,
      "ехъулIэныгъэ": 1242,
      "защIэ": 1243,
      "IэщIагъэ": 1244,
      "хьым": 1245,
      "зэпы": 1246,
      "мэм": 1247,
      "къып": 1248,
      "цент": 1249,
      "зэщIэ": 1250,
      "зэре": 1251,
      "хэта": 1252,
      "лекс": 1253,
      "щIауэ": 1254,
      "оным": 1255,
      "лэм": 1256,
      "гурыIуэ": 1257,
      "Ахэр": 1258,
      "псалъэм": 1259,
      "шэч": 1260,
      "угъэ": 1261,
      "щэнхабзэм": 1262,
      "къыщалъ": 1263,
      "ри.": 1264,
      "фэр": 1265,
      "шыр": 1266,
      "тIыс": 1267,
      "IуэхущIапIэ": 1268,
      "чи": 1269,
      "цIыхум": 1270,
      "-нэ": 1271,
      "илъэси": 1272,
      "просмо": 1273,
      "мыхьэнэ": 1274,
      "зэхьэзэхуэм": 1275,
      "щыгъу": 1276,
      "дзы": 1277,
      "лю": 1278,
      "щIэкI": 1279,
      "командэ": 1280,
      "щIащ.": 1281,
      "плI": 1282,
      "вар": 1283,
      "ября": 1284,
      "бгъу": 1285,
      "журн": 1286,
      "Москва": 1287,
      "къра": 1288,
      "хьэу": 1289,
      "кIуэд": 1290,
      "егъэджакIуэ": 1291,
      "Зи": 1292,
      "Щэн": 1293,
      "мат": 1294,
      "медал": 1295,
      "Адыг": 1296,
      "мылъ": 1297,
      "нэхърэ": 1298,
      "«Спартак-": 1299,
      "спор": 1300,
      "жеIэ": 1301,
      "кадеми": 1302,
      "ыныгъэ": 1303,
      "нэхъыбэ": 1304,
      "нар": 1305,
      "лажь": 1306,
      "ейпсо": 1307,
      "зан": 1308,
      "шым": 1309,
      "Iыгъ": 1310,
      "увэ": 1311,
      "Алекс": 1312,
      "хьыр": 1313,
      "зэу": 1314,
      "СССР-м": 1315,
      "Спорт": 1316,
      "верси": 1317,
      "«Спартак-Налшык": 1318,
      "гъусэу": 1319,
      "зыщы": 1320,
      "щхьэхуэ": 1321,
      "псэху": 1322,
      "хъыджэб": 1323,
      "адыгэхэм": 1324,
      "при": 1325,
      "хъужь": 1326,
      "къудей": 1327,
      "тэкъым": 1328,
      "Джэ": 1329,
      "Олимп": 1330,
      "м.": 1331,
      "зэи": 1332,
      "цIыхухэр": 1333,
      "Мухьэмэ": 1334,
      "сып": 1335,
      "Iуэхугъуэ": 1336,
      "хам": 1337,
      "хъуауэ": 1338,
      "щэху": 1339,
      "етIуанэ": 1340,
      "саугъэ": 1341,
      "ящыщу": 1342,
      "щIэныгъэм": 1343,
      "дэкI": 1344,
      "Евро": 1345,
      "ЩIы": 1346,
      "жэуап": 1347,
      "мрэ": 1348,
      "дакъэ": 1349,
      "хъэн": 1350,
      "алъэр": 1351,
      "псту": 1352,
      "куэ": 1353,
      "Къэрал": 1354,
      "Къу": 1355,
      "къудам": 1356,
      "Мухьэмэд": 1357,
      "дэIэпы": 1358,
      "псын": 1359,
      "унэм": 1360,
      "тхыгъэ": 1361,
      "теат": 1362,
      "щIыкIэ": 1363,
      "усэ": 1364,
      "ЩIэ": 1365,
      "къыщи": 1366,
      "хьэн": 1367,
      "щIэхэр": 1368,
      "«К": 1369,
      "дар": 1370,
      "сам": 1371,
      "кIуэу": 1372,
      "абжьу": 1373,
      "нэхъыжь": 1374,
      "проек": 1375,
      "тхыдэм": 1376,
      "жан": 1377,
      "бзэкIэ": 1378,
      "ЛIы": 1379,
      "совет": 1380,
      "ныбжьыщIэ": 1381,
      "Мэз": 1382,
      "къызэрагъэ": 1383,
      "зэIуа": 1384,
      "уе": 1385,
      "зыри": 1386,
      "нэмыщI": 1387,
      "топ": 1388,
      "апхъэ": 1389,
      "ынымкIэ": 1390,
      "II": 1391,
      "На": 1392,
      "эри,": 1393,
      "щIыгъу": 1394,
      "хэту": 1395,
      "мэкъу": 1396,
      "щIалэгъу": 1397,
      "гуфIэ": 1398,
      "узын": 1399,
      "лъэгъуа": 1400,
      "зэрыщы": 1401,
      "ящыщщ": 1402,
      "щIо": 1403,
      "щIалэм": 1404,
      "ча": 1405,
      "ститу": 1406,
      "щIэныгъэлI": 1407,
      "22": 1408,
      "гушхуэ": 1409,
      "Иужь": 1410,
      "дзэм": 1411,
      "дзауэ": 1412,
      "куэдрэ": 1413,
      "папщIэ,": 1414,
      "хьы": 1415,
      "ыныр": 1416,
      "текIуэ": 1417,
      "жылагъуэ": 1418,
      "абр": 1419,
      "кхъу": 1420,
      "лъэхъэн": 1421,
      "они": 1422,
      "ейр": 1423,
      "универси": 1424,
      "Лъэпкъ": 1425,
      "Аслъэн": 1426,
      "Тхьэм": 1427,
      "кла": 1428,
      "рыт": 1429,
      "игу": 1430,
      "лар": 1431,
      "нэхъыб": 1432,
      "199": 1433,
      "тIо": 1434,
      "убыдэу": 1435,
      "еджапIэ": 1436,
      "Пэ": 1437,
      "хэтащ": 1438,
      "губ": 1439,
      "рав": 1440,
      "агъуэ": 1441,
      "ипэ": 1442,
      "ыныгъэм": 1443,
      "ствен": 1444,
      "Владими": 1445,
      "джылы": 1446,
      "дыщэ": 1447,
      "тэм": 1448,
      "кIуэцI": 1449,
      "ной": 1450,
      "тренер": 1451,
      "утыку": 1452,
      "тэр": 1453,
      "уэр": 1454,
      "ащхьэ": 1455,
      "пхъуэ": 1456,
      "рал": 1457,
      "джэн": 1458,
      "лъэщ": 1459,
      "фо": 1460,
      "еи": 1461,
      "щыгъэ": 1462,
      "А-м": 1463,
      "абэ": 1464,
      "сси": 1465,
      "ащи,": 1466,
      "Илъэс": 1467,
      "спортым": 1468,
      "Iэдакъэ": 1469,
      "сымэ": 1470,
      "жри": 1471,
      "ну.": 1472,
      "уэ,": 1473,
      "21": 1474,
      "+)": 1475,
      "ник": 1476,
      "унэтI": 1477,
      "фе": 1478,
      "зэпеуэм": 1479,
      "ного": 1480,
      "Ию": 1481,
      "Пре": 1482,
      "Чер": 1483,
      "лам": 1484,
      "пх": 1485,
      "хуабжьу": 1486,
      "ныбжьыр": 1487,
      "ЗэIу": 1488,
      "Ис": 1489,
      "пэр": 1490,
      "дым": 1491,
      "окъуэ": 1492,
      "рас": 1493,
      "мыIэ": 1494,
      "ати,": 1495,
      "град": 1496,
      "хуагъэфэ": 1497,
      "тхэм": 1498,
      "эу,": 1499,
      "мкIэ": 1500,
      "зэхъуэ": 1501,
      "апхуэдэу": 1502,
      "пшы": 1503,
      "гъуаз": 1504,
      "хыу": 1505,
      "кIыныгъэ": 1506,
      "зыщIэ": 1507,
      "Алий": 1508,
      "хьауэ": 1509,
      "ыры": 1510,
      "алэр": 1511,
      "Унафэ": 1512,
      "Ми": 1513,
      "ехьэлI": 1514,
      "рэм": 1515,
      "джэс": 1516,
      "ян": 1517,
      "То": 1518,
      "зэрыхъу": 1519,
      "жыг": 1520,
      "Александ": 1521,
      "хьэщIэ": 1522,
      "зэрызэ": 1523,
      "щигъэ": 1524,
      "алист": 1525,
      "коно": 1526,
      "здэ": 1527,
      "мым": 1528,
      "фащэ": 1529,
      "щIыну": 1530,
      "«Д": 1531,
      "хуигъэ": 1532,
      "фIащ": 1533,
      "лIа": 1534,
      "бэч": 1535,
      "гъэщIэгъуэн": 1536,
      "ию": 1537,
      "кан": 1538,
      "фэеплъ": 1539,
      "IэщIа": 1540,
      "лъэIу": 1541,
      "IэнатIэм": 1542,
      "зэмылIэужьыгъуэ": 1543,
      "кIи,": 1544,
      "зыте": 1545,
      "дыхьэ": 1546,
      "фащ": 1547,
      "хамэ": 1548,
      "лъэгъуэ": 1549,
      "телъы": 1550,
      "зыми": 1551,
      "194": 1552,
      "хъуэпс": 1553,
      "лIэщIы": 1554,
      "Шэр": 1555,
      "гуапэ": 1556,
      "хуащI": 1557,
      "-П": 1558,
      "бэн": 1559,
      "Тыркум": 1560,
      "щIэн": 1561,
      "Япэ": 1562,
      "хьэх": 1563,
      "каз": 1564,
      "28": 1565,
      "хьэры": 1566,
      "гугъ": 1567,
      "гъащIэр": 1568,
      "щыхьэт": 1569,
      "зауэм": 1570,
      "«А": 1571,
      "зыгуэр": 1572,
      "акIуэхэм": 1573,
      "щегъэ": 1574,
      "абар": 1575,
      "езыр": 1576,
      "пас": 1577,
      "щIыпIэм": 1578,
      "24": 1579,
      "халъ": 1580,
      "амкIэ,": 1581,
      "къэху": 1582,
      "Шэ": 1583,
      "29": 1584,
      "хьу": 1585,
      "Дж": 1586,
      "23": 1587,
      "коми": 1588,
      "итIым": 1589,
      "гупсысэ": 1590,
      "щІ": 1591,
      "газетАрхив": 1592,
      "ей,": 1593,
      "ува": 1594,
      "щIэныгъэхэм": 1595,
      "IэнатIэ": 1596,
      "Къар": 1597,
      "хэр»": 1598,
      "Щэнхабзэ": 1599,
      "год": 1600,
      "академи": 1601,
      "Шы": 1602,
      "лэжьыгъэр": 1603,
      "пIэр": 1604,
      "есс": 1605,
      "къриубыдэу": 1606,
      "щекIуэкIа": 1607,
      "Ху": 1608,
      "пэры": 1609,
      "нобэ": 1610,
      "куэдкIэ": 1611,
      "мелу": 1612,
      "къур": 1613,
      "програм": 1614,
      "къызэри": 1615,
      "зезыхьэ": 1616,
      "Европэм": 1617,
      "ный": 1618,
      "-кIэ": 1619,
      "бжыгъэ": 1620,
      "Бе": 1621,
      "бла": 1622,
      "къыхуэ": 1623,
      "ам.": 1624,
      "ант": 1625,
      "27": 1626,
      "ейрэ": 1627,
      "кило": 1628,
      "ский": 1629,
      "Псы": 1630,
      "щIэдзауэ": 1631,
      "хэри.": 1632,
      "ия": 1633,
      "уз": 1634,
      "сыма": 1635,
      "а,": 1636,
      "фIэщ": 1637,
      "нэ,": 1638,
      "щыхъу": 1639,
      "къудамэм": 1640,
      "щрагъэ": 1641,
      "куль": 1642,
      "фIу": 1643,
      "гъым": 1644,
      "жьыр": 1645,
      "хьэл": 1646,
      "еврал": 1647,
      "смен": 1648,
      "щхьэкIэ,": 1649,
      "ем,": 1650,
      "Нобэ": 1651,
      "ня": 1652,
      "тех": 1653,
      "щIу": 1654,
      "гъусэ": 1655,
      "197": 1656,
      "Iэн": 1657,
      "Бахъ": 1658,
      "дзэр": 1659,
      "сть": 1660,
      "Нэхъы": 1661,
      "Хэку": 1662,
      "зэIущIэ": 1663,
      "уп": 1664,
      "зэхъуэкIыныгъэ": 1665,
      "яху": 1666,
      "уэгъуэм": 1667,
      "къун": 1668,
      "дыдэм": 1669,
      "къуэш": 1670,
      "196": 1671,
      "аращ": 1672,
      "дежкIэ": 1673,
      "хе": 1674,
      "густа": 1675,
      "проф": 1676,
      "26": 1677,
      "бын": 1678,
      "аращ.": 1679,
      "рис": 1680,
      "Ав": 1681,
      "нэгу": 1682,
      "хуащ.": 1683,
      "щIидз": 1684,
      "щ:": 1685,
      "зэгъэ": 1686,
      "зыхэ": 1687,
      "хыж": 1688,
      "кIар": 1689,
      "республи": 1690,
      "лъэхъэнэм": 1691,
      "сь": 1692,
      "жыпIэмэ,": 1693,
      "арэзы": 1694,
      "хуэм": 1695,
      "щыгъуи": 1696,
      "феде": 1697,
      "ёр": 1698,
      "гуап": 1699,
      "кономи": 1700,
      "полити": 1701,
      "тащ.": 1702,
      "ак": 1703,
      "псэр": 1704,
      "Прези": 1705,
      "КIуэ": 1706,
      "50": 1707,
      "щыгъуазэ": 1708,
      "кIыу,": 1709,
      "андэрэ": 1710,
      "дауэ": 1711,
      "ных": 1712,
      "Сою": 1713,
      "фIыщIэ": 1714,
      "къуэм": 1715,
      "щхьэусы": 1716,
      "ырт.": 1717,
      "нур": 1718,
      "рт": 1719,
      "сын": 1720,
      "Що": 1721,
      "дэлъху": 1722,
      "ЩIалэ": 1723,
      "Бахъсэн": 1724,
      "ральнэ": 1725,
      "хутыр": 1726,
      "бжыгъэр": 1727,
      "бэнэ": 1728,
      "ауэ.": 1729,
      "од": 1730,
      "утIы": 1731,
      "08": 1732,
      "доктор": 1733,
      "лIыкIуэ": 1734,
      "Про": 1735,
      "хъунущ.": 1736,
      "къыд": 1737,
      "екIуэкI": 1738,
      "Iэры": 1739,
      "зэIущIэм": 1740,
      "тен": 1741,
      "Зэры": 1742,
      "пэж": 1743,
      "хуэдэу,": 1744,
      "шагъэр": 1745,
      "гуащIэ": 1746,
      "урысы": 1747,
      "хэку": 1748,
      "СШ": 1749,
      "къуэр": 1750,
      "ург": 1751,
      "къызэгъэ": 1752,
      "лъандэрэ": 1753,
      "кIэлъыплъ": 1754,
      "АрщхьэкIэ": 1755,
      "сурэт": 1756,
      "сэр": 1757,
      "хащ.": 1758,
      "нэу": 1759,
      "дэмы": 1760,
      "бек": 1761,
      "лыр": 1762,
      "ым»": 1763,
      "ащ:": 1764,
      "ну,": 1765,
      "зэгухьэныгъэм": 1766,
      "шей": 1767,
      "ирихьэлIэ": 1768,
      "Лэ": 1769,
      "насып": 1770,
      "лътI": 1771,
      "цIыкIум": 1772,
      "спортсмен": 1773,
      "тров": 1774,
      "къыхигъэ": 1775,
      "Бэ": 1776,
      "и.": 1777,
      "Мэзкуу": 1778,
      "акъы": 1779,
      "раз": 1780,
      "пэт": 1781,
      "просмотров": 1782,
      "логие": 1783,
      "рт.": 1784,
      "дэтхэнэ": 1785,
      "гъат": 1786,
      "зыхуей": 1787,
      "фон": 1788,
      "Пар": 1789,
      "Iи": 1790,
      "Хас": 1791,
      "дрей": 1792,
      "зыужь": 1793,
      "министер": 1794,
      "псэм": 1795,
      "Къан": 1796,
      "курыт": 1797,
      "къегъэ": 1798,
      "бзылъху": 1799,
      "унагъуэм": 1800,
      "еп": 1801,
      "198": 1802,
      "Да": 1803,
      "нэ.": 1804,
      "Ба": 1805,
      "лъэгъуащ": 1806,
      "Щхьэ": 1807,
      "гуэру": 1808,
      "ж,": 1809,
      "Кавказым": 1810,
      "къэгъу": 1811,
      "дан": 1812,
      "жри,": 1813,
      "кIыпIэ": 1814,
      "хуейуэ": 1815,
      "атIэ": 1816,
      "нап": 1817,
      "шэм": 1818,
      "филь": 1819,
      "Заур": 1820,
      "иджыблагъэ": 1821,
      "ыгъуэм": 1822,
      "Iыхьэ": 1823,
      "лъэпкъэгъу": 1824,
      "университетым": 1825,
      "кI.": 1826,
      "щIэлъ": 1827,
      "«Адыгэ": 1828,
      "ном": 1829,
      "щри": 1830,
      "дер": 1831,
      "щIе": 1832,
      "хуо": 1833,
      "цер": 1834,
      "дыгъэ": 1835,
      "2018": 1836,
      "хабзэр": 1837,
      "дза": 1838,
      "зра": 1839,
      "быдэ": 1840,
      "ыну.": 1841,
      "пашэ": 1842,
      "♦194": 1843,
      "яхэт": 1844,
      "зэп": 1845,
      "унафэм": 1846,
      "Iэзэ": 1847,
      "кIауэ": 1848,
      "къыще": 1849,
      "тэкъым,": 1850,
      "акт": 1851,
      "махуэр": 1852,
      "нэмыщIауэ,": 1853,
      "стан": 1854,
      "кач": 1855,
      "гъыр": 1856,
      "бжьы": 1857,
      "метр": 1858,
      "иро": 1859,
      "зэте": 1860,
      "упщI": 1861,
      "мафIэ": 1862,
      "еплъы": 1863,
      "энджэ": 1864,
      "Iуащхьэм": 1865,
      "щынэмыщIауэ,": 1866,
      "зэран": 1867,
      "апхуэдиз": 1868,
      "ымкIэ": 1869,
      "Тхьэ": 1870,
      "ир": 1871,
      "институ": 1872,
      "?!": 1873,
      "ом": 1874,
      "лэжьэн": 1875,
      "IэщIагъэлI": 1876,
      "лъабжь": 1877,
      "зэхуа": 1878,
      "экономи": 1879,
      "зекIуэ": 1880,
      "хэкум": 1881,
      "расно": 1882,
      "ессор": 1883,
      ".00": 1884,
      "ентым": 1885,
      "нэхъыщхьэр": 1886,
      "кар": 1887,
      "нэху": 1888,
      "нэр": 1889,
      "щиIэ": 1890,
      ".0": 1891,
      "щIэт": 1892,
      "кIуащ.": 1893,
      "IуэхукIэ": 1894,
      "Iащ.": 1895,
      "Ни": 1896,
      "Щы": 1897,
      "зригъэ": 1898,
      "хуэрэ": 1899,
      "къызыхэ": 1900,
      "Борис": 1901,
      "!»": 1902,
      "мэш": 1903,
      "атым": 1904,
      "Iум": 1905,
      "къуэдзэ": 1906,
      "дек": 1907,
      "къалъы": 1908,
      "псэлъыхь": 1909,
      "ырей": 1910,
      "илъэсым": 1911,
      "хэлъхьэ": 1912,
      "ке": 1913,
