{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 1,
      "content": "[PAD]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "[UNK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "[CLS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 4,
      "content": "[SEP]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 5,
      "content": "[MASK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 6,
      "content": "жь",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 7,
      "content": "ку",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 8,
      "content": "кӀ",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 9,
      "content": "кIу",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 10,
      "content": "къ",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 11,
      "content": "къу",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 12,
      "content": "кхъ",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 13,
      "content": "кхъу",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 14,
      "content": "лъ",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 15,
      "content": "лI",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 16,
      "content": "пI",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 17,
      "content": "тI",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 18,
      "content": "фI",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 19,
      "content": "ху",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 20,
      "content": "хь",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 21,
      "content": "хъ",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 22,
      "content": "хъу",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 23,
      "content": "цI",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 24,
      "content": "щI",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 25,
      "content": "Ӏу",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 26,
      "content": "хуэ",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 27,
      "content": "во",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 28,
      "content": "рэ",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 29,
      "content": "зэ",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 30,
      "content": "де",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 31,
      "content": "зо",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 32,
      "content": "ар",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 33,
      "content": "ди",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 34,
      "content": "ремы",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 35,
      "content": "эрэ",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 36,
      "content": "дэ",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 37,
      "content": "ры",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 38,
      "content": "эж",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 39,
      "content": "ри",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 40,
      "content": "ыж",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 41,
      "content": "фы",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 42,
      "content": "мы",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 43,
      "content": "ау",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 44,
      "content": "щы",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 45,
      "content": "къым",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 46,
      "content": "хуа",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 47,
      "content": "эм",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 48,
      "content": "ат",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 49,
      "content": "хэ",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 50,
      "content": "нщ",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 51,
      "content": "зы",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 52,
      "content": "жы",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 53,
      "content": "тэ",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 54,
      "content": "ро",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 55,
      "content": "ды",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 56,
      "content": "хы",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 57,
      "content": "къэ",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 58,
      "content": "рызы",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 59,
      "content": "ащ",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 60,
      "content": "ре",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 61,
      "content": "да",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 62,
      "content": "до",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 63,
      "content": "ам",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 64,
      "content": "гъэ",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 65,
      "content": "вэ",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 66,
      "content": "ми",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 67,
      "content": "къы",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 68,
      "content": "ын",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 69,
      "content": "ха",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 70,
      "content": "эн",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 71,
      "content": "фӀэ",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 72,
      "content": "ущ",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 73,
      "content": "ра",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    }
  ],
  "normalizer": null,
  "pre_tokenizer": null,
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "Unigram",
    "unk_id": 0,
    "vocab": [
      [
        "UNK",
        0.0
      ],
      [
        "[PAD]",
        0.0
      ],
      [
        "[UNK]",
        0.0
      ],
      [
        "[CLS]",
        0.0
      ],
      [
        "[SEP]",
        0.0
      ],
      [
        "[MASK]",
        0.0
      ],
      [
        " ",
        -2.7582914437687265
      ],
      [
        "\n",
        -3.106807971225951
      ],
      [
        "р ",
        -4.408982936928574
      ],
      [
        "м ",
        -4.4155830579449695
      ],
      [
        "и ",
        -4.497477714525223
      ],
      [
        "у ",
        -4.547492379469009
      ],
      [
        "у",
        -4.629583934071995
      ],
      [
        "щ ",
        -4.849930382950426
      ],
      [
        "хэр ",
        -5.083396427110323
      ],
      [
        "и",
        -5.1133486926668255
      ],
      [
        "зы",
        -5.170117587105027
      ],
      [
        "хэм ",
        -5.177385562142124
      ],
      [
        "с",
        -5.199744379100586
      ],
      [
        "ри ",
        -5.304990467277003
      ],
      [
        "кӀэ ",
        -5.3461050541943695
      ],
      [
        "т ",
        -5.3501193339483635
      ],
      [
        "рэ ",
        -5.413282368967305
      ],
      [
        "а ",
        -5.4180061450590085
      ],
      [
        "ым ",
        -5.4433324933911695
      ],
      [
        "ар ",
        -5.458649280979689
      ],
      [
        "щы",
        -5.4852018525643835
      ],
      [
        "ыр ",
        -5.488513117434287
      ],
      [
        "я",
        -5.528649382829869
      ],
      [
        "зэ",
        -5.552274256352671
      ],
      [
        "мы",
        -5.552716929537114
      ],
      [
        "а",
        -5.580506917916628
      ],
      [
        "т",
        -5.59647788934242
      ],
      [
        "п",
        -5.611135205209129
      ],
      [
        "е",
        -5.6119010438425185
      ],
      [
        "гъэ",
        -5.661170441605689
      ],
      [
        "абы ",
        -5.676841953870127
      ],
      [
        "сы",
        -5.679088287700774
      ],
      [
        "ми ",
        -5.735799934812963
      ],
      [
        "къы",
        -5.738299344019671
      ],
      [
        "ащ ",
        -5.800893107370079
      ],
      [
        "н",
        -5.828858221011258
      ],
      [
        "н ",
        -5.836977804183178
      ],
      [
        "д",
        -5.844212390655722
      ],
      [
        "ауэ ",
        -5.849086541234296
      ],
      [
        "мэ ",
        -5.879333760771523
      ],
      [
        "щӀэ",
        -5.88102807356656
      ],
      [
        "зэры",
        -5.88267871708376
      ],
      [
        "хьэ",
        -5.89313661946278
      ],
      [
        "м",
        -5.894944870255419
      ],
      [
        "я ",
        -5.9242065532055594
      ],
      [
        "р",
        -5.934538636124703
      ],
      [
        "дэ",
        -5.978416206599313
      ],
      [
        "м и ",
        -6.024996228599706
      ],
      [
        "къа",
        -6.055041296149058
      ],
      [
        "уэ ",
        -6.066662456540833
      ],
      [
        "з",
        -6.068741434273949
      ],
      [
        "ды",
        -6.089042803536325
      ],
      [
        "Ӏэ",
        -6.128502477901906
      ],
      [
        "нэ",
        -6.139820932275162
      ],
      [
        "гу",
        -6.145672855972029
      ],
      [
        "мэ",
        -6.1701133255875025
      ],
      [
        "ы",
        -6.173057716066337
      ],
      [
        "ху",
        -6.193909621246741
      ],
      [
        "ди ",
        -6.200294521531324
      ],
      [
        "хуэ",
        -6.206079357026246
      ],
      [
        "хэ",
        -6.221401582033469
      ],
      [
        "къэ",
        -6.2376379988240735
      ],
      [
        "мрэ ",
        -6.241470210704721
      ],
      [
        "хэм я ",
        -6.266120655963396
      ],
      [
        "Ӏу",
        -6.269920738416689
      ],
      [
        "те",
        -6.283167975886952
      ],
      [
        "ф",
        -6.328986726178936
      ],
      [
        "лъэ",
        -6.365382778922044
      ],
      [
        "к",
        -6.4026345601156205
      ],
      [
        "о",
        -6.406291674329482
      ],
      [
        "на",
        -6.413391059120141
      ],
      [
        "рт ",
        -6.4162393322120295
      ],
      [
        "щӀы",
        -6.421134784285211
      ],
      [
        "кӀэ",
        -6.4279505361789155
      ],
      [
        "къи",
        -6.441583075157665
      ],
      [
        "да",
        -6.465629370020208
      ],
      [
        "щ",
        -6.469894138620258
      ],
      [
        "ри",
        -6.475847704974122
      ],
      [
        "б",
        -6.4837847451268935
      ],
      [
        "къым ",
        -6.491993401869426
      ],
      [
        "къе",
        -6.499384613121382
      ],
      [
        "ры",
        -6.504705704025582
      ],
      [
        "шы",
        -6.530342319455947
      ],
      [
        "хъу",
        -6.532726829338094
      ],
      [
        "уэ",
        -6.536273494550912
      ],
      [
        "си ",
        -6.553778657754259
      ],
      [
        "нэхъ ",
        -6.56283301022283
      ],
      [
        "ра",
        -6.572269411918763
      ],
      [
        "уи ",
        -6.5952347833981815
      ],
      [
        "ну ",
        -6.609047950321333
      ],
      [
        "фэ",
        -6.609318967630168
      ],
      [
        "мкӀэ ",
        -6.609867891457476
      ],
      [
        "шэ",
        -6.618315451671442
      ],
      [
        "къу",
        -6.624055472857346
      ],
      [
        "гъу",
        -6.633736281025561
      ],
      [
        "ш",
        -6.684594453732759
      ],
      [
        "в",
        -6.68844922004673
      ],
      [
        "пэ",
        -6.6904480473042405
      ],
      [
        "лъ",
        -6.700561281106621
      ],
      [
        "сэ ",
        -6.7096419513707595
      ],
      [
        "ты",
        -6.712660334718247
      ],
      [
        "нэ ",
        -6.719560327814193
      ],
      [
        "къыщы",
        -6.725879830276872
      ],
      [
        "ма",
        -6.727040468127239
      ],
      [
        "за",
        -6.743669958975415
      ],
      [
        "сэ",
        -6.752076682684338
      ],
      [
        "хэмрэ ",
        -6.753502132301515
      ],
      [
        "гъэм ",
        -6.756717156942274
      ],
      [
        "Ӏ",
        -6.763364463671959
      ],
      [
        "19",
        -6.767941286507378
      ],
      [
        "ар",
        -6.773311244153819
      ],
      [
        "щхьэ",
        -6.779173233844032
      ],
      [
        "са",
        -6.795329879162669
      ],
      [
        "ж",
        -6.802894911341054
      ],
      [
        "ща",
        -6.80737931171859
      ],
      [
        "ди",
        -6.820139079571206
      ],
      [
        "фы",
        -6.845462945633017
      ],
      [
        "зи ",
        -6.85645300320488
      ],
      [
        "зы ",
        -6.856892039390939
      ],
      [
        "бэ",
        -6.8650088052926765
      ],
      [
        "э",
        -6.868778089828902
      ],
      [
        "л",
        -6.87504052377016
      ],
      [
        "рэ",
        -6.876507112882624
      ],
      [
        "кӀуэ",
        -6.880943316442853
      ],
      [
        "ым и ",
        -6.887383087836884
      ],
      [
        "до",
        -6.897801220614728
      ],
      [
        "къуэ",
        -6.913777184464317
      ],
      [
        "фӀэ",
        -6.91417287636841
      ],
      [
        "та",
        -6.916336583550613
      ],
      [
        "урэ ",
        -6.924192417707431
      ],
      [
        "ла",
        -6.9307294114448545
      ],
      [
        "ха",
        -6.938762477229195
      ],
      [
        "ны",
        -6.943180952381795
      ],
      [
        "ба",
        -6.947932287529374
      ],
      [
        "зи",
        -6.9492476077703795
      ],
      [
        "тэ",
        -6.960459040123686
      ],
      [
        "щэ",
        -6.967650338092952
      ],
      [
        "къо",
        -6.967686202807153
      ],
      [
        "х ",
        -6.982248878899913
      ],
      [
        "гъа",
        -6.98921734005024
      ],
      [
        "хы",
        -6.999777461176324
      ],
      [
        "ро",
        -7.0108192076087565
      ],
      [
        "щӀа",
        -7.016065976576719
      ],
      [
        "хэри ",
        -7.021994946553372
      ],
      [
        "кӀы",
        -7.027361943938141
      ],
      [
        "е ",
        -7.035430517661654
      ],
      [
        "къызэры",
        -7.036475670149963
      ],
      [
        "ре",
        -7.0532144647423
      ],
      [
        "па",
        -7.057046463429659
      ],
      [
        "ахэр ",
        -7.063444509715724
      ],
      [
        "адыгэ ",
        -7.081620410268748
      ],
      [
        "ли",
        -7.100175386855392
      ],
      [
        "ным ",
        -7.105466241299611
      ],
      [
        "г",
        -7.108987251059363
      ],
      [
        "бгъэ",
        -7.127156631737613
      ],
      [
        "жы",
        -7.127714512391247
      ],
      [
        "гъуэ",
        -7.132303643157778
      ],
      [
        "х",
        -7.138789008556381
      ],
      [
        "цӀыху",
        -7.139017063865433
      ],
      [
        "со",
        -7.142780673124667
      ],
      [
        "си",
        -7.1466669631585376
      ],
      [
        "де",
        -7.149823788948325
      ],
      [
        "ч",
        -7.161940053849216
      ],
      [
        "лэ",
        -7.168601284453011
      ],
      [
        "икӀи ",
        -7.16938495632883
      ],
      [
        "псы",
        -7.203458727787133
      ],
      [
        "ти ",
        -7.230843122807601
      ],
      [
        "абы и ",
        -7.233074933198221
      ],
      [
        "ку",
        -7.236469974814325
      ],
      [
        "ж ",
        -7.2426366129273685
      ],
      [
        "джэ",
        -7.251248210368562
      ],
      [
        "кӀ ",
        -7.251973180310129
      ],
      [
        "дэ ",
        -7.259404703474377
      ],
      [
        "хьа",
        -7.261332449328323
      ],
      [
        "то",
        -7.268609272921864
      ],
      [
        "къызэ",
        -7.301334317320938
      ],
      [
        "л ",
        -7.317377137401822
      ],
      [
        "бы",
        -7.325932224936839
      ],
      [
        "уа",
        -7.325993106483136
      ],
      [
        "къэбэрдей балъкъ",
        -7.32780941426379
      ],
      [
        "хэми ",
        -7.331048575801395
      ],
      [
        "зэра",
        -7.340915856756517
      ],
      [
        "ша",
        -7.3411301046516275
      ],
      [
        "жа",
        -7.343045629506568
      ],
      [
        "кӀи ",
        -7.3496126187508395
      ],
      [
        "цӀыху ",
        -7.35028570378458
      ],
      [
        "игъэ",
        -7.352224466876768
      ],
      [
        "пӀэ",
        -7.355641165249169
      ],
      [
        "ыну ",
        -7.361153223805767
      ],
      [
        "ц",
        -7.363311121606602
      ],
      [
        "хэм я",
        -7.3660162568254215
      ],
      [
        "илъэс ",
        -7.370452996185122
      ],
      [
        "хь",
        -7.370825329329328
      ],
      [
        "кӀа",
        -7.378295622970365
      ],
      [
        "ири",
        -7.379747546966357
      ],
      [
        "жьэ",
        -7.380816368073221
      ],
      [
        "лы",
        -7.397119948938064
      ],
      [
        "щи",
        -7.398964908446267
      ],
      [
        "кӀу",
        -7.3999405509256455
      ],
      [
        "жьы",
        -7.4046060135344725
      ],
      [
        "мы ",
        -7.40684815152809
      ],
      [
        "тхьэ",
        -7.408048233736585
      ],
      [
        "мо",
        -7.4122249382358305
      ],
      [
        "хуа",
        -7.420675784482576
      ],
      [
        "зыгъэ",
        -7.421322895164977
      ],
      [
        "лъэпкъ ",
        -7.4226143426349385
      ],
      [
        "дзэ",
        -7.442217393489248
      ],
      [
        "зе",
        -7.442428107488265
      ],
      [
        "по",
        -7.455200338171098
      ],
      [
        "тэкъым ",
        -7.457727465873321
      ],
      [
        "ымрэ ",
        -7.459832979260323
      ],
      [
        "жэ",
        -7.46190199915803
      ],
      [
        "ка",
        -7.470773842062815
      ],
      [
        "лъа",
        -7.472630473620967
      ],
      [
        "с ",
        -7.473190241355969
      ],
      [
        "щи ",
        -7.4749894116721265
      ],
      [
        "хэт ",
        -7.47530403877634
      ],
      [
        "бо",
        -7.476191634313274
      ],
      [
        "сыт ",
        -7.478090578194587
      ],
      [
        "къ",
        -7.486568722587574
      ],
      [
        "апхуэдэ ",
        -7.4946624842638165
      ],
      [
        "мыгъэ",
        -7.498288837109108
      ],
      [
        "хъуэ",
        -7.500740738219017
      ],
      [
        "абыхэм ",
        -7.502828146420159
      ],
      [
        "ныр ",
        -7.504026528093338
      ],
      [
        "ис",
        -7.511113061160666
      ],
      [
        "ырт ",
        -7.51212141963434
      ],
      [
        "ти",
        -7.5133611468577985
      ],
      [
        "ркъым ",
        -7.531641917147162
      ],
      [
        "иджы ",
        -7.532819929707362
      ],
      [
        "жащ ",
        -7.53470326998999
      ],
      [
        "фа",
        -7.538061097535948
      ],
      [
        "зэри",
        -7.539641237621922
      ],
      [
        "аращ ",
        -7.542667355502481
      ],
      [
        "ми",
        -7.543537298995874
      ],
      [
        "пы",
        -7.5511025146953
      ],
      [
        "Ӏуэ",
        -7.567479944439542
      ],
      [
        "жиӀащ ",
        -7.57239207006222
      ],
      [
        "хэт",
        -7.576281400358775
      ],
      [
        "ва",
        -7.587079486666418
      ],
      [
        "се",
        -7.591079839639665
      ],
      [
        "пщы",
        -7.594863607190769
      ],
      [
        "зэхэ",
        -7.59681682461404
      ],
      [
        "акъым ",
        -7.59863368760287
      ],
      [
        "жь",
        -7.59915066094147
      ],
      [
        "згъэ",
        -7.601625781072865
      ],
      [
        "хьы",
        -7.602427938544894
      ],
      [
        "ни",
        -7.606099143920826
      ],
      [
        "плъэ",
        -7.617013491115783
      ],
      [
        "ин",
        -7.62236625869525
      ],
      [
        "фӀы",
        -7.623141426395225
      ],
      [
        "ат ",
        -7.629807876585675
      ],
      [
        "нщ ",
        -7.631534240953783
      ],
      [
        "лъагъу",
        -7.631920739265507
      ],
      [
        "ло",
        -7.631935714361571
      ],
      [
        "щыӀэ",
        -7.637119245399916
      ],
      [
        "Ӏуэху",
        -7.638705541530355
      ],
      [
        "à",
        -7.647254159913025
      ],
      [
        "псэу",
        -7.651218643528203
      ],
      [
        "нущ ",
        -7.657127343150615
      ],
      [
        "къэрал ",
        -7.658690668976666
      ],
      [
        "ɚ",
        -7.661894822516144
      ],
      [
        "илъэс",
        -7.668235804791289
      ],
      [
        "лӀэ",
        -7.672009017943024
      ],
      [
        "жь ",
        -7.672634155916178
      ],
      [
        "лъы",
        -7.677472741759896
      ],
      [
        "хэмкӀэ ",
        -7.677778330839459
      ],
      [
        "хьащ ",
        -7.684550842042686
      ],
      [
        "й",
        -7.6849440003762535
      ],
      [
        "ит",
        -7.688261943570616
      ],
      [
        "гуэ",
        -7.69336332338221
      ],
      [
        "къыз",
        -7.693647978453535
      ],
      [
        "апхуэдэу ",
        -7.6948086951344745
      ],
      [
        "гу ",
        -7.697999627732125
      ],
      [
        "лъхьэ",
        -7.70237224385488
      ],
      [
        "къыхэ",
        -7.708841790356189
      ],
      [
        "Ӏо",
        -7.7120271751207365
      ],
      [
        "гъ ",
        -7.714844860564845
      ],
      [
        "зэ ",
        -7.716358797661684
      ],
      [
        "й ",
        -7.723125270782349
      ],
      [
        "егъэ",
        -7.727185119137246
      ],
      [
        "пщӀэ",
        -7.728038267104251
      ],
      [
        "жу ",
        -7.729578350357157
      ],
      [
        "э ",
        -7.733096490804062
      ],
      [
        "гъэ ",
        -7.733766225050013
      ],
      [
        "нэгъуэщӀ ",
        -7.734067832009767
      ],
      [
        "щыт",
        -7.73466728496275
      ],
      [
        "во",
        -7.736323390297569
      ],
      [
        "псалъэ",
        -7.739698108438423
      ],
      [
        "ле",
        -7.740616766764862
      ],
      [
        "ей ",
        -7.742177327999812
      ],
      [
        "фи",
        -7.743331480432772
      ],
      [
        "псэ",
        -7.74341387866612
      ],
      [
        "12 ",
        -7.744766161704593
      ],
      [
        "нур ",
        -7.752869108417954
      ],
      [
        "20",
        -7.755086090525772
      ],
      [
        "ягъэ",
        -7.755855400923005
      ],
      [
        "къыс",
        -7.758370675083947
      ],
      [
        "ɷ",
        -7.763804183368537
      ],
      [
        "тӀэ",
        -7.768426557810567
      ],
      [
        "дгъэ",
        -7.77317072515932
      ],
      [
        "хабзэ",
        -7.773625085247533
      ],
      [
        "фэ ",
        -7.774422025985155
      ],
      [
        "псори ",
        -7.77773129638874
      ],
      [
        "хуэдэу ",
        -7.7778988369364725
      ],
      [
        "ю",
        -7.783893300939788
      ],
      [
        "унэ",
        -7.786964725346923
      ],
      [
        "не",
        -7.78794594279273
      ],
      [
        "хэу ",
        -7.788335994943154
      ],
      [
        "го",
        -7.79479529271844
      ],
      [
        "нэс",
        -7.796232604641114
      ],
      [
        "шхуэ ",
        -7.79661940639439
      ],
      [
        "мыхъу",
        -7.796683917335963
      ],
      [
        "къыдэ",
        -7.803888797949371
      ],
      [
        "00 ",
        -7.8057700742716065
      ],
      [
        "2 ",
        -7.808617096059502
      ],
      [
        "би",
        -7.815621545964024
      ],
      [
        "хь ",
        -7.821324120431198
      ],
      [
        "гъуэ ",
        -7.824154771253923
      ],
      [
        "ш ",
        -7.830756703254799
      ],
      [
        "к ",
        -7.839208250249532
      ],
      [
        "зо",
        -7.840036695143663
      ],
      [
        "йо",
        -7.842197072301378
      ],
      [
        "м и",
        -7.8503151210784985
      ],
      [
        "ын ",
        -7.851855110893267
      ],
      [
        "Ӏа",
        -7.854508223085979
      ],
      [
        "му",
        -7.858144559850155
      ],
      [
        "пщэ",
        -7.860596551214298
      ],
      [
        "умы",
        -7.861447792088818
      ],
      [
        "щхьэ ",
        -7.868423314249007
      ],
      [
        "япэ ",
        -7.870849375693394
      ],
      [
        "ст",
        -7.872592782831539
      ],
      [
        "фӀыуэ ",
        -7.876888192121456
      ],
      [
        "хи",
        -7.87692701066624
      ],
      [
        "хо",
        -7.877545046269438
      ],
      [
        "ан",
        -7.877839067621119
      ],
      [
        "но",
        -7.87859107803297
      ],
      [
        "кӀуэ ",
        -7.878948198291509
      ],
      [
        "бзэ",
        -7.880871401627406
      ],
      [
        "кӀыу ",
        -7.885932654825801
      ],
      [
        "чы",
        -7.886427310732703
      ],
      [
        "махуэ",
        -7.887662948137004
      ],
      [
        "тет",
        -7.887840943612032
      ],
      [
        "щӀ ",
        -7.88820427406583
      ],
      [
        "бе",
        -7.893191228174993
      ],
      [
        "пхъэ",
        -7.89413373030747
      ],
      [
        "ó",
        -7.895975606804685
      ],
      [
        "лӀы",
        -7.898119411628887
      ],
      [
        "щӀ",
        -7.899885912599597
      ],
      [
        "джа",
        -7.900897944900095
      ],
      [
        "увэ",
        -7.902443786937274
      ],
      [
        "шӀэ",
        -7.91092558882724
      ],
      [
        "ще",
        -7.920041337049636
      ],
      [
        "Ӏуэху ",
        -7.920964025377991
      ],
      [
        "ынущ ",
        -7.922848077300392
      ],
      [
        "жан",
        -7.923284864125742
      ],
      [
        "щӀалэ",
        -7.923526661215012
      ],
      [
        "къэс",
        -7.924361364925771
      ],
      [
        "20 ",
        -7.92760530755416
      ],
      [
        "ко",
        -7.927697731493046
      ],
      [
        "ира",
        -7.932058381218479
      ],
      [
        "гъуэт",
        -7.933974497714933
      ],
      [
        "апхуэдэ",
        -7.937030553682765
      ],
      [
        "имы",
        -7.93875359065091
      ],
      [
        "хъуа",
        -7.939162875271993
      ],
      [
        "джэгу",
        -7.941070572136047
      ],
      [
        "три",
        -7.942182809123505
      ],
      [
        "джы",
        -7.945465078652269
      ],
      [
        "ригъэ",
        -7.948021757370171
      ],
      [
        "рщ ",
        -7.948580915900191
      ],
      [
        "чэ",
        -7.950935910079391
      ],
      [
        "къып",
        -7.952694578469183
      ],
      [
        "ей",
        -7.952834896744175
      ],
      [
        "къыт",
        -7.956343009996804
      ],
      [
        "къуажэм ",
        -7.957432925008174
      ],
      [
        "р зы",
        -7.958808078583699
      ],
      [
        "цӀыкӀу",
        -7.961112395112325
      ],
      [
        "лъапӀэ",
        -7.9614559102573494
      ],
      [
        "лӀа",
        -7.961843586164147
      ],
      [
        "куэд ",
        -7.963284616764591
      ],
      [
        "жиӀэ",
        -7.963695734407695
      ],
      [
        "тхы",
        -7.963808364267585
      ],
      [
        "щӀи",
        -7.964431451761202
      ],
      [
        "Ӏуэхур ",
        -7.964742665788643
      ],
      [
        "ру",
        -7.964958336744589
      ],
      [
        "в ",
        -7.969722573909102
      ],
      [
        "шхуэ",
        -7.9702488725616405
      ],
      [
        "щэху",
        -7.977356125580203
      ],
      [
        "ȏ",
        -7.983461257161805
      ],
      [
        "пе",
        -7.984568669752683
      ],
      [
        "зэфӀэкӀ",
        -7.985101520755027
      ],
      [
        "унэм ",
        -7.988640229982657
      ],
      [
        "дунейм ",
        -7.990266993136601
      ],
      [
        "къыте",
        -7.991190040587716
      ],
      [
        "къуэ ",
        -7.993871126496671
      ],
      [
        "кӀащ ",
        -7.996270558671336
      ],
      [
        "фӀ",
        -8.000333908332575
      ],
      [
        "ту",
        -8.001061851692448
      ],
      [
        "иджыри ",
        -8.009555535019183
      ],
      [
        "è",
        -8.010317660876334
      ],
      [
        "ви",
        -8.012180497904016
      ],
      [
        "8 ",
        -8.013629462658471
      ],
      [
        "ал",
        -8.013704754107573
      ],
      [
        "ев ",
        -8.014326572541087
      ],
      [
        "гъащӀэм ",
        -8.01433629410991
      ],
      [
        "дэс",
        -8.016672691533703
      ],
      [
        "нобэ ",
        -8.017214936491412
      ],
      [
        "деж ",
        -8.018546914996659
      ],
      [
        "тра",
        -8.02440658135308
      ],
      [
        "гъо",
        -8.025794930698794
      ],
      [
        "лэжьыгъэ",
        -8.026624192177119
      ],
      [
        "псалъэ ",
        -8.029586774597698
      ],
      [
        "шэ ",
        -8.029919740415258
      ],
      [
        "же",
        -8.031333095183248
      ],
      [
        "цӀэ",
        -8.031867937122257
      ],
      [
        "зыри ",
        -8.03700145182018
      ],
      [
        "пи",
        -8.037154319281244
      ],
      [
        "къэзы",
        -8.042648695726502
      ],
      [
        "хьэщӀэ",
        -8.043412517637789
      ],
      [
        "телъ",
        -8.043886942775499
      ],
      [
        "щэ ",
        -8.045228316743847
      ],
      [
        "адыгэ",
        -8.048967231130877
      ],
      [
        "ɵ",
        -8.050623155061844
      ],
      [
        "пӀэ ",
        -8.052007948014271
      ],
      [
        "щызэ",
        -8.054275672369359
      ],
      [
        "ий ",
        -8.055846158332931
      ],
      [
        "езы",
        -8.056791349130783
      ],
      [
        "арщхьэкӀэ ",
        -8.057108290719967
      ],
      [
        "тащ ",
        -8.061777995019774
      ],
      [
        "хьэ ",
        -8.066337226949395
      ],
      [
        "1 ",
        -8.069296646934108
      ],
      [
        "бгъу",
        -8.07050058278681
      ],
      [
        "гъуа",
        -8.071562763789034
      ],
      [
        "м къы",
        -8.071888171289709
      ],
      [
        "махуэ ",
        -8.072750894919594
      ],
      [
        "блэ",
        -8.076631774944168
      ],
      [
        "лъ ",
        -8.079065828614556
      ],
      [
        "хъумэ",
        -8.079578577405059
      ],
      [
        "налшык ",
        -8.08142764721901
      ],
      [
        "гум ",
        -8.0819135477043
      ],
      [
        "ду",
        -8.082479846007427
      ],
      [
        "къри",
        -8.083869608447136
      ],
      [
        "хуе",
        -8.084359033554028
      ],
      [
        "ну",
        -8.084961099903488
      ],
      [
        "гъы",
        -8.091154347217064
      ],
      [
        "бжэ",
        -8.092088705690658
      ],
      [
        "щӀащ ",
        -8.10041488458559
      ],
      [
        " куэд ",
        -8.103093851522559
      ],
      [
        "про",
        -8.10698919238996
      ],
      [
        "7 ",
        -8.110204100630334
      ],
      [
        " хъу",
        -8.11360525743524
      ],
      [
        "ɭ",
        -8.116286641050001
      ],
      [
        "дза",
        -8.116909985451707
      ],
      [
        "нэхъыфӀ",
        -8.117126981318178
      ],
      [
        "дж",
        -8.119060769851446
      ],
      [
        "къуа",
        -8.122221345148347
      ],
      [
        "дахэ",
        -8.122383566435843
      ],
      [
        "къыщӀэ",
        -8.122650023849818
      ],
      [
        "кӀ",
        -8.1228650654336
      ],
      [
        "тэ ",
        -8.123586447660673
      ],
      [
        "хэлъ",
        -8.124844550348243
      ],
      [
        "ыж",
        -8.124972382144845
      ],
      [
        "хуей",
        -8.127262404107729
      ],
      [
        "жаӀэ",
        -8.128563282820567
      ],
      [
        "хуэдэ",
        -8.129491693445722
      ],
      [
        "ныкъуэ",
        -8.130291038501197
      ],
      [
        "куэд",
        -8.131140459517365
      ],
      [
        "ртэкъым ",
        -8.13168712694545
      ],
      [
        "къыща",
        -8.134441462635415
      ],
      [
        " дыдэ",
        -8.136079287769467
      ],
      [
        "щыӀэ ",
        -8.14292852139013
      ],
      [
        "6 ",
        -8.143910961535568
      ],
      [
        "пэж",
        -8.144045142982321
      ],
      [
        "дунейпсо ",
        -8.144159150501524
      ],
      [
        "иужькӀэ ",
        -8.145466656311276
      ],
      [
        "нымкӀэ ",
        -8.145721674898487
      ],
      [
        "къбр м ",
        -8.147142584214166
      ],
      [
        "лъэпкъ",
        -8.151981226961478
      ],
      [
        "бгы",
        -8.154218401637747
      ],
      [
        "2",
        -8.154777167899312
      ],
      [
        "бий ",
        -8.156880835122687
      ],
      [
        "4",
        -8.157091016721054
      ],
      [
        "ращ ",
        -8.157408169902409
      ],
      [
        " гуэр ",
        -8.157544035491123
      ],
      [
        "псоми ",
        -8.157603537337623
      ],
      [
        "дэт ",
        -8.15856363501665
      ],
      [
        "емы",
        -8.159258581512148
      ],
      [
        "ȫ",
        -8.15944323322455
      ],
      [
        "плъ",
        -8.164489385091645
      ],
      [
        "ам ",
        -8.167099325353362
      ],
      [
        "къуажэ",
        -8.17005629875344
      ],
      [
        "жьа",
        -8.170864597279394
      ],
      [
        "ху ",
        -8.171091958003151
      ],
      [
        "ф ",
        -8.17212322408466
      ],
      [
        "къалэм ",
        -8.17257246997337
      ],
      [
        "къигъэ",
        -8.173103999975092
      ],
      [
        "къалэ",
        -8.174020819356056
      ],
      [
        "фе",
        -8.174784073517714
      ],
      [
        "гъэр ",
        -8.175407926661535
      ],
      [
        "щӀэныгъэ",
        -8.176182047139596
      ],
      [
        "ме",
        -8.177055042869942
      ],
      [
        "къра",
        -8.180541518682235
      ],
      [
        "з ",
        -8.18380260429382
      ],
      [
        "псом ",
        -8.189118193677702
      ],
      [
        "хъу ",
        -8.189674777182441
      ],
      [
        "лъытэ",
        -8.189847229996332
      ],
      [
        "хэр",
        -8.190948313176502
      ],
      [
        "зэре",
        -8.191825114660224
      ],
      [
        "дауэ ",
        -8.194756032083426
      ],
      [
        "ыу ",
        -8.199344801649383
      ],
      [
        "ï",
        -8.200056691567799
      ],
      [
        "3 ",
        -8.202676561266422
      ],
      [
        "хэ ",
        -8.204502884832868
      ],
      [
        "хъ",
        -8.204847297192462
      ],
      [
        "итӀ",
        -8.205305243977536
      ],
      [
        "га",
        -8.208585237822554
      ],
      [
        "кӀуа",
        -8.209716631516828
      ],
      [
        "ыным ",
        -8.210857388533542
      ],
      [
        "ки",
        -8.211217614001539
      ],
      [
        "арат ",
        -8.213111655319796
      ],
      [
        "гуащэ",
        -8.21320988647673
      ],
      [
        "илъ",
        -8.213667862711512
      ],
      [
        "гъащӀэ",
        -8.214300638142284
      ],
      [
        "дз",
        -8.214923855126768
      ],
      [
        "ымкӀэ ",
        -8.216568675995196
      ],
      [
        "че",
        -8.217602471856708
      ],
      [
        "къыщи",
        -8.218494467743579
      ],
      [
        "къбр м и ",
        -8.219476477538672
      ],
      [
        "а нэужь ",
        -8.22178257879229
      ],
      [
        "гуры",
        -8.222801170892279
      ],
      [
        "рэ ирокъу ",
        -8.22569340992789
      ],
      [
        "кӀо",
        -8.226258121581479
      ],
      [
        "яӀэ",
        -8.227744605891925
      ],
      [
        "шу",
        -8.230468695793514
      ],
      [
        "езым ",
        -8.231371863954925
      ],
      [
        "м хуэдэу ",
        -8.232146655425906
      ],
      [
        "р къы",
        -8.232235249591477
      ],
      [
        "кӀыж",
        -8.23910304808657
      ],
      [
        "къ ",
        -8.23974095899064
      ],
      [
        "ыр",
        -8.240626411953215
      ],
      [
        "пӀэм ",
        -8.2428678768016
      ],
      [
        "къызы",
        -8.247339390224212
      ],
      [
        "що",
        -8.248782407026395
      ],
      [
        "фӀэкӀа ",
        -8.249517247200151
      ],
      [
        "ӀэнатӀэ",
        -8.250338180195195
      ],
      [
        "тӀу",
        -8.252950187413749
      ],
      [
        "жиӀэу ",
        -8.253334192052646
      ],
      [
        "ъ",
        -8.255852720462071
      ],
      [
        "ò",
        -8.255983823798905
      ],
      [
        "закъуэ",
        -8.25605647500588
      ],
      [
        "упщӀ",
        -8.2560905780251
      ],
      [
        "хъуащ ",
        -8.259833067696166
      ],
      [
        "Ӏэ ",
        -8.260095282351326
      ],
      [
        "3",
        -8.261684182505006
      ],
      [
        "м я ",
        -8.262919768743414
      ],
      [
        "плъы",
        -8.26473178162419
      ],
      [
        "хыхьэ",
        -8.267057619978653
      ],
      [
        "пэ ",
        -8.269218795441372
      ],
      [
        "ве",
        -8.27246474606399
      ],
      [
        "рти ",
        -8.273760673936938
      ],
      [
        "ым",
        -8.274847743231488
      ],
      [
        "эр ",
        -8.27520649763627
      ],
      [
        "лъэӀу",
        -8.275579050226506
      ],
      [
        "жьым ",
        -8.276137910694777
      ],
      [
        "жыпӀэ",
        -8.276195715014788
      ],
      [
        "ȡ",
        -8.277556208117149
      ],
      [
        "30 ",
        -8.278240161137935
      ],
      [
        "лъагъуэ",
        -8.28413388749137
      ],
      [
        "у щыт",
        -8.284208747805133
      ],
      [
        "куэдрэ ",
        -8.284817751161862
      ],
      [
        "къэрал",
        -8.284888126062464
      ],
      [
        "5 ",
        -8.287468233044688
      ],
      [
        "уи",
        -8.287617800944313
      ],
      [
        "û",
        -8.291119456326934
      ],
      [
        "зыгуэр ",
        -8.291898757719258
      ],
      [
        "дэкӀ",
        -8.292565016335118
      ],
      [
        "тӀы",
        -8.293330467343603
      ],
      [
        "цы",
        -8.293516563502427
      ],
      [
        "уд",
        -8.295641807415565
      ],
      [
        "гъуэгу ",
        -8.296931259204994
      ],
      [
        "лэ ",
        -8.298652594324468
      ],
      [
        "щыщ ",
        -8.298706244154523
      ],
      [
        "п ",
        -8.299752420034016
      ],
      [
        "ɩ",
        -8.300624039296858
      ],
      [
        "лъагэ",
        -8.302310013188253
      ],
      [
        "хъыбар",
        -8.30345986718669
      ],
      [
        "гупсысэ",
        -8.305043860325423
      ],
      [
        "жиӀэри ",
        -8.307868432336742
      ],
      [
        "о ",
        -8.308421826726216
      ],
      [
        "ием ",
        -8.309592540847799
      ],
      [
        "гуапэ",
        -8.310704364725218
      ],
      [
        "хуэдэ ",
        -8.313933646543454
      ],
      [
        "ор",
        -8.314304803495565
      ],
      [
        "сэри ",
        -8.314977941827742
      ],
      [
        "щтэ",
        -8.315109011213769
      ],
      [
        "хуэмы",
        -8.31534564395231
      ],
      [
        "ì ",
        -8.317821371236542
      ],
      [
        "ари ",
        -8.322464478737928
      ],
      [
        "ñ",
        -8.323814691424378
      ],
      [
        "хьа ",
        -8.32505697039324
      ],
      [
        "зыхуэ",
        -8.326513935133272
      ],
      [
        "республикэм ",
        -8.328991933711483
      ],
      [
        "тхьэм ",
        -8.32928250130637
      ],
      [
        "хьэж",
        -8.329534969205874
      ],
      [
        "кӀуащ ",
        -8.32957047311946
      ],
      [
        "нукъым ",
        -8.331664795866997
      ],
      [
        "хьэзыр",
        -8.332056147203522
      ],
      [
        "гъэщӀэгъуэн",
        -8.33347169428462
      ],
      [
        "ɢ",
        -8.335088932357031
      ],
      [
        "нэхъыжь",
        -8.335701289841522
      ],
      [
        "щӀыхь",
        -8.336384077702503
      ],
      [
        "ин ",
        -8.336797155270814
      ],
      [
        "унэ ",
        -8.33952844846868
      ],
      [
        " дыдэу ",
        -8.341335824427555
      ],
      [
        "иӀэ",
        -8.341696606854168
      ],
      [
        "ь",
        -8.342202793621299
      ],
      [
        "зауэм ",
        -8.34607191131584
      ],
