{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 1,
      "content": "[PAD]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "[UNK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "[CLS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 4,
      "content": "[SEP]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 5,
      "content": "[MASK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 6,
      "content": "жь",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 7,
      "content": "ку",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 8,
      "content": "кӀ",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 9,
      "content": "кIу",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 10,
      "content": "къ",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 11,
      "content": "къу",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 12,
      "content": "кхъ",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 13,
      "content": "кхъу",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 14,
      "content": "лъ",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 15,
      "content": "лI",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 16,
      "content": "пI",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 17,
      "content": "тI",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 18,
      "content": "фI",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 19,
      "content": "ху",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 20,
      "content": "хь",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 21,
      "content": "хъ",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 22,
      "content": "хъу",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 23,
      "content": "цI",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 24,
      "content": "щI",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 25,
      "content": "Ӏу",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 26,
      "content": "хуэ",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 27,
      "content": "во",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 28,
      "content": "рэ",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 29,
      "content": "зэ",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 30,
      "content": "де",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 31,
      "content": "зо",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 32,
      "content": "ар",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 33,
      "content": "ди",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 34,
      "content": "ремы",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 35,
      "content": "эрэ",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 36,
      "content": "дэ",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 37,
      "content": "ры",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 38,
      "content": "эж",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 39,
      "content": "ри",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 40,
      "content": "ыж",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 41,
      "content": "фы",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 42,
      "content": "мы",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 43,
      "content": "ау",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 44,
      "content": "щы",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 45,
      "content": "къым",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 46,
      "content": "хуа",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 47,
      "content": "эм",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 48,
      "content": "ат",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 49,
      "content": "хэ",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 50,
      "content": "нщ",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 51,
      "content": "зы",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 52,
      "content": "жы",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 53,
      "content": "тэ",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 54,
      "content": "ро",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 55,
      "content": "ды",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 56,
      "content": "хы",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 57,
      "content": "къэ",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 58,
      "content": "рызы",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 59,
      "content": "ащ",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 60,
      "content": "ре",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 61,
      "content": "да",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 62,
      "content": "до",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 63,
      "content": "ам",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 64,
      "content": "гъэ",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 65,
      "content": "вэ",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 66,
      "content": "ми",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 67,
      "content": "къы",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 68,
      "content": "ын",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 69,
      "content": "ха",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 70,
      "content": "эн",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 71,
      "content": "фӀэ",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 72,
      "content": "ущ",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 73,
      "content": "ра",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    }
  ],
  "normalizer": null,
  "pre_tokenizer": null,
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "Unigram",
    "unk_id": 0,
    "vocab": [
      [
        "UNK",
        0.0
      ],
      [
        "[PAD]",
        0.0
      ],
      [
        "[UNK]",
        0.0
      ],
      [
        "[CLS]",
        0.0
      ],
      [
        "[SEP]",
        0.0
      ],
      [
        "[MASK]",
        0.0
      ],
      [
        "\n",
        -2.979638839021348
      ],
      [
        ".",
        -3.6665892829831623
      ],
      [
        " ",
        -3.9293740660303644
      ],
      [
        ",",
        -4.279873280969866
      ],
      [
        "у",
        -4.66571034991064
      ],
      [
        "р",
        -4.687535632099106
      ],
      [
        "м",
        -4.7749234507939455
      ],
      [
        "и",
        -5.061169292890119
      ],
      [
        " и",
        -5.198983855474927
      ],
      [
        "рэ",
        -5.336393381204177
      ],
      [
        "щ.",
        -5.3730242221711695
      ],
      [
        "хэр",
        -5.376903942213289
      ],
      [
        ", ",
        -5.436021979540866
      ],
      [
        "а",
        -5.493137081957265
      ],
      [
        "кIэ",
        -5.495475991541644
      ],
      [
        "хэм",
        -5.526877033746933
      ],
      [
        "щ",
        -5.555188406994656
      ],
      [
        "т",
        -5.662557232603088
      ],
      [
        "-",
        -5.696759817571111
      ],
      [
        "ыр",
        -5.751119932796115
      ],
      [
        "ри",
        -5.777042493221172
      ],
      [
        "ым",
        -5.783504635092326
      ],
      [
        " я",
        -6.005396623090805
      ],
      [
        " зы",
        -6.212189148901752
      ],
      [
        "хэм я",
        -6.243392796502256
      ],
      [
        "»",
        -6.260707511612399
      ],
      [
        " «",
        -6.352758209609014
      ],
      [
        "уэ",
        -6.3973374653097785
      ],
      [
        "м и",
        -6.408747015832947
      ],
      [
        "н",
        -6.445734642225441
      ],
      [
        "ащ.",
        -6.447489369429446
      ],
      [
        "Абы",
        -6.516861219736816
      ],
      [
        "ри,",
        -6.520031996496288
      ],
      [
        "ми",
        -6.533701446664658
      ],
      [
        "Ар",
        -6.53502023241389
      ],
      [
        "т.",
        -6.539473083624511
      ],
      [
        "А",
        -6.583173442790244
      ],
      [
        " абы",
        -6.58586412222
      ],
      [
        "э",
        -6.589049882779346
      ],
      [
        "е",
        -6.6199399425122785
      ],
      [
        "с",
        -6.641893134874323
      ],
      [
        " -",
        -6.642364657627166
      ],
      [
        "ы",
        -6.666797487694085
      ],
      [
        " (",
        -6.687789712671263
      ],
      [
        "р.",
        -6.687821405725073
      ],
      [
        "щ,",
        -6.688596842132647
      ],
      [
        "- ",
        -6.741718451441978
      ],
      [
        " ар",
        -6.753345245488578
      ],
      [
        "Къэбэрдей-Балъкъ",
        -6.756823832962931
      ],
      [
        " зэры",
        -6.75868556137992
      ],
      [
        "хэмрэ",
        -6.7855764441910935
      ],
      [
        "мэ,",
        -6.809424251845533
      ],
      [
        "«",
        -6.809527572692069
      ],
      [
        "ащ",
        -6.823293656870183
      ],
      [
        "м ",
        -6.84326396822523
      ],
      [
        ")",
        -6.849344820590945
      ],
      [
        " ди",
        -6.856863320799498
      ],
      [
        "мрэ",
        -6.8822948925703855
      ],
      [
        "у,",
        -6.8976626083161
      ],
      [
        "И",
        -6.89785491064567
      ],
      [
        " а",
        -6.9028807743359035
      ],
      [
        " щы",
        -6.909012065553046
      ],
      [
        "!",
        -6.916869518166438
      ],
      [
        " с",
        -6.937975457034538
      ],
      [
        " къы",
        -6.948453854895828
      ],
      [
        "р ",
        -6.969611802398881
      ],
      [
        "я",
        -6.9745413014584114
      ],
      [
        "ар",
        -6.985957868617596
      ],
      [
        "?",
        -7.001269979815604
      ],
      [
        " - ",
        -7.012130750287499
      ],
      [
        "ж",
        -7.0232929688411545
      ],
      [
        " куэд",
        -7.039665020668101
      ],
      [
        " икIи",
        -7.042981061425139
      ],
      [
        "щIэ",
        -7.0810344482620105
      ],
      [
        "ыну",
        -7.102400935517418
      ],
      [
        "д",
        -7.1037360609512605
      ],
      [
        "ну",
        -7.111459832748802
      ],
      [
        " нэхъ",
        -7.131139829820888
      ],
      [
        ":",
        -7.142438077708993
      ],
      [
        " цIыху",
        -7.143582573166878
      ],
      [
        " е",
        -7.1437362059030365
      ],
      [
        " у",
        -7.168455052287663
      ],
      [
        "хэ",
        -7.168792841183486
      ],
      [
        " сы",
        -7.169739902083447
      ],
      [
        "о",
        -7.1713451691871954
      ],
      [
        " и ",
        -7.199434163818158
      ],
      [
        "ым и",
        -7.204439143132338
      ],
      [
        "нэ",
        -7.2099041947576525
      ],
      [
        "х",
        -7.216173120620174
      ],
      [
        " адыгэ",
        -7.224545917201164
      ],
      [
        " си",
        -7.227264936987685
      ],
      [
        " мы",
        -7.239073383871055
      ],
      [
        "♦",
        -7.2474215942104365
      ],
      [
        "ф",
        -7.2510107105270825
      ],
      [
        "ху",
        -7.2564364606745
      ],
      [
        "мэ",
        -7.274886187699016
      ],
      [
        "ми,",
        -7.282141271009131
      ],
      [
        "м,",
        -7.287628488823382
      ],
      [
        " зэ",
        -7.298370398511464
      ],
      [
        " п",
        -7.304211792403642
      ],
      [
        "з",
        -7.359856109913128
      ],
      [
        "1",
        -7.360651714911591
      ],
      [
        "п",
        -7.371265626240894
      ],
      [
        " лъэпкъ",
        -7.374605787810738
      ],
      [
        "у ",
        -7.3765576359302525
      ],
      [
        "в",
        -7.380479300991322
      ],
      [
        "ш",
        -7.382394759058751
      ],
      [
        " ды",
        -7.397259983957326
      ],
      [
        "ауэ",
        -7.399310925602424
      ],
      [
        "м.",
        -7.404500929850998
      ],
      [
        "у.",
        -7.405816320715323
      ],
      [
        " къэрал",
        -7.407334456457911
      ],
      [
        " в",
        -7.4167903593440565
      ],
      [
        "къым.",
        -7.418883244147074
      ],
      [
        "Ауэ",
        -7.426128825939601
      ],
      [
        "ын",
        -7.436185328400728
      ],
      [
        "мы",
        -7.438836897632096
      ],
      [
        " щыIэ",
        -7.456679589850886
      ],
      [
        "».",
        -7.464432746949925
      ],
      [
        " зи",
        -7.47309821099829
      ],
      [
        "л",
        -7.478637212333658
      ],
      [
        "2",
        -7.479411927524957
      ],
      [
        "к",
        -7.490067160115145
      ],
      [
        "гъэ",
        -7.497802603667339
      ],
      [
        "хэр,",
        -7.499560530053583
      ],
      [
        " къа",
        -7.504119467362089
      ],
      [
        "б",
        -7.506431381601785
      ],
      [
        "дэ",
        -7.51208058023563
      ],
      [
        " щIэныгъэ",
        -7.5163850738398725
      ],
      [
        "кIи",
        -7.521667874416209
      ],
      [
        " –",
        -7.535829961748962
      ],
      [
        "рэ ",
        -7.544413595474626
      ],
      [
        "мкIэ",
        -7.552172090220786
      ],
      [
        "т,",
        -7.561503878326554
      ],
      [
        "», «",
        -7.562318180434269
      ],
      [
        "и,",
        -7.565943246519012
      ],
      [
        "гу",
        -7.568459212045099
      ],
      [
        ", абы",
        -7.569734030113975
      ],
      [
        "Жылагъуэ",
        -7.574434136498926
      ],
      [
        " Iуэху",
        -7.579333516538269
      ],
      [
        "рт.",
        -7.582339899219996
      ],
      [
        "зы",
        -7.613295494583378
      ],
      [
        " апхуэдэ",
        -7.614959464132861
      ],
      [
        "урэ",
        -7.627186189658949
      ],
      [
        "р,",
        -7.630370461816116
      ],
      [
        "хэри",
        -7.632891667667505
      ],
      [
        "У",
        -7.642580016805399
      ],
      [
        " псори",
        -7.642690519792571
      ],
      [
        "Урысей Федерацэм",
        -7.646370009418935
      ],
      [
        "хэр.",
        -7.654405635500177
      ],
      [
        "С",
        -7.6569966859899505
      ],
      [
        "у щыта",
        -7.665266430089045
      ],
      [
        "къым",
        -7.672448945168014
      ],
      [
        " уи",
        -7.677645383858845
      ],
      [
        " къыщы",
        -7.684522646164288
      ],
      [
        "Ди",
        -7.685760053198778
      ],
      [
        " Къэбэрдей",
        -7.695343561427621
      ],
      [
        "ей",
        -7.703608522327721
      ],
      [
        "Апхуэдэ",
        -7.716968038343716
      ],
      [
        "ти,",
        -7.724895533270767
      ],
      [
        "Iэ",
        -7.725324546686456
      ],
      [
        "шхуэ",
        -7.725966009338427
      ],
      [
        "… ",
        -7.73731370875154
      ],
      [
        "хэр ",
        -7.737876987757902
      ],
      [
        "хэм,",
        -7.7386308156640915
      ],
      [
        "хэм ",
        -7.743902556201318
      ],
      [
        " къи",
        -7.744342928279787
      ],
      [
        " хэт",
        -7.758048916379056
      ],
      [
        "ат",
        -7.760074562724053
      ],
      [
        "П",
        -7.772993652889721
      ],
      [
        " сэ",
        -7.784091615166262
      ],
      [
        "эр Республикэм ",
        -7.787386186352431
      ],
      [
        "ымрэ",
        -7.791804784416433
      ],
      [
        "ов",
        -7.792649622377924
      ],
      [
        "кIэ,",
        -7.79462352834532
      ],
      [
        "ыр.",
        -7.811498728779199
      ],
      [
        "хуэ",
        -7.81165660572912
      ],
      [
        "рт",
        -7.8159220914612835
      ],
      [
        "хэу",
        -7.823813552777094
      ],
      [
        " дэ",
        -7.825054778694158
      ],
      [
        "на",
        -7.827156102027659
      ],
      [
        "й",
        -7.828908483319282
      ],
      [
        "Зы",
        -7.832117598903901
      ],
      [
        " гуэр",
        -7.834177001427954
      ],
      [
        ", ауэ",
        -7.835476245051432
      ],
      [
        "жь",
        -7.844143709771047
      ],
      [
        ": ",
        -7.845770814791301
      ],
      [
        " япэ",
        -7.846596514042873
      ],
      [
        " щыщ",
        -7.84941166883591
      ],
      [
        "зэ",
        -7.850150442494382
      ],
      [
        "хэми",
        -7.862865405861815
      ],
      [
        "Е",
        -7.866072826069188
      ],
      [
        " къызэры",
        -7.8667541047485905
      ],
      [
        " щIы",
        -7.867527734217525
      ],
      [
        ": «",
        -7.873861551854276
      ],
      [
        "и ",
        -7.877726973981122
      ],
      [
        "ыж",
        -7.878939167804635
      ],
      [
        "ь",
        -7.886609040781284
      ],
      [
        "Я",
        -7.887618150711613
      ],
      [
        "ым ",
        -7.890133821045757
      ],
      [
        ", «",
        -7.8931616122538095
      ],
      [
        "хэмкIэ",
        -7.895638752647114
      ],
      [
        "ырт.",
        -7.9002653208588836
      ],
      [
        "хьэ",
        -7.908096604706914
      ],
      [
        "К",
        -7.914135615587802
      ],
      [
        ", ар",
        -7.914471542180086
      ],
      [
        " по",
        -7.924601237692834
      ],
      [
        " зэра",
        -7.929903964062408
      ],
      [
        "ю",
        -7.931385593861853
      ],
      [
        "ди",
        -7.93250815800621
      ],
      [
        "ащ,",
        -7.936020418445306
      ],
      [
        "В",
        -7.948437550204144
      ],
      [
        "кIэ ",
        -7.964115419905766
      ],
      [
        "гъу",
        -7.965876574895961
      ],
      [
        " ахэр",
        -7.967013644164764
      ],
      [
        "ий",
        -7.972374783868419
      ],
      [
        "шэ",
        -7.986551600965122
      ],
      [
        " за",
        -7.987315816922024
      ],
      [
        " илъэс",
        -7.988235496831064
      ],
      [
        " и унафэщI",
        -7.990947981941332
      ],
      [
        "щI",
        -7.998008074961937
      ],
      [
        " на",
        -8.00153065636547
      ],
      [
        "Сэ",
        -8.003903336787362
      ],
      [
        " къе",
        -8.01294235201247
      ],
      [
        "хь",
        -8.017572545933035
      ],
      [
        "Мы",
        -8.03132639574561
      ],
      [
        "къалъхуащ",
        -8.037629784315609
      ],
      [
        "сэ",
        -8.03798168289019
      ],
      [
        " дахэ",
        -8.038317328072965
      ],
      [
        " цIэрыIуэ",
        -8.04106680672626
      ],
      [
        "Ахэр",
        -8.04437208669664
      ],
      [
        " псы",
        -8.044699514651322
      ],
      [
        "гъуэ",
        -8.045045917234543
      ],
      [
        "ч",
        -8.045851598870714
      ],
      [
        "щи,",
        -8.053746910558198
      ],
      [
        " хабзэ",
        -8.054657980900396
      ],
      [
        " къалэм",
        -8.054762603696373
      ],
      [
        "Си",
        -8.058834490042065
      ],
      [
        "та",
        -8.060133390515482
      ],
      [
        "хэм.",
        -8.060423414434773
      ],
      [
        ", я",
        -8.061757259535682
      ],
      [
        " ща",
        -8.065207548659558
      ],
      [
        " нэгъуэщI",
        -8.07263694722846
      ],
      [
        "Iу",
        -8.07375238396839
      ],
      [
        ", и",
        -8.075299086216742
      ],
      [
        "у, ",
        -8.076921080663809
      ],
      [
        "ри.",
        -8.080200951285226
      ],
      [
        "ыр ",
        -8.088182283831072
      ],
      [
        "Т",
        -8.089624761807881
      ],
      [
        "ха",
        -8.08996931165036
      ],
      [
        " гъуэгу",
        -8.091271978137156
      ],
      [
        "пэ",
        -8.093988916484168
      ],
      [
        " къэс",
        -8.095037884900211
      ],
      [
        " цIыкIу",
        -8.10077159228712
      ],
      [
        "къэ",
        -8.105915656280564
      ],
      [
        " къэ",
        -8.115538575454483
      ],
      [
        " нэхъыщхьэ",
        -8.115697220090496
      ],
      [
        "Б",
        -8.12006897640172
      ],
      [
        " лэжьыгъэ",
        -8.123097596550874
      ],
      [
        " хъуа",
        -8.124077279883828
      ],
      [
        " псоми",
        -8.133656311755573
      ],
      [
        " абы и",
        -8.142538907085791
      ],
      [
        " цIыхухэм",
        -8.146820376655072
      ],
      [
        "и Правительствэм",
        -8.152958173667518
      ],
      [
        "рэ я",
        -8.155015986646815
      ],
      [
        "ев",
        -8.155300395263513
      ],
      [
        " Налшык",
        -8.157151549250823
      ],
      [
        " абыхэм",
        -8.157423969504707
      ],
      [
        "ом",
        -8.157877429549696
      ],
      [
        "м, ",
        -8.160121486532834
      ],
      [
        "Апхуэдэу",
        -8.165311428095226
      ],
      [
        " псалъэ",
        -8.166039775538774
      ],
      [
        " к",
        -8.167263604516936
      ],
      [
        "къуэ",
        -8.16809557677785
      ],
      [
        " д",
        -8.168975079898036
      ],
      [
        " А",
        -8.169280069429579
      ],
      [
        " зэмылIэужьыгъуэ",
        -8.169696321568203
      ],
      [
        "эр",
        -8.170942495074376
      ],
      [
        " зиIэ",
        -8.171551738324684
      ],
      [
        "ли",
        -8.174137421155162
      ],
      [
        "фI",
        -8.183239885214014
      ],
      [
        "ым,",
        -8.184436910495348
      ],
      [
        "да",
        -8.185707958593177
      ],
      [
        "цIыху",
        -8.187005115795396
      ],
      [
        "но",
        -8.189309865282812
      ],
      [
        "ам",
        -8.191996470155544
      ],
      [
        "хъу",
        -8.192029542090763
      ],
      [
        "I",
        -8.192277050916855
      ],
      [
        " фIэкIа",
        -8.195666110694932
      ],
      [
        "ие",
        -8.197719008896357
      ],
      [
        "Абы и",
        -8.19851244337844
      ],
      [
        " щыпсэу",
        -8.199584643529537
      ],
      [
        "лъ",
        -8.202020861244801
      ],
      [
        " щызэ",
        -8.204613383674365
      ],
      [
        " Iэмал",
        -8.206492067896082
      ],
      [
        " щхьэ",
        -8.207466191311047
      ],
      [
        "ным",
        -8.211148375651238
      ],
      [
        "щIа",
        -8.212306894663964
      ],
      [
        "Д",
        -8.21310984373077
      ],
      [
        " дэт",
        -8.213695355952837
      ],
      [
        "ыу",
        -8.217993926384999
      ],
      [
        "Спорт",
        -8.218219666653578
      ],
      [
        "ыным",
        -8.224787758822968
      ],
      [
        " С",
        -8.226532365547154
      ],
      [
        " куэдым",
        -8.22674756085887
      ],
      [
        "щ, ",
        -8.23017000981634
      ],
      [
        "акъым.",
        -8.230716284294221
      ],
      [
        " дыдэ",
        -8.231460225214093
      ],
      [
        " ин",
        -8.234303095317536
      ],
      [
        " тхылъ",
        -8.23858379767291
      ],
      [
        " дунейпсо",
        -8.23916063092108
      ],
      [
        "Махуэгъэпс",
        -8.240181511029093
      ],
      [
        ").",
        -8.244037563972714
      ],
      [
        "м и ",
        -8.24784331073641
      ],
      [
        "ку",
        -8.260513466944701
      ],
      [
        "АрщхьэкIэ",
        -8.263620735364723
      ],
      [
        "лэ",
        -8.263990727451763
      ],
      [
        " зыбжанэ",
        -8.264906401379603
      ],
      [
        " хъуащ.",
        -8.266018505968159
      ],
      [
        " цIыхухэр",
        -8.269577823029117
      ],
      [
        " унафэ",
        -8.270849173506097
      ],
      [
        " щIыпIэ",
        -8.27302123984444
      ],
      [
        " ири",
        -8.274779122336533
      ],
      [
        "ой",
        -8.275848982805584
      ],
      [
        "Абыхэм",
        -8.277361549265658
      ],
      [
        "щэ",
        -8.279249065211676
      ],
      [
        " япэу",
        -8.283991114313821
      ],
      [
        "ра",
        -8.284951292022189
      ],
      [
        " не",
        -8.285083124200721
      ],
      [
        "итI",
        -8.288601867435428
      ],
      [
        "ырт",
        -8.289541784608986
      ],
      [
        "рэ.",
        -8.290717990152386
      ],
      [
        " Iэ",
        -8.29144124136894
      ],
      [
        "бэ",
        -8.293005980982894
      ],
      [
        "Илъэс",
        -8.293354491377023
      ],
      [
        " иджыри",
        -8.29348387782369
      ],
      [
        " зэри",
        -8.293810842251649
      ],
      [
        "М",
        -8.29407855830701
      ],
      [
        " махуэ",
        -8.297688566413346
      ],
      [
        " къуажэ",
        -8.298945575798676
      ],
      [
        " щIыналъэ",
        -8.301041869260711
      ],
      [
        " гу",
        -8.301884553481855
      ],
      [
        "ым.",
        -8.305910583632048
      ],
      [
        " со",
        -8.309077121835562
      ],
      [
        "ц",
        -8.31034873738228
      ],
      [
        " зэи",
        -8.311620830187943
      ],
      [
        " гугъу",
        -8.325905652504023
      ],
      [
        "их",
        -8.327894493319986
      ],
      [
        " щхьэкIэ",
        -8.332469555104801
      ],
      [
        " з",
        -8.333065991531216
      ],
      [
        "Щэнхабзэ",
        -8.33403130159204
      ],
      [
        "Адыгэ",
        -8.335393002202789
      ],
      [
        " зэхьэзэхуэм",
        -8.3379473831899
      ],
      [
        "…",
        -8.33797855232751
      ],
      [
        ", а",
        -8.338952178253518
      ],
      [
        "ат.",
        -8.341695632459487
      ],
      [
        " хуэдэу",
        -8.34318778115722
      ],
      [
        " куэдрэ",
        -8.345521879151761
      ],
      [
        ", нэгъуэщI",
        -8.348199143652515
      ],
      [
        " гуп",
        -8.348374016850594
      ],
      [
        " Iуэхур",
        -8.348808186955116
      ],
      [
        "до",
        -8.349098268484578
      ],
      [
        " деж",
        -8.351487572064443
      ],
      [
        " зэман",
        -8.352244577433176
      ],
      [
        "ре",
        -8.354079159025243
      ],
      [
        "м деж",
        -8.354333461473889
      ],
      [
        " щIыналъэм",
        -8.354497608921715
      ],
      [
        "Зэ",
        -8.356546024396845
      ],
      [
        " къызэ",
        -8.35851400417548
      ],
      [
        "хэм ящыщщ",
        -8.359527927692836
      ],
      [
        " къэралым",
        -8.36094491143697
      ],
      [
        "ни",
        -8.362237612996442
      ],
      [
        "ша",
        -8.365379009758588
      ],
      [
        " нобэ",
        -8.366824164788834
      ],
      [
        " къуажэм",
        -8.368571988130249
      ],
      [
        "3",
        -8.369186426865998
      ],
      [
        " щIалэ",
        -8.372904094589906
      ],
      [
        "4",
        -8.378227194854091
      ],
      [
        " щи",
        -8.381888611527494
      ],
      [
        "Ф",
        -8.386078215505687
      ],
      [
        " т",
        -8.386271299387545
      ],
      [
        "рт,",
        -8.386561755325006
      ],
      [
        " иужькIэ",
        -8.386825356861163
      ],
      [
        " иджы",
        -8.387242358665972
      ],
      [
        " щIэ",
        -8.38881875882222
      ],
      [
        " хъу",
        -8.389702927612792
      ],
      [
        " сабий",
        -8.391782370347848
      ],
      [
        "росмотров",
        -8.395421262494441
      ],
      [
        " К",
        -8.397914700768489
      ],
      [
        " те",
        -8.40162212774274
      ],
      [
        "са",
        -8.4046501442789
      ],
      [
        " дунейм",
        -8.404829135693475
      ],
      [
        " нэс",
        -8.405320771523446
      ],
      [
        " фIыуэ",
        -8.405840294604975
      ],
      [
        "р зы",
        -8.406114919049248
      ],
      [
        "щ ",
        -8.406235197956962
      ],
      [
        "дж",
        -8.4107958256402
      ],
      [
        " И",
        -8.41158393503487
      ],
      [
        " щекIуэкIа",
        -8.413129678678397
      ],
      [
        " гъащIэм",
        -8.413381904927746
      ],
      [
        "Иджы",
        -8.415008431654137
      ],
      [
        " нэхъыбэ",
        -8.41546172399315
      ],
      [
        "акъым",
        -8.416192547872237
      ],
      [
        " гъэщIэгъуэн",
        -8.41732925008451
      ],
      [
        "хэм ящыщу",
        -8.418851545130236
      ],
      [
        "ныр",
        -8.420784546558156
      ],
      [
        " хъыбар",
        -8.430075117499335
      ],
      [
        " Мухьэмэд",
        -8.43011106102911
      ],
      [
        "ла",
        -8.430245885028361
      ],
      [
        "ымкIэ",
        -8.430520743950897
      ],
      [
        "пIэ",
        -8.4318538644551
      ],
      [
        " да",
        -8.43662657831586
      ],
      [
        "г",
        -8.436981230223981
      ],
      [
        "р?",
        -8.437570081684877
      ],
      [
        ";",
        -8.440644285695123
      ],
      [
        "7",
        -8.441270196261215
      ],
      [
        " Iуэхум",
        -8.443837279759634
      ],
      [
        " къып",
        -8.447830237942
      ],
      [
        "лъэ",
        -8.450834134970755
      ],
      [
        "ды",
        -8.458143839944592
      ],
      [
        "ка",
        -8.458607203203277
      ],
      [
        " пщIэ",
        -8.460405776240757
      ],
      [
        " унэ",
        -8.460626776547894
      ],
      [
        "Зи",
        -8.461159871093116
      ],
      [
        ", -",
        -8.46253294941188
      ],
      [
        " унагъуэ",
        -8.464439263755356
      ],
      [
        "ри, ",
        -8.465898858853329
      ],
      [
        "уи",
        -8.465997941014606
      ],
      [
        " зэманым",
        -8.467294719184071
      ],
      [
        " хуэдэ",
        -8.469392707184104
      ],
      [
        "ин",
        -8.469738249765285
      ],
      [
        " хъуну",
        -8.471606897949687
      ],
      [
        "жу",
        -8.472561727798205
      ],
      [
        "кI",
        -8.478910761993568
      ],
      [
        "кIуэ",
        -8.47895903789425
      ],
      [
        " сыт",
        -8.481441694846765
      ],
      [
        "кэ",
        -8.481464846271578
      ],
      [
        "жа",
        -8.482605033825536
      ],
      [
        " шы",
        -8.482786940643233
      ],
      [
        "ем",
        -8.485498090344173
      ],
      [
        "ыныр",
        -8.485971150725167
      ],
      [
        "тэкъым",
        -8.486016555796544
      ],
      [
        " лэжьакIуэ",
        -8.486324038585153
      ],
      [
        "ар.",
        -8.48724558345818
      ],
      [
        ", ди",
        -8.489935263687142
      ],
      [
        " езы",
        -8.492564563351102
      ],
      [
        " къару",
        -8.497600138009028
      ],
      [
        " Урысейм",
        -8.498974325667959
      ],
      [
        " зэхьэзэхуэ",
        -8.501943442702142
      ],
      [
        " ехъулIэныгъэ",
        -8.503060089823638
      ],
      [
        "м я",
        -8.504319414989535
      ],
      [
        "; ",
        -8.506812358930336
      ],
      [
        "и.",
        -8.507809415194213
      ],
      [
        " зыри",
        -8.508269335017998
      ],
      [
        "жэ",
        -8.509794369609242
      ],
      [
        " зэIущIэ",
        -8.509918222472507
      ],
      [
        " хуабжьу",
        -8.51205045767686
      ],
      [
        "Сыт",
        -8.512792981117489
      ],
      [
        " «Спартак-Налшык",
        -8.514482279327101
      ],
      [
        " зэхъуэкIыныгъэ",
        -8.514680230665267
      ],
      [
        "ышхуэ",
        -8.516876495935694
      ],
      [
        "Л",
        -8.51745165032763
      ],
      [
        "Дэ",
        -8.519055516136397
      ],
      [
        "ет",
        -8.521272359987655
      ],
      [
        "-Балъкъэрым",
        -8.522245804410336
      ],
      [
        "дзэ",
        -8.522603178913556
      ],
      [
        "къым,",
        -8.522846046630397
      ],
      [
        " къалэн",
        -8.524154242922664
      ],
      [
        "ых",
        -8.52450229226488
      ],
      [
        "ры",
        -8.525267106702668
      ],
      [
        "те",
        -8.526658182784512
      ],
      [
        "къу",
        -8.530203493079071
      ],
      [
        " гупым",
        -8.53577920459689
      ],
      [
        " къалэ",
        -8.536516973118044
      ],
      [
        "эр Республикэм и",
        -8.538089692196452
      ],
      [
        "5",
        -8.54355259436058
      ],
      [
        "джэ",
        -8.547786260860544
      ],
      [
        "» ",
        -8.5492982362234
      ],
      [
        "Н",
        -8.55077300920216
      ],
      [
        " къо",
        -8.550938408855814
      ],
      [
        "Скач",
        -8.55257134514593
      ],
      [
        " къыт",
        -8.559006052227954
      ],
      [
        " из",
        -8.560110690414449
      ],
      [
        " къызэри",
        -8.56429351270938
      ],
      [
        ": - ",
        -8.56505378903207
      ],
      [
        " уэрэд",
        -8.566945860580873
      ],
      [
        "Iуэ",
        -8.567247020463572
      ],
      [
        "З",
        -8.567646328639412
      ],
      [
        "» (",
        -8.568195700421636
      ],
      [
        "фэ",
        -8.569217469197495
      ],
      [
        ", си",
        -8.570354929049374
      ],
      [
        " и къуэ",
        -8.570559843975596
      ],
      [
        "Тхыдэ",
        -8.571728838756911
      ],
      [
        " фи",
        -8.572360249407158
      ],
      [
        "хьа",
        -8.573647143694862
      ],
      [
        "Р",
        -8.574502907035578
      ],
      [
        ", зы",
        -8.57722266495981
      ],
      [
        " къыс",
        -8.579482850178087
      ],
      [
        " б",
        -8.581476699748855
      ],
      [
        " Iуэхугъуэ",
        -8.58542316258128
      ],
      [
        "19",
        -8.58559879004439
      ],
      [
        " уэ",
        -8.586610730974146
      ],
      [
        "хэт",
        -8.589324466172084
      ],
      [
        "ки",
        -8.592536700366422
      ],
      [
        "ыну.",
        -8.59366632494126
      ],
      [
        " хъуащ",
        -8.594668295580105
      ],
      [
        "за",
        -8.598635610285163
      ],
      [
        "тэкъым.",
        -8.603149951955489
      ],
      [
        " иджыблагъэ",
        -8.60544238627007
      ],
      [
        " сыт щыгъуи",
        -8.605794280410397
      ],
      [
        "ны",
        -8.605854904621117
      ],
      [
        "р, ",
        -8.609162649523595
      ],
      [
        "м хуэдэу",
        -8.611123435381149
      ],
      [
        "Уи",
        -8.615207644328969
      ],
      [
        "0",
        -8.61805460943264
      ],
      [
        "де",
        -8.618363546970869
      ],
      [
        " до",
        -8.618384448792856
      ],
      [
        "зи",
        -8.620849689703629
      ],
      [
        "къалъхуащ ",
        -8.626227944962835
      ],
      [
        "Литературэ",
        -8.626802039239152
      ],
      [
        "а нэужь",
        -8.627259992350226
      ],
      [
        " П",
        -8.627279849615082
      ],
      [
        "эн",
        -8.627496159976598
      ],
      [
        "хъ",
        -8.62827281079101
      ],
      [
        " хъуауэ",
        -8.630076433057905
      ],
      [
        " – ",
        -8.63265607274737
      ],
      [
        "лъагъу",
        -8.63332050828161
      ],
      [
        "ыф",
        -8.633640638412793
      ],
      [
        " гуэрым",
        -8.633645754649574
      ],
      [
        " от",
        -8.633694909877779
      ],
      [
        " гъэм",
        -8.635926904201906
      ],
      [
        " и «",
        -8.636719694384052
      ],
      [
        " лъандэрэ",
        -8.636899237528514
      ],
      [
        " зыгуэр",
        -8.636959831650806
      ],
      [
        ", ахэр",
        -8.63947479454379
      ],
      [
        " зэфIэкI",
        -8.640054817091507
      ],
      [
        " тхыгъэ",
        -8.6426150786579
      ],
      [
        " щекIуэкI",
        -8.644317256462443
      ],
      [
        " де",
        -8.644900956323845
      ],
      [
        " ис",
        -8.645428537789172
      ],
      [
        "окъуэ",
        -8.649234351779144
      ],
      [
        "-м",
        -8.655867475972924
      ],
      [
        "у щытащ",
        -8.656316724070711
      ],
      [
        "Г",
        -8.65727387077576
      ],
      [
        "къ",
        -8.657919862791688
      ],
      [
        " усакIуэ",
        -8.65812428594644
      ],
      [
        "Къы",
        -8.658972019104203
      ],
      [
        "хэм ящыщ",
        -8.659236782404262
      ],
      [
        " лъэпкъым",
        -8.660227228312891
      ],
      [
        " зэре",
        -8.66269744789938
      ],
      [
        "уэ щытащ",
        -8.663401048755762
      ],
      [
        "щы",
        -8.667921248233508
      ],
      [
        " унэм",
        -8.668048061156377
      ],
      [
        " ху",
        -8.668381359125043
      ],
      [
        " жылагъуэ",
        -8.668648856995738
      ],
      [
        "хуа",
        -8.66877105430352
      ],
      [
        " щIалэм",
        -8.6697647151501
      ],
      [
        " бзэ",
        -8.671326441690937
      ],
      [
        " къра",
        -8.673601504924655
      ],
      [
        " щыIа",
        -8.674870703799197
      ],
      [
        "),",
        -8.675586201584345
      ],
      [
        "ко",
        -8.677365620972747
      ],
      [
        " закъуэ",
        -8.678685556137566
      ],
      [
        " гъэ",
        -8.679130933588608
      ],
      [
        " цIыхум",
        -8.680266261333552
      ],
      [
        "пс",
        -8.685935164627699
      ],
      [
        "гъуэт",
        -8.686132643155315
      ],
      [
        "рей",
        -8.686900965039115
      ],
      [
        " къэралым и",
        -8.689504036184537
      ],
      [
        " г",
        -8.690966583801938
      ],
      [
        "Хьэ",
        -8.691004741681802
      ],
      [
        " езым",
        -8.69309110280982
      ],
      [
        " федеральнэ",
        -8.69486428802157
      ],
      [
        "гъащIэ",
        -8.695281402248927
      ],
      [
        "ах",
        -8.695415321117189
      ],
      [
        "Сы",
        -8.698835270470454
      ],
      [
        "анэ",
        -8.699075877468186
      ],
      [
        " щхьэусыгъуэ",
        -8.701127266676556
      ],
      [
        ", абы и",
        -8.701965119603628
      ],
      [
        " хуэ",
        -8.702094665789751
      ],
      [
        " усэ",
        -8.704209010050153
      ],
      [
        " адрей",
        -8.70462480843602
      ],
      [
        "ыр,",
        -8.705205801673264
      ],
      [
        "кIа",
        -8.705845852807345
      ],
      [
        "ауэ,",
        -8.708751315971476
      ],
      [
        "ст",
        -8.71157913716248
      ],
      [
        " ще",
        -8.711652582166487
      ],
      [
        " ф",
        -8.712253504716587
      ],
      [
        " апхуэдэу",
        -8.719390257782312
      ],
      [
        " тхакIуэ",
        -8.72199984723373
      ],
      [
        "дз",
        -8.724868553096702
      ],
      [
        " ахъшэ",
        -8.725812902203222
      ],
      [
        " лэжьыгъэм",
        -8.726707979577291
      ],
      [
        "ым»",
        -8.729224142656626
      ],
      [
        " нэхъыфI",
        -8.729433325728873
      ],
      [
        "Э",
        -8.732772796561509
      ],
      [
        "уэ щыта",
        -8.73620634680764
      ],
      [
        " нэхъыщхьэр",
        -8.739263636316931
      ],
      [
        " абы ",
        -8.739550151868283
      ],
      [
        "6",
        -8.740510942778453
      ],
      [
        "н папщIэ",
        -8.741207807326132
      ],
      [
        " утыку",
        -8.742640542200704
      ],
      [
        " жиIащ",
        -8.743743810256836
      ],
      [
        " телъыджэ",
        -8.74391320131176
      ],
      [
        " зэрызэ",
        -8.744408478606326
      ],
      [
        " тет",
        -8.744610646299906
      ],
      [
        "шы",
        -8.746424170624312
      ],
      [
        " Iу",
        -8.7470625780964
      ],
      [
        " иджыпсту",
        -8.748806490053635
      ],
      [
        "Ш",
        -8.751170456302436
      ],
      [
        "къы",
        -8.751752875115638
      ],
      [
        " фы",
        -8.75203785075514
