{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 1,
      "content": "[PAD]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "[UNK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "[CLS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 4,
      "content": "[SEP]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 5,
      "content": "[MASK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 6,
      "content": "жь",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 7,
      "content": "ку",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 8,
      "content": "кӀ",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 9,
      "content": "кIу",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 10,
      "content": "къ",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 11,
      "content": "къу",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 12,
      "content": "кхъ",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 13,
      "content": "кхъу",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 14,
      "content": "лъ",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 15,
      "content": "лI",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 16,
      "content": "пI",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 17,
      "content": "тI",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 18,
      "content": "фI",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 19,
      "content": "ху",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 20,
      "content": "хь",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 21,
      "content": "хъ",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 22,
      "content": "хъу",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 23,
      "content": "цI",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 24,
      "content": "щI",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 25,
      "content": "Ӏу",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 26,
      "content": "хуэ",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 27,
      "content": "во",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 28,
      "content": "рэ",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 29,
      "content": "зэ",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 30,
      "content": "де",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 31,
      "content": "зо",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 32,
      "content": "ар",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 33,
      "content": "ди",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 34,
      "content": "ремы",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 35,
      "content": "эрэ",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 36,
      "content": "дэ",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 37,
      "content": "ры",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 38,
      "content": "эж",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 39,
      "content": "ри",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 40,
      "content": "ыж",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 41,
      "content": "фы",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 42,
      "content": "мы",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 43,
      "content": "ау",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 44,
      "content": "щы",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 45,
      "content": "къым",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 46,
      "content": "хуа",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 47,
      "content": "эм",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 48,
      "content": "ат",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 49,
      "content": "хэ",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 50,
      "content": "нщ",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 51,
      "content": "зы",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 52,
      "content": "жы",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 53,
      "content": "тэ",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 54,
      "content": "ро",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 55,
      "content": "ды",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 56,
      "content": "хы",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 57,
      "content": "къэ",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 58,
      "content": "рызы",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 59,
      "content": "ащ",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 60,
      "content": "ре",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 61,
      "content": "да",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 62,
      "content": "до",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 63,
      "content": "ам",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 64,
      "content": "гъэ",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 65,
      "content": "вэ",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 66,
      "content": "ми",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 67,
      "content": "къы",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 68,
      "content": "ын",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 69,
      "content": "ха",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 70,
      "content": "эн",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 71,
      "content": "фӀэ",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 72,
      "content": "ущ",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 73,
      "content": "ра",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    }
  ],
  "normalizer": null,
  "pre_tokenizer": null,
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "Unigram",
    "unk_id": 0,
    "vocab": [
      [
        "UNK",
        0.0
      ],
      [
        "[PAD]",
        0.0
      ],
      [
        "[UNK]",
        0.0
      ],
      [
        "[CLS]",
        0.0
      ],
      [
        "[SEP]",
        0.0
      ],
      [
        "[MASK]",
        0.0
      ],
      [
        " ",
        -2.5083904986947534
      ],
      [
        "\n",
        -3.482028634904296
      ],
      [
        "м ",
        -3.9386006695221134
      ],
      [
        "р ",
        -4.076029848324493
      ],
      [
        "у",
        -4.209277621324572
      ],
      [
        "у ",
        -4.353763203516465
      ],
      [
        "и",
        -4.5558111304052
      ],
      [
        "гъэ",
        -4.595436932381606
      ],
      [
        "п",
        -4.624252623013232
      ],
      [
        "зы",
        -4.639834956524293
      ],
      [
        "с",
        -4.659608734699356
      ],
      [
        "и ",
        -4.659854318462518
      ],
      [
        "мы",
        -4.698245415568174
      ],
      [
        "е",
        -4.6983261022737235
      ],
      [
        "щ ",
        -4.811371033812961
      ],
      [
        "зэ",
        -4.825646131465332
      ],
      [
        "н",
        -4.885048206816466
      ],
      [
        "а",
        -4.8891620378515785
      ],
      [
        "р",
        -4.920649474468123
      ],
      [
        "щӀэ",
        -4.938481609747489
      ],
      [
        "т",
        -4.953980723815224
      ],
      [
        "хьэ",
        -4.959158952454345
      ],
      [
        "Ӏэ",
        -5.076429173764742
      ],
      [
        "щы",
        -5.081681833265771
      ],
      [
        "къы",
        -5.165443911032154
      ],
      [
        "т ",
        -5.1671219843657905
      ],
      [
        "нэ",
        -5.19145082502601
      ],
      [
        "хэр ",
        -5.191833321878461
      ],
      [
        "гу",
        -5.212410788048249
      ],
      [
        "кӀэ ",
        -5.233251446570453
      ],
      [
        "хэ",
        -5.259029234086709
      ],
      [
        "дэ",
        -5.274554004189184
      ],
      [
        "я",
        -5.28473409136234
      ],
      [
        "ри ",
        -5.3121878288310675
      ],
      [
        "сы",
        -5.330742849865294
      ],
      [
        "хэм ",
        -5.334247521290518
      ],
      [
        "къэ",
        -5.358836653104609
      ],
      [
        "м и ",
        -5.36931680278048
      ],
      [
        "б",
        -5.398142185673498
      ],
      [
        "н ",
        -5.400410311126677
      ],
      [
        "д",
        -5.447196138088627
      ],
      [
        "хуэ",
        -5.450548314539878
      ],
      [
        "те",
        -5.49053916886959
      ],
      [
        "ы",
        -5.523296515427878
      ],
      [
        "к",
        -5.5399445704614045
      ],
      [
        "ш",
        -5.5474394335422925
      ],
      [
        "з",
        -5.553378836067038
      ],
      [
        "рэ ",
        -5.568624318973734
      ],
      [
        "мэ",
        -5.625039249364242
      ],
      [
        "ры",
        -5.630574286033081
      ],
      [
        "ды",
        -5.642744575969292
      ],
      [
        "щӀы",
        -5.64506165138474
      ],
      [
        "ху",
        -5.646228708080521
      ],
      [
        "кӀуэ",
        -5.662697068063842
      ],
      [
        "къа",
        -5.668244473654699
      ],
      [
        "м",
        -5.672161220319383
      ],
      [
        "жы",
        -5.676503068104905
      ],
      [
        "щ",
        -5.690001201879458
      ],
      [
        "о",
        -5.6963904157073735
      ],
      [
        "ра",
        -5.698592937438299
      ],
      [
        "ым ",
        -5.704010678354431
      ],
      [
        "пэ",
        -5.728504095944086
      ],
      [
        "зэры",
        -5.744980956491196
      ],
      [
        "хъу",
        -5.751780542868131
      ],
      [
        "кӀэ",
        -5.771827041988496
      ],
      [
        "да",
        -5.813063480361782
      ],
      [
        "ри",
        -5.819301029065791
      ],
      [
        "ты",
        -5.82638962366808
      ],
      [
        "гъуэ",
        -5.841347760371319
      ],
      [
        "ма",
        -5.851248588607287
      ],
      [
        "сэ",
        -5.853448388450886
      ],
      [
        "ж",
        -5.8553795221090095
      ],
      [
        "на",
        -5.860499601155174
      ],
      [
        "лъэ",
        -5.863416301030226
      ],
      [
        "мэ ",
        -5.8725629204377725
      ],
      [
        "ар ",
        -5.877039195913261
      ],
      [
        "а ",
        -5.880773672510141
      ],
      [
        "ми ",
        -5.881322899226648
      ],
      [
        "л",
        -5.8859459186293925
      ],
      [
        "ауэ ",
        -5.892696178987009
      ],
      [
        "гъу",
        -5.895445812694424
      ],
      [
        "уэ ",
        -5.8987325002662985
      ],
      [
        "лъ",
        -5.903615783081609
      ],
      [
        "щхьэ",
        -5.933977208359179
      ],
      [
        "в",
        -5.945846903236349
      ],
      [
        "тэ",
        -5.957324856609588
      ],
      [
        "ха",
        -5.964417144067898
      ],
      [
        "я ",
        -5.96558295138059
      ],
      [
        "уэ",
        -5.991780690745879
      ],
      [
        "ащ ",
        -5.992403407192208
      ],
      [
        "кӀы",
        -5.994266698512407
      ],
      [
        "Ӏу",
        -6.02250304165281
      ],
      [
        "шы",
        -6.027473415383973
      ],
      [
        "абы ",
        -6.037558417123179
      ],
      [
        "бэ",
        -6.043325374146381
      ],
      [
        "хы",
        -6.074760958156851
      ],
      [
        "ыр ",
        -6.07875343047958
      ],
      [
        "къу",
        -6.09773743462828
      ],
      [
        "за",
        -6.110000842391196
      ],
      [
        "рэ",
        -6.114559294161433
      ],
      [
        "къи",
        -6.1294470817354245
      ],
      [
        "г",
        -6.132860568651061
      ],
      [
        "Ӏ",
        -6.134003976180459
      ],
      [
        "та",
        -6.141922749068552
      ],
      [
        "ди",
        -6.143338643641366
      ],
      [
        "ща",
        -6.143759569152218
      ],
      [
        "щӀа",
        -6.158812290556682
      ],
      [
        "щэ",
        -6.165258464744696
      ],
      [
        "фэ",
        -6.172753632482715
      ],
      [
        "мрэ ",
        -6.197622128040086
      ],
      [
        "ну ",
        -6.201948974679473
      ],
      [
        "э",
        -6.247037475926891
      ],
      [
        "фӀэ",
        -6.249934309483114
      ],
      [
        "шэ",
        -6.25155756975828
      ],
      [
        "къым ",
        -6.253463368030021
      ],
      [
        "джэ",
        -6.281407604860808
      ],
      [
        "ф",
        -6.281543547546283
      ],
      [
        "жьы",
        -6.293462061163881
      ],
      [
        "гъа",
        -6.293743779169279
      ],
      [
        "рт ",
        -6.305924205800107
      ],
      [
        "ди ",
        -6.349148315457178
      ],
      [
        "лэ",
        -6.3591419271025575
      ],
      [
        "кӀа",
        -6.359249834864658
      ],
      [
        "ла",
        -6.364047072206143
      ],
      [
        "хъуэ",
        -6.377834524847364
      ],
      [
        "хуа",
        -6.395404660467113
      ],
      [
        "хэм я ",
        -6.396779909743827
      ],
      [
        "къуэ",
        -6.403512198068576
      ],
      [
        "лъы",
        -6.404933964402797
      ],
      [
        "жа",
        -6.40498470722647
      ],
      [
        "ре",
        -6.411409116846645
      ],
      [
        "си ",
        -6.4126944062879065
      ],
      [
        "са",
        -6.435693905413366
      ],
      [
        "х",
        -6.441415695947546
      ],
      [
        "ны",
        -6.4420090574957705
      ],
      [
        "ц",
        -6.45783100877224
      ],
      [
        "1",
        -6.458306094368927
      ],
      [
        "ч",
        -6.459583584064626
      ],
      [
        "ку",
        -6.46822925529027
      ],
      [
        "мкӀэ ",
        -6.4744995868361706
      ],
      [
        "нэ ",
        -6.501342688745536
      ],
      [
        "лы",
        -6.512973364674442
      ],
      [
        "цӀыху",
        -6.524926386108053
      ],
      [
        "ý",
        -6.5268923001355095
      ],
      [
        "ей",
        -6.529716689219486
      ],
      [
        "ба",
        -6.546230414435751
      ],
      [
        "сэ ",
        -6.554353978098067
      ],
      [
        "то",
        -6.556373499697504
      ],
      [
        "па",
        -6.581967448875325
      ],
      [
        "щӀ",
        -6.584808173828026
      ],
      [
        "Ӏуэху",
        -6.5855470918674115
      ],
      [
        "ро",
        -6.594468556423049
      ],
      [
        "псэ",
        -6.601972770810018
      ],
      [
        "ным ",
        -6.608058301492411
      ],
      [
        "къе",
        -6.631439232341927
      ],
      [
        "уи ",
        -6.646764429157939
      ],
      [
        "бзэ",
        -6.6565827825048505
      ],
      [
        "лъа",
        -6.657093803044505
      ],
      [
        "псы",
        -6.659528951146093
      ],
      [
        "кӀ",
        -6.668755044227574
      ],
      [
        "бы",
        -6.6829509226091215
      ],
      [
        "со",
        -6.687239023656593
      ],
      [
        "хь",
        -6.689225715380884
      ],
      [
        "ныгъэ",
        -6.690411396642585
      ],
      [
        "зи",
        -6.696578463058033
      ],
      [
        "пы",
        -6.7073603773310015
      ],
      [
        "махуэ",
        -6.708151682225424
      ],
      [
        "фы",
        -6.7139420047978415
      ],
      [
        "дзэ",
        -6.721113571217888
      ],
      [
        "хьа",
        -6.724052942110177
      ],
      [
        "ар",
        -6.727683458158195
      ],
      [
        "пӀэ",
        -6.735031338967206
      ],
      [
        "ми",
        -6.7391881468599575
      ],
      [
        "ей ",
        -6.754169084661218
      ],
      [
        "ɷ",
        -6.762146440052282
      ],
      [
        "хуи",
        -6.765586450472352
      ],
      [
        "ни",
        -6.7678431189400925
      ],
      [
        "къ",
        -6.776791296286742
      ],
      [
        "нэхъ ",
        -6.779054769779181
      ],
      [
        "ым и ",
        -6.783495116959603
      ],
      [
        "ли",
        -6.791733402148255
      ],
      [
        "но",
        -6.796092415352286
      ],
      [
        "жьэ",
        -6.820484368175672
      ],
      [
        "де",
        -6.822704739598089
      ],
      [
        "м къы",
        -6.829507235935008
      ],
      [
        "ст",
        -6.848098454903289
      ],
      [
        "й",
        -6.849737889803441
      ],
      [
        "2",
        -6.858443115813019
      ],
      [
        "с ",
        -6.870476349055677
      ],
      [
        "лӀы",
        -6.875615343871463
      ],
      [
        "ж ",
        -6.8855005483707465
      ],
      [
        "ъ",
        -6.8901649122202215
      ],
      [
        "жэ",
        -6.895924509689008
      ],
      [
        "ка",
        -6.899103151388777
      ],
      [
        "фӀы",
        -6.90767227766424
      ],
      [
        "къыщы",
        -6.9101156842590115
      ],
      [
        "псалъэ",
        -6.912637928283923
      ],
      [
        "ле",
        -6.913683498546014
      ],
      [
        "хъуа",
        -6.913808792615303
      ],
      [
        "лъагъу",
        -6.917675085844749
      ],
      [
        "жь",
        -6.9317955907577335
      ],
      [
        "5 ",
        -6.932504380302431
      ],
      [
        "û",
        -6.9354742911770035
      ],
      [
        "гъэм ",
        -6.93837346293685
      ],
      [
        "ко",
        -6.939270410427476
      ],
      [
        "адыгэ",
        -6.940838783244896
      ],
      [
        "лӀэ",
        -6.947937591146555
      ],
      [
        "до",
        -6.950295331831015
      ],
      [
        "0",
        -6.956722196790629
      ],
      [
        "тхьэ",
        -6.964891887929674
      ],
      [
        "х ",
        -6.965179201578239
      ],
      [
        "м и",
        -6.97256323693189
      ],
      [
        "кӀу",
        -6.976006379517097
      ],
      [
        "къызэ",
        -6.991207122594643
      ],
      [
        "щи",
        -6.999957708068841
      ],
      [
        "хи",
        -7.0011768229366105
      ],
      [
        "по",
        -7.003474428037819
      ],
      [
        "щыӀэ",
        -7.0044625596864165
      ],
      [
        "джы",
        -7.013969676183313
      ],
      [
        "19",
        -7.024370697522619
      ],
      [
        "шхуэ",
        -7.024621690872268
      ],
      [
        "Ӏа",
        -7.025269412992895
      ],
      [
        "ти ",
        -7.026392365681167
      ],
      [
        "гъы",
        -7.029460287071208
      ],
      [
        "уа",
        -7.033746046727716
      ],
      [
        "езы",
        -7.034956419719693
      ],
      [
        "ó",
        -7.040119299957281
      ],
      [
        "хэмрэ ",
        -7.043555772555271
      ],
      [
        "куэд",
        -7.047707700826548
      ],
      [
        "ша",
        -7.0491000714220995
      ],
      [
        "хъ",
        -7.052309095898291
      ],
      [
        "хьы",
        -7.056814668717989
      ],
      [
        "адэ",
        -7.061909199278649
      ],
      [
        "му",
        -7.063371095234194
      ],
      [
        "кӀ ",
        -7.064497845233433
      ],
      [
        "цӀэ",
        -7.069751732560107
      ],
      [
        "ин",
        -7.078284118415416
      ],
      [
        "20",
        -7.081728835924764
      ],
      [
        "ва",
        -7.083563004278112
      ],
      [
        "хэт",
        -7.0854414507572745
      ],
      [
        "ну",
        -7.086238532168295
      ],
      [
        "зи ",
        -7.087614199334952
      ],
      [
        "ан",
        -7.094733704635749
      ],
      [
        "ю",
        -7.105255726168478
      ],
      [
        "гъащӀэ",
        -7.106993101780139
      ],
      [
        "Ӏуа",
        -7.108214617982588
      ],
      [
        "л ",
        -7.108897520628581
      ],
      [
        "кӀуа",
        -7.113914736616053
      ],
      [
        "нущ ",
        -7.114194193474443
      ],
      [
        "къалэ",
        -7.117908722119367
      ],
      [
        "зе",
        -7.121604657906479
      ],
      [
        "щӀалэ",
        -7.122982483198214
      ],
      [
        "Ӏ ",
        -7.128887081780025
      ],
      [
        "Ӏо",
        -7.131083289059733
      ],
      [
        "р къы",
        -7.131207344691083
      ],
      [
        "къо",
        -7.136332275298734
      ],
      [
        "Ӏуэ",
        -7.1383036586323385
      ],
      [
        "фӀ",
        -7.160200475802313
      ],
      [
        "фи",
        -7.1641151673329
      ],
      [
        "ду",
        -7.168403749063341
      ],
      [
        "Ӏы",
        -7.172305756688916
      ],
      [
        "тӀы",
        -7.173335091170319
      ],
      [
        "блэ",
        -7.175205538752756
      ],
      [
        "ири",
        -7.175321543192929
      ],
      [
        "жащ ",
        -7.177653579685339
      ],
      [
        "щӀи",
        -7.1823520932791975
      ],
      [
        "мо",
        -7.182973763919135
      ],
      [
        "урэ ",
        -7.187075541129028
      ],
      [
        "анэ",
        -7.187490397883405
      ],
      [
        "си",
        -7.18760306815641
      ],
      [
        "унэ",
        -7.188429092613967
      ],
      [
        "се",
        -7.191637460766451
      ],
      [
        "бгъэ",
        -7.192652313251475
      ],
      [
        "ти",
        -7.19714725486573
      ],
      [
        "вэ",
        -7.198968575364988
      ],
      [
        "пщӀэ",
        -7.201372859307508
      ],
      [
        "й ",
        -7.20611121405048
      ],
      [
        "4",
        -7.212343399702352
      ],
      [
        "щӀэныгъэ",
        -7.215906810954555
      ],
      [
        " дыдэ",
        -7.219023945888317
      ],
      [
        "гъ ",
        -7.226200894605508
      ],
      [
        "кӀи ",
        -7.226737633959393
      ],
      [
        "къызэры",
        -7.227595358600526
      ],
      [
        "ныр ",
        -7.234569634003229
      ],
      [
        "ь",
        -7.235250494691012
      ],
      [
        "щи ",
        -7.236536510389515
      ],
      [
        "м щы",
        -7.239744996160383
      ],
      [
        "ло",
        -7.240102895449374
      ],
      [
        "жиӀэ",
        -7.240810891968854
      ],
      [
        "щӀ ",
        -7.245122323494849
      ],
      [
        "адыгэ ",
        -7.253304652992208
      ],
      [
        "плъы",
        -7.2628764492154385
      ],
      [
        "ɵ",
        -7.264990865514454
      ],
      [
        "пщы",
        -7.265039187310782
      ],
      [
        "фа",
        -7.2677063837099105
      ],
      [
        "сыт ",
        -7.269608324408212
      ],
      [
        "ме",
        -7.278680632255419
      ],
      [
        "à",
        -7.2789346679323295
      ],
      [
        "джа",
        -7.279373223510694
      ],
      [
        "итӀ",
        -7.281081812889733
      ],
      [
        "гъуэ ",
        -7.287198261664104
      ],
      [
        "хуэдэ",
        -7.288847397413601
      ],
      [
        "плъэ",
        -7.2935635457188575
      ],
      [
        "бо",
        -7.293713714910911
      ],
      [
        "абы и ",
        -7.297666239545817
      ],
      [
        "ɭ",
        -7.301587451156593
      ],
      [
        "кӀуэ ",
        -7.303269523648771
      ],
      [
        "пщэ",
        -7.304604850624278
      ],
      [
        "деж ",
        -7.314973596344359
      ],
      [
        "хэри ",
        -7.315233722279107
      ],
      [
        "ркъым ",
        -7.317017699310577
      ],
      [
        "зэри",
        -7.3194723521600284
      ],
      [
        "цэ",
        -7.321799382789143
      ],
      [
        "лӀ",
        -7.329780764170394
      ],
      [
        " цӀыкӀу",
        -7.345260530771519
      ],
      [
        "иӀэ",
        -7.345607842602535
      ],
      [
        "икӀи ",
        -7.3494660575874615
      ],
      [
        " хъу",
        -7.355443594458496
      ],
      [
        "тӀэ",
        -7.361806281670402
      ],
      [
        "же",
        -7.362096354035575
      ],
      [
        "вы",
        -7.362378068149388
      ],
      [
        "псэу",
        -7.363200697774108
      ],
      [
        "ту ",
        -7.363684130467757
      ],
      [
        "зыгъэ",
        -7.368400625950818
      ],
      [
        "р зы",
        -7.370832777545363
      ],
      [
        "игъэ",
        -7.37329835177106
      ],
      [
        "жь ",
        -7.3752449135493965
      ],
      [
        "лэжьыгъэ",
        -7.378976433677989
      ],
      [
        "гуэ",
        -7.380938832543537
      ],
      [
        "зэра",
        -7.381850006944742
      ],
      [
        "бе",
        -7.385015707488352
      ],
      [
        "пхъэ",
        -7.405977055535917
      ],
      [
        "нэгъуэщӀ",
        -7.406368742707675
      ],
      [
        "хуей",
        -7.406490291061733
      ],
      [
        "хь ",
        -7.411510971639876
      ],
      [
        "ис",
        -7.414579015943199
      ],
      [
        "плъ",
        -7.418033379071048
      ],
      [
        "7 ",
        -7.428314624128143
      ],
      [
        "тащ ",
        -7.432423902501203
      ],
      [
        "зауэ",
        -7.432436559272778
      ],
      [
        "го",
        -7.444685281081918
      ],
      [
        "къуажэ",
        -7.446543151692254
      ],
      [
        "хэм я",
        -7.451282908759673
      ],
      [
        "3",
        -7.456509053224078
      ],
      [
        "мыгъэ",
        -7.457526970238504
      ],
      [
        "6 ",
        -7.4671037583924225
      ],
      [
        "дэ ",
        -7.473362536583647
      ],
      [
        "ахэр ",
        -7.477950766207805
      ],
      [
        "ȫ",
        -7.478402802820895
      ],
      [
        "нщ ",
        -7.478713162861105
      ],
      [
        "н хуей",
        -7.480430619585352
      ],
      [
        "ще",
        -7.483134188390197
      ],
      [
        "ригъэ",
        -7.485728908776414
      ],
      [
        "жын",
        -7.490418162875461
      ],
      [
        "дж",
        -7.494657449574488
      ],
      [
        "гъуэгу",
        -7.497707929760862
      ],
      [
        "рей",
        -7.497896144810898
      ],
      [
        "ð",
        -7.500718343856855
      ],
      [
        "тхылъ",
        -7.5007214022908695
      ],
      [
        "мыӀэ",
        -7.501018383842464
      ],
      [
        "хъа",
        -7.502657062849641
      ],
      [
        "кэ",
        -7.505260332455174
      ],
      [
        "во",
        -7.507290718482611
      ],
      [
        "не",
        -7.5076205036505375
      ],
      [
        "зэхэ",
        -7.508794037768308
      ],
      [
        "лӀа",
        -7.509521929703132
      ],
      [
        "нур ",
        -7.512041969914998
      ],
      [
        "лъхьэ",
        -7.516007403931738
      ],
      [
        "пс",
        -7.5194288827788345
      ],
      [
        "жу ",
        -7.522024167719215
      ],
      [
        "абыхэм ",
        -7.524622993464812
      ],
      [
        "ит",
        -7.526593566395201
      ],
      [
        "3 ",
        -7.533924516626437
      ],
      [
        "лъэпкъ",
        -7.534164075707823
      ],
      [
        "кэ ",
        -7.5394163545783925
      ],
      [
        "илъэс",
        -7.5421268675286015
      ],
      [
        "2 ",
        -7.547778877769382
      ],
      [
        "гъ",
        -7.559676521937041
      ],
      [
        "гъуа",
        -7.560011948617879
      ],
      [
        "хьащ ",
        -7.567678232691311
      ],
      [
        "къыхэ",
        -7.5683998348862715
      ],
      [
        "що",
        -7.571052713839526
      ],
      [
        " гуэр",
        -7.574612391617016
      ],
      [
        "тэкъым ",
        -7.5777727298580775
      ],
      [
        "è",
        -7.578343824100635
      ],
      [
        "шхуэ ",
        -7.579425382553499
      ],
      [
        "абы",
        -7.581273915724472
      ],
      [
        "к ",
        -7.582488604612747
      ],
      [
        "республикэ",
        -7.58277143870491
      ],
      [
        "ий ",
        -7.583252713416192
      ],
      [
        "ншэ",
        -7.5867524178002
      ],
      [
        "8 ",
        -7.592619784343341
      ],
      [
        "ȩ",
        -7.6004825175974275
      ],
      [
        "тым ",
        -7.6019131575149945
      ],
      [
        "илъэс ",
        -7.602078527874276
      ],
      [
        "5",
        -7.603150479584157
      ],
      [
        "рагъэ",
        -7.603624606981247
      ],
      [
        "кӀыу ",
        -7.6037037395987035
      ],
      [
        "псори ",
        -7.604171046476926
      ],
      [
        "дза",
        -7.608791559695247
      ],
      [
        "рщ ",
        -7.609240871552235
      ],
      [
        "лъытэ",
        -7.611231193262697
      ],
      [
        "ɚ",
        -7.612710260916314
      ],
      [
        "ì",
        -7.617603650692862
      ],
      [
        "хэми ",
        -7.618222226546031
      ],
      [
        "хэлъ",
        -7.619235874168853
      ],
      [
        "жьа",
        -7.61946254456854
      ],
      [
        "ру",
        -7.626967603112943
      ],
      [
        "ви",
        -7.627397376473793
      ],
      [
        "сабий",
        -7.628285658774949
      ],
      [
        "ве",
        -7.635048118547708
      ],
      [
        "зо",
        -7.636107841993907
      ],
      [
        "хабзэ",
        -7.641481240879624
      ],
      [
        "6",
        -7.648072907830436
      ],
      [
        "ком",
        -7.650537590445355
      ],
      [
        "ту",
        -7.6537576338225115
      ],
      [
        "згъэ",
        -7.657436928262619
      ],
      [
        "щӀащ ",
        -7.659139904101568
      ],
      [
        "урыс",
        -7.65918628984735
      ],
      [
        "пӀэ ",
        -7.663221837662745
      ],
      [
        "пе",
        -7.6678858346092635
      ],
      [
        "7",
        -7.6679131639085405
      ],
      [
        "õ",
        -7.668194935089128
      ],
      [
        "хъуащ ",
        -7.671113943405057
      ],
      [
        "хэмкӀэ ",
        -7.6714491268791765
      ],
      [
        "унафэ",
        -7.672404052277749
      ],
      [
        "4 ",
        -7.676897571030844
      ],
      [
        "ын",
        -7.677721316822094
      ],
      [
        "щыт",
        -7.6780536759556135
      ],
      [
        "ней",
        -7.682541123731324
      ],
      [
        "япэ",
        -7.68450294523408
      ],
      [
        "къэбэрдей балъкъ",
        -7.687610518680247
      ],
      [
        "аб",
        -7.6878289707714575
      ],
      [
        "тет",
        -7.688589209049988
      ],
      [
        "хэм ящыщ",
        -7.69933330808079
      ],
      [
        "щхьэкӀэ ",
        -7.704761323112617
      ],
      [
        "къри",
        -7.707315229851217
      ],
      [
        "ира",
        -7.71617020862158
      ],
      [
        "папщӀэ ",
        -7.72526965269636
      ],
      [
        "къыс",
        -7.726754325257652
      ],
      [
        "кӀащ ",
        -7.731788608608884
      ],
      [
        "ныкъуэ",
        -7.734955893254815
      ],
      [
        "ù",
        -7.736281920330375
      ],
      [
        "у щыта",
        -7.739990521888897
      ],
      [
        "убыд",
        -7.741343504102931
      ],
      [
        "щӀыналъэ",
        -7.747957760839636
      ],
      [
        "къэрал ",
        -7.749003267383854
      ],
      [
        "гу ",
        -7.7495677716855695
      ],
      [
        "къыдэ",
        -7.751877528876351
      ],
      [
        "къбр м ",
        -7.751996598575973
      ],
      [
        "ужь",
        -7.753012162150993
      ],
      [
        "къыз",
        -7.759531144516693
      ],
      [
        "хэку",
        -7.760034634708745
      ],
      [
        "три",
        -7.762306543776855
      ],
      [
        "тра",
        -7.764895529379158
      ],
      [
        "жаӀэ",
        -7.767422020724407
      ],
      [
        "гъусэ",
        -7.76782187166668
      ],
      [
        "али",
        -7.768494029071352
      ],
      [
        "дахэ",
        -7.7686011700997195
      ],
      [
        "чэ",
        -7.7754554392183
      ],
      [
        "ɪ",
        -7.781663883698814
      ],
      [
        "ов ",
        -7.7852556969652795
      ],
      [
        "хуе",
        -7.786917235503299
      ],
      [
        "ɯ",
        -7.791154039908292
      ],
      [
        "мыхъу",
        -7.809713950050702
      ],
      [
        "ста",
        -7.813780967549393
      ],
      [
        "хъы",
        -7.816002265860405
      ],
      [
        "деж",
        -7.819569998797231
      ],
      [
        "зыгуэр",
        -7.820157199951536
      ],
      [
        "лажьэ",
        -7.822850725286138
      ],
      [
        "кӀыж",
        -7.823525580458599
      ],
      [
        "бий",
        -7.827158207980279
      ],
      [
        "закъуэ",
        -7.829806294449485
      ],
      [
        "чы",
        -7.843496378219966
      ],
      [
        "хъумэ",
        -7.844498845555215
      ],
      [
        " нэхъыщхьэ",
        -7.851703329314775
      ],
      [
        "ɢ",
        -7.855314698104232
      ],
      [
        "гуры",
        -7.859464679317904
      ],
      [
        "пхъу",
        -7.86504320479664
      ],
      [
        "дунейм ",
        -7.865926965221677
      ],
      [
        "гуп",
        -7.868135023610163
      ],
      [
        "12 ",
        -7.873254196162641
      ],
      [
        "пӀа",
        -7.873916979428172
      ],
      [
        "ɦ",
        -7.877150296675994
      ],
      [
        "щӀыпӀэ",
        -7.877564163768589
      ],
      [
        "га",
        -7.890699690959295
      ],
      [
        "и унафэщӀ",
        -7.891247418115331
      ],
      [
        "гъэув",
        -7.89286257500272
      ],
      [
        "щтэ",
        -7.897821864553672
      ],
      [
        "иджы ",
        -7.899560694177104
      ],
      [
        "нукъым ",
        -7.901786010220238
      ],
      [
        "че",
        -7.903806262424565
      ],
      [
        "хъыбар",
        -7.904153308515971
      ],
      [
        "аращ ",
        -7.909069976629345
      ],
      [
        "къуа",
        -7.911585027382188
      ],
      [
        "8",
        -7.9149212334456305
      ],
      [
        "жыпӀэ",
        -7.918454829804864
      ],
      [
        "хо",
        -7.9192033114879035
      ],
      [
        "зэфӀэкӀ",
        -7.922831501998829
      ],
      [
        "9",
        -7.924830626360869
      ],
      [
        " куэд ",
        -7.929330975347602
      ],
      [
        "фо",
        -7.931170922204961
      ],
      [
        "00 ",
        -7.939796189092078
      ],
      [
        "ɳ",
        -7.948111536284026
      ],
      [
        "жиӀащ ",
        -7.948362649720671
      ],
      [
        "бжэ",
        -7.9574718439009935
      ],
      [
        "джэгу",
        -7.958833699110414
      ],
      [
        "Ӏэмал",
        -7.965695130810939
      ],
      [
        "унагъуэ",
        -7.965759998911887
      ],
      [
        "увэ",
        -7.985305891884044
      ],
      [
        "гра",
        -7.993024084638201
      ],
      [
        "псом ",
        -7.999772529384389
      ],
      [
        "фӀа",
        -8.00294361280742
      ],
      [
        "кавказ",
        -8.01745237686699
      ],
      [
        "нымкӀэ ",
        -8.021757688431618
      ],
      [
        "бгъэдэ",
        -8.029363745084764
      ],
      [
        "апхуэдэу ",
        -8.029400210194567
      ],
      [
        "ȡ",
        -8.02978130111453
      ],
      [
        "тӀа",
        -8.036083708205092
      ],
      [
        "ò",
        -8.036428052070432
      ],
      [
        "пэж",
        -8.039726717702175
      ],
      [
        "щӀыхь",
        -8.047367721229794
      ],
      [
        "апхуэдэ",
        -8.05215707691313
      ],
      [
        "лэжьакӀуэ",
        -8.054315688395933
      ],
      [
        "зэре",
        -8.05456491832918
      ],
      [
        "фӀыуэ ",
        -8.057906327048512
      ],
      [
        "макъ",
        -8.062617423617288
      ],
      [
        "бгы",
        -8.069442797927026
      ],
      [
        "къэрал",
        -8.07967669352936
      ],
      [
        "нэхъыбэ",
        -8.085972437359146
      ],
      [
        "благъэ",
        -8.087255889895234
      ],
      [
        "псоми ",
        -8.088920182742964
      ],
      [
        "тхыдэ",
        -8.093169831293842
      ],
      [
        "хьэзыр",
        -8.094042527548703
      ],
      [
        "къра",
        -8.09434476022068
      ],
      [
        "эрым ",
        -8.095335502993454
      ],
      [
        "къыщӀэкӀ",
        -8.099096111135372
      ],
      [
        "і",
        -8.101981590560367
      ],
      [
        "ç",
        -8.104211295267156
      ],
      [
        "мурад",
        -8.10551187017467
      ],
      [
        "уэрэд",
        -8.110579516364762
      ],
      [
        "гъуэт",
        -8.113717923074827
      ],
      [
        "упщӀ",
        -8.114487851119652
      ],
      [
        "ñ",
        -8.118192511474168
      ],
      [
        "тхыгъэ",
        -8.122162734608146
      ],
      [
        "í",
        -8.128841464539272
      ],
      [
        "ä",
        -8.13698706123564
      ],
      [
        "зэман",
        -8.139834084447587
      ],
      [
        "гурыӀуэ",
        -8.14331232027381
      ],
      [
        "игу ",
        -8.14597029357467
      ],
      [
        "ртэкъым ",
        -8.14666148069108
      ],
      [
        "лэжьа",
        -8.147793481551892
      ],
      [
        "налшык ",
        -8.148245917050522
      ],
      [
        "гъо",
        -8.150545555168172
      ],
      [
        "лъапӀэ",
        -8.157215430057464
      ],
      [
        "щэнхабзэ",
        -8.158152262431598
      ],
      [
        "ныбжьэгъу",
        -8.158403725423113
      ],
      [
        "спорт",
        -8.16229462947519
      ],
      [
        "Ӏыгъ",
        -8.174737514612312
      ],
      [
        "щекӀуэкӀ",
        -8.177566405730461
      ],
      [
        "ӀэнатӀэ",
        -8.181094008159759
      ],
      [
        "цӀыкӀу",
        -8.185444134681875
      ],
      [
        "лъэгъу",
        -8.188812015585793
      ],
      [
        "адрей",
        -8.197081545643922
      ],
      [
        "лъэныкъуэ",
        -8.198994923127804
      ],
      [
        "теухуа",
        -8.19955496520454
      ],
      [
        "щӀо",
        -8.200089848477127
      ],
      [
        "гъэкӀуэкӀ",
        -8.205370471614179
      ],
      [
        "хъыджэбз",
        -8.211497849884093
      ],
      [
        "цӀы",
        -8.213397468646752
      ],
      [
        "ι",
        -8.21401215863953
      ],
      [
        "ӀэщӀагъэ",
        -8.214949143672465
      ],
      [
        "тхакӀуэ",
        -8.21850407447095
      ],
      [
        "совет",
        -8.222793205433257
      ],
      [
        "иджыри ",
        -8.226448407817891
      ],
      [
        "êú",
        -8.228590257466642
      ],
      [
        "нэхъыжь",
        -8.234227500114006
      ],
      [
        "лей",
        -8.238479364684745
      ],
      [
        "къэбэрдей",
        -8.243912949466965
      ],
      [
        "зэӀущӀэ",
        -8.25046416817967
      ],
      [
        "тӀэкӀу",
        -8.254479014020728
      ],
      [
        "ț",
        -8.254514540051789
      ],
      [
        "гупсысэ",
        -8.256346640269301
      ],
      [
        "гуапэ",
        -8.256863031359243
      ],
      [
        "хъэ",
        -8.257923478504711
      ],
      [
        "цӀэрыӀуэ",
        -8.269797712422694
      ],
      [
        "школ",
        -8.279924182095682
      ],
      [
        "жылагъуэ",
        -8.290645624687174
      ],
      [
        "зэманым ",
        -8.290690642798925
      ],
      [
        "гъунэгъу",
        -8.291326281774834
      ],
      [
        "насып",
        -8.291613771743235
      ],
      [
        "ȏ",
        -8.292317220427536
      ],
      [
        "нэхъыфӀ",
        -8.293495987845716
      ],
      [
        "окъуэ ",
        -8.293918053014458
      ],
      [
        "фащэ",
        -8.297136989425162
      ],
      [
        "гупсыс",
        -8.303020294342222
      ],
      [
        "литературэ",
        -8.311528817313253
      ],
      [
        "усакӀуэ",
        -8.315037395304556
      ],
      [
        "18",
        -8.322314387537073
      ],
      [
        "урысейм ",
        -8.334077715756582
      ],
      [
        "æ",
        -8.33519521425791
      ],
      [
        "сурэт",
        -8.341430086467126
      ],
      [
        "ú",
        -8.341534497722161
      ],
      [
        "іэ",
        -8.345333143371782
      ],
      [
        "ˠ",
        -8.349270679159154
      ],
      [
        "ием ",
        -8.357745643880056
      ],
      [
        "нарт",
        -8.358253719752383
      ],
      [
        "нобэ ",
        -8.362429460052587
      ],
      [
        "ï",
        -8.370466077614543
      ],
      [
        "ë",
        -8.370974229223737
      ],
      [
        "ȣ",
        -8.371906511687417
      ],
      [
        "парт",
        -8.38399544063473
      ],
      [
        "цӀыхубз",
        -8.38771779673328
      ],
      [
        "ȟ",
        -8.389182973025855
      ],
      [
        "ɬ",
        -8.391860929013042
      ],
      [
        "ș",
        -8.400897789394064
      ],
      [
        "еджапӀэ",
        -8.400993657827367
