{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "[PAD]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "[UNK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "[CLS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "[SEP]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 4,
      "content": "[MASK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 5,
      "content": "жь",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 6,
      "content": "ку",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 7,
      "content": "кӀ",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 8,
      "content": "кIу",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 9,
      "content": "къ",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 10,
      "content": "къу",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 11,
      "content": "кхъ",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 12,
      "content": "кхъу",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 13,
      "content": "лъ",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 14,
      "content": "лI",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 15,
      "content": "пI",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 16,
      "content": "тI",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 17,
      "content": "фI",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 18,
      "content": "ху",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 19,
      "content": "хь",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 20,
      "content": "хъ",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 21,
      "content": "хъу",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 22,
      "content": "цI",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 23,
      "content": "щI",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 24,
      "content": "Ӏу",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 25,
      "content": "хуэ",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Whitespace"
  },
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": null,
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "vocab": {
      "[PAD]": 0,
      "[UNK]": 1,
      "[CLS]": 2,
      "[SEP]": 3,
      "[MASK]": 4,
      "!": 5,
      "(": 6,
      ")": 7,
      "*": 8,
      ",": 9,
      "-": 10,
      ".": 11,
      "0": 12,
      "1": 13,
      "2": 14,
      "3": 15,
      "4": 16,
      "5": 17,
      "6": 18,
      "7": 19,
      "8": 20,
      "9": 21,
      ":": 22,
      ";": 23,
      "?": 24,
      "I": 25,
      "i": 26,
      "«": 27,
      "»": 28,
      "×": 29,
      "Ё": 30,
      "А": 31,
      "Б": 32,
      "В": 33,
      "Г": 34,
      "Д": 35,
      "Е": 36,
      "Ж": 37,
      "З": 38,
      "И": 39,
      "Й": 40,
      "К": 41,
      "Л": 42,
      "М": 43,
      "Н": 44,
      "О": 45,
      "П": 46,
      "Р": 47,
      "С": 48,
      "Т": 49,
      "У": 50,
      "Ф": 51,
      "Х": 52,
      "Ц": 53,
      "Ч": 54,
      "Ш": 55,
      "Щ": 56,
      "Ъ": 57,
      "Ы": 58,
      "Ь": 59,
      "Э": 60,
      "Ю": 61,
      "Я": 62,
      "а": 63,
      "б": 64,
      "в": 65,
      "г": 66,
      "д": 67,
      "е": 68,
      "ж": 69,
      "з": 70,
      "и": 71,
      "й": 72,
      "к": 73,
      "л": 74,
      "м": 75,
      "н": 76,
      "о": 77,
      "п": 78,
      "р": 79,
      "с": 80,
      "т": 81,
      "у": 82,
      "ф": 83,
      "х": 84,
      "ц": 85,
      "ч": 86,
      "ш": 87,
      "щ": 88,
      "ъ": 89,
      "ы": 90,
      "ь": 91,
      "э": 92,
      "ю": 93,
      "я": 94,
      "ё": 95,
      "–": 96,
      "…": 97,
      "№": 98,
      "уэ": 99,
      "Iэ": 100,
      "къ": 101,
      "гъ": 102,
      "эр": 103,
      "эм": 104,
      "ым": 105,
      "лъ": 106,
      "кI": 107,
      "хь": 108,
      "хъ": 109,
      "гъэ": 110,
      "ащ": 111,
      "ху": 112,
      "щI": 113,
      "къы": 114,
      "ыр": 115,
      "зэ": 116,
      "нэ": 117,
      "кIэ": 118,
      "щы": 119,
      "хуэ": 120,
      "хьэ": 121,
      "зы": 122,
      "гу": 123,
      "щIэ": 124,
      "дэ": 125,
      "ри": 126,
      "жь": 127,
      "ар": 128,
      "хэм": 129,
      "Iы": 130,
      "пс": 131,
      "ын": 132,
      "рэ": 133,
      "мы": 134,
      "хъу": 135,
      "гъу": 136,
      "ей": 137,
      "зэр": 138,
      "хэ": 139,
      "гъуэ": 140,
      "лъэ": 141,
      "хэр": 142,
      "къым": 143,
      "дж": 144,
      "аб": 145,
      "ды": 146,
      "ауэ": 147,
      "сы": 148,
      "кIуэ": 149,
      "те": 150,
      "ат": 151,
      "ан": 152,
      "мэ": 153,
      "ал": 154,
      "къэ": 155,
      "ап": 156,
      "Iу": 157,
      "ди": 158,
      "зэры": 159,
      "ур": 160,
      "сэ": 161,
      "къуэ": 162,
      "ми": 163,
      "си": 164,
      "щIы": 165,
      "цIы": 166,
      "ну": 167,
      "хы": 168,
      "ны": 169,
      "щхьэ": 170,
      "эу": 171,
      "абы": 172,
      "къу": 173,
      "кIу": 174,
      "Iуэ": 175,
      "жы": 176,
      "фIэ": 177,
      "нэхъ": 178,
      "Къ": 179,
      "тэ": 180,
      "пэ": 181,
      "ам": 182,
      "бы": 183,
      "лъа": 184,
      "ит": 185,
      "хуэдэ": 186,
      "лэ": 187,
      "ун": 188,
      "ры": 189,
      "ащIэ": 190,
      "кIы": 191,
      "лъы": 192,
      "зи": 193,
      "къи": 194,
      "да": 195,
      "пIэ": 196,
      "ра": 197,
      "щэ": 198,
      "ыну": 199,
      "гуэ": 200,
      "де": 201,
      "уи": 202,
      "джэ": 203,
      "ма": 204,
      "акIуэ": 205,
      "шэ": 206,
      "ст": 207,
      "цIыху": 208,
      "щыт": 209,
      "эри": 210,
      "хъуэ": 211,
      "хьэм": 212,
      "гъэм": 213,
      "агъэ": 214,
      "жи": 215,
      "жа": 216,
      "бэ": 217,
      "жьэ": 218,
      "зэм": 219,
      "ий": 220,
      "за": 221,
      "Ар": 222,
      "гуэр": 223,
      "ужь": 224,
      "фI": 225,
      "зым": 226,
      "ку": 227,
      "фэ": 228,
      "шы": 229,
      "зыр": 230,
      "щи": 231,
      "дыг": 232,
      "Хь": 233,
      "тIэ": 234,
      "урэ": 235,
      "къе": 236,
      "Iа": 237,
      "щIа": 238,
      "фIы": 239,
      "шхуэ": 240,
      "къа": 241,
      "кIи": 242,
      "Iуэху": 243,
      "жэ": 244,
      "псы": 245,
      "ли": 246,
      "хуей": 247,
      "лъагъу": 248,
      "ыт": 249,
      "ха": 250,
      "Iэр": 251,
      "эрэ": 252,
      "псо": 253,
      "ре": 254,
      "дыгэ": 255,
      "хэт": 256,
      "Iэм": 257,
      "Абы": 258,
      "игъэ": 259,
      "тхы": 260,
      "джы": 261,
      "куэ": 262,
      "кIа": 263,
      "плъ": 264,
      "ад": 265,
      "ты": 266,
      "ро": 267,
      "пса": 268,
      "деж": 269,
      "ув": 270,
      "Iэу": 271,
      "алэ": 272,
      "Хьэ": 273,
      "псэ": 274,
      "бгъэ": 275,
      "ти": 276,
      "тэкъым": 277,
      "нэхъы": 278,
      "хуэдэу": 279,
      "ейм": 280,
      "лы": 281,
      "ымы": 282,
      "лъэп": 283,
      "сыт": 284,
      "на": 285,
      "лI": 286,
      "гъэр": 287,
      "жащ": 288,
      "хьэр": 289,
      "къыщы": 290,
      "ла": 291,
      "пы": 292,
      "эмы": 293,
      "со": 294,
      "ет": 295,
      "куэд": 296,
      "ин": 297,
      "жу": 298,
      "гъащIэ": 299,
      "пщ": 300,
      "хуи": 301,
      "адыгэ": 302,
      "цIыкIу": 303,
      "гъа": 304,
      "жьы": 305,
      "Сэ": 306,
      "лIы": 307,
      "хуа": 308,
      "хъы": 309,
      "щхьэкIэ": 310,
      "итI": 311,
      "ор": 312,
      "Си": 313,
      "ус": 314,
      "жын": 315,
      "пщI": 316,
      "ер": 317,
      "дун": 318,
      "Ауэ": 319,
      "анэ": 320,
      "лIэ": 321,
      "Мы": 322,
      "псэу": 323,
      "къо": 324,
      "до": 325,
      "ырт": 326,
      "тIы": 327,
      "гум": 328,
      "ту": 329,
      "пщIэ": 330,
      "дзэ": 331,
      "Iащ": 332,
      "»,": 333,
      "гуры": 334,
      "же": 335,
      "ири": 336,
      "са": 337,
      "ко": 338,
      "дей": 339,
      "дз": 340,
      "зэри": 341,
      "щIэу": 342,
      "фы": 343,
      "хи": 344,
      "но": 345,
      "къыс": 346,
      "къызэры": 347,
      "щыщ": 348,
      "ен": 349,
      "гъуа": 350,
      "уна": 351,
      "къызэ": 352,
      "ныгъэ": 353,
      "щIи": 354,
      "хэри": 355,
      "згъэ": 356,
      "кIащ": 357,
      "къыщIэ": 358,
      "хъэ": 359,
      "гупсы": 360,
      "щыIэ": 361,
      "зо": 362,
      "Сыт": 363,
      "сым": 364,
      "хъун": 365,
      "эмэ": 366,
      "Къэ": 367,
      "хъуа": 368,
      "бл": 369,
      "цIэ": 370,
      "гъуэм": 371,
      "къэр": 372,
      "рат": 373,
      "зе": 374,
      "бэр": 375,
      "гъуэщI": 376,
      "зыгъэ": 377,
      "илъэ": 378,
      "хъуну": 379,
      "мыгъэ": 380,
      "ныкъуэ": 381,
      "псалъэ": 382,
      "уб": 383,
      "плъэ": 384,
      "хэлъ": 385,
      "дэу": 386,
      "та": 387,
      "щIалэ": 388,
      "по": 389,
      "ныб": 390,
      "кIын": 391,
      "кэ": 392,
      "хэмрэ": 393,
      "къыт": 394,
      "жыр": 395,
      "ным": 396,
      "кIыу": 397,
      "Нэ": 398,
      "Уэ": 399,
      "эры": 400,
      "хьа": 401,
      "тI": 402,
      "апIэ": 403,
      "гур": 404,
      "тыр": 405,
      "дэм": 406,
      "унэ": 407,
      "бзэ": 408,
      "жри": 409,
      "хьащ": 410,
      "щIэр": 411,
      "уа": 412,
      "зауэ": 413,
      "махуэ": 414,
      "пщы": 415,
      "жьым": 416,
      "егъэ": 417,
      "къри": 418,
      "Ма": 419,
      "убы": 420,
      "адэ": 421,
      "ка": 422,
      "ща": 423,
      "Къы": 424,
      "нэгъуэщI": 425,
      "лъэм": 426,
      "Ди": 427,
      "19": 428,
      "плъы": 429,
      "Ап": 430,
      "жыну": 431,
      "Гъ": 432,
      "Зы": 433,
      "ыри": 434,
      "нщ": 435,
      "зэхэ": 436,
      "къуа": 437,
      "рей": 438,
      "лъэпкъ": 439,
      "ис": 440,
      "ащэ": 441,
      "щым": 442,
      "фи": 443,
      "хуэди": 444,
      "хуе": 445,
      "хаб": 446,
      "къыз": 447,
      "ще": 448,
      "закъуэ": 449,
      "щхьэр": 450,
      "пщэ": 451,
      "тх": 452,
      "бз": 453,
      "ем": 454,
      "тым": 455,
      "гъуэр": 456,
      "псори": 457,
      "су": 458,
      "то": 459,
      "блэ": 460,
      "къыдэ": 461,
      "Сы": 462,
      "къып": 463,
      "хэми": 464,
      "ба": 465,
      "пхъу": 466,
      "апэ": 467,
      "що": 468,
      "рт": 469,
      "гугъу": 470,
      "япэ": 471,
      "Iэн": 472,
      "имы": 473,
      "три": 474,
      "ати": 475,
      "ес": 476,
      "Гу": 477,
      "лъху": 478,
      "тхылъ": 479,
      "Уи": 480,
      "арэ": 481,
      "щхь": 482,
      "хуэдиз": 483,
      "эми": 484,
      "къыхэ": 485,
      "зэман": 486,
      "иджы": 487,
      "бг": 488,
      "хъуащ": 489,
      "абыхэм": 490,
      "ль": 491,
      "ахэр": 492,
      "терат": 493,
      "Хъ": 494,
      "рагъэ": 495,
      "мо": 496,
      "па": 497,
      "лэжь": 498,
      "кIэм": 499,
      "сэр": 500,
      "хуэмы": 501,
      "Зэ": 502,
      "къэс": 503,
      "жыпIэ": 504,
      "саб": 505,
      "вэ": 506,
      "тхьэ": 507,
      "шх": 508,
      "ни": 509,
      "умы": 510,
      "щIащ": 511,
      "ныр": 512,
      "кIыр": 513,
      "хьым": 514,
      "зэп": 515,
      "зэфIэ": 516,
      "икIи": 517,
      "зыгуэр": 518,
      "тIу": 519,
      "Ды": 520,
      "дунейм": 521,
      "кум": 522,
      "атэ": 523,
      "гъы": 524,
      "ящыщ": 525,
      "Дэ": 526,
      "илъэс": 527,
      "се": 528,
      "щIын": 529,
      "хэу": 530,
      "тхьэм": 531,
      "тын": 532,
      "лъхьэ": 533,
      "бар": 534,
      "къэрал": 535,
      "аращ": 536,
      "ша": 537,
      "».": 538,
      "..": 539,
      "апхуэдэ": 540,
      "ейр": 541,
      "жьэгъу": 542,
      "анэм": 543,
      "литерат": 544,
      "дгъэ": 545,
      "зыри": 546,
      "Хэ": 547,
      "тащ": 548,
      "бий": 549,
      "ло": 550,
      "уры": 551,
      "антIэ": 552,
      "къыте": 553,
      "Iэри": 554,
      "Iуащ": 555,
      "Мэ": 556,
      "щIал": 557,
      "нур": 558,
      "мыр": 559,
      "хо": 560,
      "нэужь": 561,
      "пап": 562,
      "йо": 563,
      "хащ": 564,
      "жэм": 565,
      "шэр": 566,
      "уэрэ": 567,
      "жьыр": 568,
      "мыхъу": 569,
      "пIэм": 570,
      "гъусэ": 571,
      "езым": 572,
      "къигъэ": 573,
      "иIэ": 574,
      "пащ": 575,
      "щIо": 576,
      "усэ": 577,
      "гъуэгу": 578,
      "къызэр": 579,
      "шын": 580,
      "щымы": 581,
      "сыр": 582,
      "хуэм": 583,
      "бэрдей": 584,
      "хьэл": 585,
      "дэт": 586,
      "гъащIэм": 587,
      "сып": 588,
      "уд": 589,
      "бо": 590,
      "дэр": 591,
      "лъэр": 592,
      "цI": 593,
      "щIым": 594,
      "сэм": 595,
      "усакIуэ": 596,
      "шэу": 597,
      "Адыгэ": 598,
      "кэм": 599,
      "жым": 600,
      "щIу": 601,
      "фIыуэ": 602,
      "ягъэ": 603,
      "къызы": 604,
      "ныбжьэгъу": 605,
      "нэмы": 606,
      "хуащ": 607,
      "теу": 608,
      "пI": 609,
      "папщIэ": 610,
      "кIэр": 611,
      "ригъэ": 612,
      "щызэ": 613,
      "шу": 614,
      "щхьэм": 615,
      "ле": 616,
      "хъыбар": 617,
      "лэжьы": 618,
      "жиIащ": 619,
      "уэр": 620,
      "мащIэ": 621,
      "нал": 622,
      "За": 623,
      "ва": 624,
      "ЦIы": 625,
      "зэу": 626,
      "увы": 627,
      "унафэ": 628,
      "мур": 629,
      "щыта": 630,
      "фэм": 631,
      "Со": 632,
      "гурыIуэ": 633,
      "сын": 634,
      "нэм": 635,
      "емы": 636,
      "джыри": 637,
      "ав": 638,
      "дзы": 639,
      "анэр": 640,
      "губ": 641,
      "жауэ": 642,
      "щIэм": 643,
      "ымрэ": 644,
      "сабий": 645,
      "къыр": 646,
      "кIыну": 647,
      "гъунэ": 648,
      "иужь": 649,
      "хуейщ": 650,
      "дыдэу": 651,
      "хыу": 652,
      "шхуэм": 653,
      "хьы": 654,
      "нт": 655,
      "хъыджэ": 656,
      "тхакIуэ": 657,
      "тет": 658,
      "дыхьэ": 659,
      "убыд": 660,
      "дыдэ": 661,
      "хъур": 662,
      "Лъ": 663,
      "псом": 664,
      "узы": 665,
      "ЦIыху": 666,
      "къалэ": 667,
      "щIауэ": 668,
      "тIыс": 669,
      "едж": 670,
      "нущ": 671,
      "игу": 672,
      "езы": 673,
      "кIыж": 674,
      "щIыр": 675,
      "тхыгъэ": 676,
      "увэ": 677,
      "жыс": 678,
      "нэр": 679,
      "ист": 680,
      "Апхуэдэ": 681,
      "Iэщ": 682,
      "тIэкIу": 683,
      "Iэп": 684,
      "ани": 685,
      "Му": 686,
      "кIри": 687,
      "гуфIэ": 688,
      "хуит": 689,
      "ейуэ": 690,
      "литератур": 691,
      "Iанэ": 692,
      "Ба": 693,
      "гуп": 694,
      "къар": 695,
      "Iэмал": 696,
      "кIэлъы": 697,
      "чэ": 698,
      "слъэ": 699,
      "ныгъэм": 700,
      "зыхуэ": 701,
      "щIыхь": 702,
      "щIэныгъэ": 703,
      "фIэщ": 704,
      "дахэ": 705,
      "гуэрым": 706,
      "рыс": 707,
      "щытащ": 708,
      "апIэм": 709,
      "здэ": 710,
      "псоми": 711,
      "зу": 712,
      "Къэбэрдей": 713,
      "псэр": 714,
      "зэра": 715,
      "хъумэ": 716,
      "сп": 717,
      "убли": 718,
      "кIур": 719,
      "лым": 720,
      "гъуэт": 721,
      "нэс": 722,
      "Пэ": 723,
      "лъэныкъуэ": 724,
      "бгъэдэ": 725,
      "бзэм": 726,
      "еи": 727,
      "мрэ": 728,
      "дауэ": 729,
      "цэ": 730,
      "иджыри": 731,
      "акъым": 732,
      "дуней": 733,
      "цIэр": 734,
      "ств": 735,
      "псалъэм": 736,
      "фIэкIа": 737,
      "макъ": 738,
      "адэм": 739,
      "щыгъуэ": 740,
      "шым": 741,
      "щэху": 742,
      "еплъ": 743,
      "ЩI": 744,
      "каз": 745,
      "кIауэ": 746,
      "хьэзыр": 747,
      "нэхърэ": 748,
      "гъунэгъу": 749,
      "Iуэхур": 750,
      "уэрэд": 751,
      "мурад": 752,
      "Да": 753,
      "рым": 754,
      "Иджы": 755,
      "хэмкIэ": 756,
      "нэху": 757,
      "ахуэ": 758,
      "шыр": 759,
      "тэм": 760,
      "лъэпкъым": 761,
      "усы": 762,
      "мыхьэ": 763,
      "жщ": 764,
      "къудей": 765,
      "лъу": 766,
      "къаб": 767,
      "Зи": 768,
      "хабзэ": 769,
      "Iи": 770,
      "щхъ": 771,
      "тэр": 772,
      "Жь": 773,
      "ещхь": 774,
      "унэм": 775,
      "20": 776,
      "иу": 777,
      "псэм": 778,
      "фэр": 779,
      "?!": 780,
      "итIыр": 781,
      "щIе": 782,
      "Бо": 783,
      "хьэт": 784,
      "хъуар": 785,
      "атIэ": 786,
      "гупсысэ": 787,
      "гъуэу": 788,
      "мэхъу": 789,
      "жэу": 790,
      "ев": 791,
      "арат": 792,
      "Про": 793,
      "гугъэ": 794,
      "ск": 795,
      "ман": 796,
      "шэч": 797,
      "цIыкIум": 798,
      "он": 799,
      "хьэмэ": 800,
      "бгъу": 801,
      "хэмы": 802,
      "пIэрэ": 803,
      ").": 804,
      "ари": 805,
      "лъэIу": 806,
      "апхуэдиз": 807,
      "хьи": 808,
      "гъыр": 809,
      "бзэр": 810,
      "жан": 811,
      "хьыр": 812,
      "нэу": 813,
      "ел": 814,
      "ыны": 815,
      "жэр": 816,
      "фыну": 817,
      "жиIэ": 818,
      "кур": 819,
      "гъым": 820,
      "ащи": 821,
      "хуауэ": 822,
      "насып": 823,
      "аз": 824,
      "дэнэ": 825,
      "кIар": 826,
      "кт": 827,
      "упщI": 828,
      "ши": 829,
      "щIыхьэ": 830,
      "къуэм": 831,
      "щIэгъуэ": 832,
      "урнал": 833,
      "мыIэ": 834,
      "зэрыщыт": 835,
      "кIуа": 836,
      "би": 837,
      "жьэр": 838,
      "лъытэ": 839,
      "хъуауэ": 840,
      "фа": 841,
      "къащ": 842,
      "хын": 843,
      "лъэгъу": 844,
      "щIыпIэ": 845,
      "псым": 846,
      "Нал": 847,
      "пхъэ": 848,
      "литературэм": 849,
      "хуэу": 850,
      "итIым": 851,
      "уе": 852,
      "Тхьэм": 853,
      "апхуэдэу": 854,
      "бжы": 855,
      "зыми": 856,
      "бын": 857,
      "арт": 858,
      "лъаг": 859,
      "езыр": 860,
      "лъкъэр": 861,
      "зэи": 862,
      "щIыкIэ": 863,
      "нобэ": 864,
      "щыгъу": 865,
      "лей": 866,
      "зыте": 867,
      "ду": 868,
      "пэр": 869,
      "гъащIэр": 870,
      "къур": 871,
      "IэщIэ": 872,
      "гуэру": 873,
      "цIыхум": 874,
      "Урыс": 875,
      "къыщи": 876,
      "жьа": 877,
      "Абыхэм": 878,
      "нукъым": 879,
      "адрей": 880,
      "Алы": 881,
      "Прозэ": 882,
      "зэщIэ": 883,
      "сэбэ": 884,
      "бжэ": 885,
      "ги": 886,
      "екIуэ": 887,
      "хьу": 888,
      "Iэт": 889,
      "пэм": 890,
      "къуажэ": 891,
      "жьу": 892,
      "Мо": 893,
      "зэмы": 894,
      "Щы": 895,
      "хъан": 896,
      "нэгу": 897,
      "щащ": 898,
      "Псо": 899,
      "Бэ": 900,
      "псын": 901,
      "алэм": 902,
      "пи": 903,
      "мафIэ": 904,
      "зыб": 905,
      "жэуап": 906,
      "ншэ": 907,
      "дэрэ": 908,
      "сащ": 909,
      "чы": 910,
      "ара": 911,
      "лажьэ": 912,
      "хуаб": 913,
      "джэм": 914,
      "псту": 915,
      "къару": 916,
      "зиIэ": 917,
      "щт": 918,
      "лий": 919,
      "хуейр": 920,
      "къэзы": 921,
      "хъум": 922,
      "ыры": 923,
      "куэдрэ": 924,
      "ея": 925,
      "зэманым": 926,
      "жыг": 927,
      "гугъ": 928,
      "кIуащ": 929,
      "дызэ": 930,
      "къагъэ": 931,
      "сс": 932,
      "джэгу": 933,
      "псэлъы": 934,
      "гуфIы": 935,
      "Жы": 936,
      "Iуэхум": 937,
      "али": 938,
      "гъыу": 939,
      "хри": 940,
      "Тхьэ": 941,
      "хуигъэ": 942,
      "хъыджэбз": 943,
      "ов": 944,
      "джэр": 945,
      "жаIэ": 946,
      "нап": 947,
      "жиIэу": 948,
      "жьэу": 949,
      "хьэн": 950,
      "хуэс": 951,
      "жеIэ": 952,
      "куу": 953,
      "кIым": 954,
      "гъуазэ": 955,
      "журнал": 956,
      "бзы": 957,
      "На": 958,
      "щэн": 959,
      "хуо": 960,
      "щIалэм": 961,
      "щIар": 962,
      "хьэу": 963,
      "эрий": 964,
      "тра": 965,
      "иту": 966,
      "хьэри": 967,
      "ыщ": 968,
      "зэте": 969,
      "зан": 970,
      "къыщIэкIын": 971,
      "пхъ": 972,
      "Дун": 973,
      "псыр": 974,
      "хым": 975,
      "10": 976,
      "),": 977,
      "Щхьэ": 978,
      "Iуа": 979,
      "тэн": 980,
      "цIыкIур": 981,
      "хыр": 982,
      "сыщы": 983,
      "про": 984,
      "лъыр": 985,
      "хьауэ": 986,
      "дин": 987,
      "хауэ": 988,
      "!»": 989,
      "бдеж": 990,
      "схэм": 991,
      "пIа": 992,
      "щхьэгъу": 993,
      "цIэры": 994,
      "сурэ": 995,
      "нэхъыфI": 996,
      "шэм": 997,
      "во": 998,
      "хьын": 999,
      "жыпIэмэ": 1000,
      "мыбы": 1001,
      "ви": 1002,
      "фо": 1003,
      "зыщIэ": 1004,
      "Кав": 1005,
      "ужьы": 1006,
      "акъы": 1007,
      "дзащ": 1008,
      "гъусэу": 1009,
      "жэщ": 1010,
      "сэбэп": 1011,
      "дакъэ": 1012,
      "Хэт": 1013,
      "сэри": 1014,
      "хьэщIэ": 1015,
      "джа": 1016,
      "къуэр": 1017,
      "ира": 1018,
      "кIам": 1019,
      "Куэ": 1020,
      "жьэм": 1021,
      "Мис": 1022,
      "къыхуэ": 1023,
      "зауэм": 1024,
      "цIэрыIуэ": 1025,
      "пэу": 1026,
      "дыдэм": 1027,
      "пащты": 1028,
      "щыIэкъым": 1029,
      "цэм": 1030,
      "жмэ": 1031,
      "щIэн": 1032,
      "зыщы": 1033,
      "кIуэу": 1034,
      "къэкIуэ": 1035,
      "Ахэр": 1036,
      "дэмы": 1037,
      "об": 1038,
      "зэре": 1039,
      "щIыну": 1040,
      "Апхуэдэу": 1041,
      "ире": 1042,
      "фын": 1043,
      "къуажэм": 1044,
      "жынщ": 1045,
      "ЛIы": 1046,
      "щIагъэ": 1047,
      "хузэфIэ": 1048,
      "мкIэ": 1049,
      "пэт": 1050,
      "шхуэр": 1051,
      "пщIы": 1052,
      "иригъэ": 1053,
      "адэр": 1054,
      "атэкъым": 1055,
      "уз": 1056,
      "щыпсэу": 1057,
      "ащэм": 1058,
      "джэн": 1059,
      "ныгъэр": 1060,
      "кIуэд": 1061,
      "дежкIэ": 1062,
      "сигу": 1063,
      "хэщ": 1064,
      "лъаб": 1065,
      "гъэхэм": 1066,
      "хуагъэ": 1067,
      "дэтхэ": 1068,
      "защIэ": 1069,
      "Шэ": 1070,
      "Iыгъ": 1071,
      "бзэкIэ": 1072,
      "гъэщIэгъуэ": 1073,
      "15": 1074,
      "лъыт": 1075,
      "къызэри": 1076,
      "дза": 1077,
      "зэхи": 1078,
      "Лъэ": 1079,
      "жырт": 1080,
      "пе": 1081,
      "пщIантIэ": 1082,
      "АрщхьэкIэ": 1083,
      "Iэпы": 1084,
      "жар": 1085,
      "ыным": 1086,
      "сэн": 1087,
      "псалъэр": 1088,
      "аргуэру": 1089,
      "дамэ": 1090,
      "махуэм": 1091,
      "дзэм": 1092,
      "пхъуэ": 1093,
      "щагъэ": 1094,
      "Балъкъэр": 1095,
      "щIэгъу": 1096,
      "Iэры": 1097,
      "слъэн": 1098,
      "ахъ": 1099,
      "Илъэ": 1100,
      "мин": 1101,
      "хъунущ": 1102,
      "лъэхъэ": 1103,
      "рис": 1104,
      "дрей": 1105,
      "къра": 1106,
      "кIэры": 1107,
      "Псы": 1108,
      "жагъуэ": 1109,
      "къыща": 1110,
      "гуащIэ": 1111,
      "сат": 1112,
      "Къа": 1113,
      "лъагъуэ": 1114,
      "арэзы": 1115,
      "?»": 1116,
      "щу": 1117,
      "Ан": 1118,
      "жьащ": 1119,
      "пкъ": 1120,
      "лъагъур": 1121,
      "благъэ": 1122,
      "лъан": 1123,
      "адыгэхэм": 1124,
      "вгъэ": 1125,
      "даIуэ": 1126,
      "цIыхубз": 1127,
      "Хьэуэ": 1128,
      "хэс": 1129,
      "хуейуэ": 1130,
      "фащэ": 1131,
      "яхуэ": 1132,
      "гъуэты": 1133,
      "бэч": 1134,
      "жес": 1135,
      "ктор": 1136,
      "щыс": 1137,
      "жыхуа": 1138,
      "жиIэри": 1139,
      "псэху": 1140,
      "зэхуэ": 1141,
      "хьар": 1142,
      "апIэр": 1143,
      "Дж": 1144,
      "гупсыс": 1145,
      "Iуэтэ": 1146,
      "бэм": 1147,
      "Iар": 1148,
      "ест": 1149,
      "шхы": 1150,
      "кIуэкI": 1151,
      "зды": 1152,
      "щIэт": 1153,
      "хабзэм": 1154,
      "ншэу": 1155,
      "кхъу": 1156,
      "абэ": 1157,
      "шыпхъу": 1158,
      "уан": 1159,
      "нэхъыщхьэ": 1160,
      "Що": 1161,
      "унагъуэ": 1162,
      "нкIэ": 1163,
      "Аращ": 1164,
      "IэфI": 1165,
      "иджыпсту": 1166,
      "вет": 1167,
      "темы": 1168,
      "кIий": 1169,
      "гъэу": 1170,
      "лъыхъуэ": 1171,
      "хьэлъэ": 1172,
      "Мухьэмэ": 1173,
      "тхьэмыщ": 1174,
      "яхэт": 1175,
      "лъым": 1176,
      "щыты": 1177,
      "Тыр": 1178,
      "тIо": 1179,
      "фIу": 1180,
      "къан": 1181,
      "щIэркъым": 1182,
      "чи": 1183,
      "цIыхур": 1184,
      "къысхуэ": 1185,
      "кол": 1186,
      "теухуауэ": 1187,
      "ЩIэ": 1188,
      "сымэ": 1189,
      "шына": 1190,
      "Гъуэ": 1191,
      "Жэ": 1192,
      "дэлъху": 1193,
      "лыкъу": 1194,
      "Аслъэн": 1195,
      "акIуэм": 1196,
      "бзым": 1197,
      "узэ": 1198,
      "щыр": 1199,
      "адыг": 1200,
      "14": 1201,
      "дэс": 1202,
      "урыс": 1203,
      "азет": 1204,
      "шхэ": 1205,
      "иужькIэ": 1206,
      "лIа": 1207,
      "щIына": 1208,
      "зымы": 1209,
      "ужькIэ": 1210,
      "!..": 1211,
      "лэт": 1212,
      "зэуэ": 1213,
      "щIыгъу": 1214,
      "жыркъым": 1215,
      "ищIэ": 1216,
      "лIым": 1217,
      "гуап": 1218,
      "сымы": 1219,
      "пIащIэ": 1220,
      "13": 1221,
      "щIри": 1222,
      "мып": 1223,
      "Али": 1224,
      "зри": 1225,
      "хыну": 1226,
      "Iуащхьэм": 1227,
      "12": 1228,
      "еплъы": 1229,
      "жьхэм": 1230,
      "кIуэцI": 1231,
      "тхэ": 1232,
      "гъуэщ": 1233,
      "гуза": 1234,
      "Шы": 1235,
      "еп": 1236,
      "бза": 1237,
      "Iэдакъэ": 1238,
      "?..": 1239,
      "Но": 1240,
      "ком": 1241,
      "Борис": 1242,
      "ирагъэ": 1243,
      "лъщ": 1244,
      "рам": 1245,
      "ухуэ": 1246,
      "алым": 1247,
      "Мухьэмэд": 1248,
      "дзауэ": 1249,
      "лъандэрэ": 1250,
      "шынэ": 1251,
      "акIуэхэм": 1252,
      "Зэры": 1253,
      "ят": 1254,
      "Фы": 1255,
      "сыту": 1256,
      "фащ": 1257,
      "зэIу": 1258,
      "Iэб": 1259,
      "жьауэ": 1260,
      "хъунукъым": 1261,
      "сэу": 1262,
      "кIырт": 1263,
      "змы": 1264,
      "гузэ": 1265,
      "Куэд": 1266,
      "илъэси": 1267,
      "хъунщ": 1268,
      "псэлъэ": 1269,
      "дзэр": 1270,
      "дджы": 1271,
      "ЖьантIэ": 1272,
      "апхъэ": 1273,
      "шык": 1274,
      "пэж": 1275,
      "гъэкIэ": 1276,
      "сри": 1277,
      "дыгъу": 1278,
      "нэщхъ": 1279,
      "окъуэ": 1280,
      "эрт": 1281,
      "Ит": 1282,
      "Пса": 1283,
      "Къу": 1284,
      "нэхъыбэ": 1285,
      "лъэгъуа": 1286,
      "кIыжащ": 1287,
      "Мыр": 1288,
      "газет": 1289,
      "пол": 1290,
      "икэ": 1291,
      "гъащ": 1292,
      "жакъым": 1293,
      "ци": 1294,
      "ямы": 1295,
      "хамэ": 1296,
      "щыгъуи": 1297,
      "Алыхьым": 1298,
      "лъапIэ": 1299,
      "къуэш": 1300,
      "гушы": 1301,
      "щри": 1302,
      "къызо": 1303,
      "зэрыщы": 1304,
      "къэмы": 1305,
      "утIы": 1306,
      "куэдым": 1307,
      "тIа": 1308,
      "щтэ": 1309,
      "щIалэр": 1310,
      "нащ": 1311,
      "ру": 1312,
      "къыще": 1313,
      "цIыхухэм": 1314,
      "хъар": 1315,
      "къригъэ": 1316,
      "хыхьэ": 1317,
      "Iэрт": 1318,
      "Заур": 1319,
      "Те": 1320,
      "ещхьу": 1321,
      "зыбжа": 1322,
      "Iуат": 1323,
      "18": 1324,
      "усакIуэм": 1325,
      "ФIы": 1326,
      "занщIэу": 1327,
      "щыхъу": 1328,
      "хьэлIэ": 1329,
      "пIэр": 1330,
      "пщым": 1331,
      "къулыкъу": 1332,
      "схуэ": 1333,
      "Жан": 1334,
      "лыр": 1335,
      "щIигъэ": 1336,
      "фIи": 1337,
      "лэжьыгъэ": 1338,
      "(«": 1339,
      "щIэну": 1340,
      "жат": 1341,
      "дигъэ": 1342,
      "къап": 1343,
      "лэжьэ": 1344,
      "дунейр": 1345,
      "Налшык": 1346,
      "бгы": 1347,
      "мылъ": 1348,
      "гъур": 1349,
      "мэм": 1350,
      "Тхы": 1351,
      "мыхьэнэ": 1352,
      "алы": 1353,
      "укIы": 1354,
      "зыхэ": 1355,
      "хъуэпс": 1356,
      "Ис": 1357,
      "Ха": 1358,
      "ущы": 1359,
      "тхылъым": 1360,
      "тэмэм": 1361,
      "гушхуэ": 1362,
      "хэрщ": 1363,
      "щигъэ": 1364,
      "жкъым": 1365,
      "хе": 1366,
      "ИтIанэ": 1367,
      "пщIэр": 1368,
      "тету": 1369,
      "щхьэщы": 1370,
      "лIыхъу": 1371,
      "нар": 1372,
      "фIыцIэ": 1373,
      "хуейт": 1374,
      "кIуэну": 1375,
      "ымкIэ": 1376,
      "хъулIэ": 1377,
      "уващ": 1378,
      "шащ": 1379,
      "кIмэ": 1380,
      "Алий": 1381,
      "фIо": 1382,
      "зыбжанэ": 1383,
      "ЩIы": 1384,
      "уты": 1385,
      "хигъэ": 1386,
      "пхуэ": 1387,
      "къэхъу": 1388,
      "щэм": 1389,
      "фу": 1390,
      "щыхьэт": 1391,
      "Ны": 1392,
      "роман": 1393,
      "бжьы": 1394,
      "худо": 1395,
      "гуапэ": 1396,
      "кIыхь": 1397,
      "теухуа": 1398,
      "защ": 1399,
      "уащ": 1400,
      "гъуэхэр": 1401,
      "убликэм": 1402,
      "Сыту": 1403,
      "егъэдж": 1404,
      "Мур": 1405,
      "ед": 1406,
      "къре": 1407,
      "жери": 1408,
      "щхьэусы": 1409,
      "ащIэм": 1410,
      "Саб": 1411,
      "хагъэ": 1412,
      "телъы": 1413,
      "Дауэ": 1414,
      "бжэм": 1415,
      "зэрымы": 1416,
      "кIуэм": 1417,
      "фыр": 1418,
      "пэтми": 1419,
      "лъхуа": 1420,
      "нэхъри": 1421,
      "хуэдэщ": 1422,
      "хуэр": 1423,
      "щIэж": 1424,
      "рэт": 1425,
      "апщэ": 1426,
      "щIэх": 1427,
      "щIэкI": 1428,
      "дым": 1429,
      "лэм": 1430,
      "етIу": 1431,
      "теат": 1432,
      "блэмэ": 1433,
      "хар": 1434,
      "респ": 1435,
      "зригъэ": 1436,
      "Iей": 1437,
      "псор": 1438,
      "гуауэ": 1439,
      "амбо": 1440,
      "къалэм": 1441,
      "тхыдэм": 1442,
      "лъагъуу": 1443,
      "илъ": 1444,
      "аль": 1445,
      "зэрызэ": 1446,
      "пху": 1447,
      "шэрджэ": 1448,
      "цист": 1449,
      "тху": 1450,
      "нэпс": 1451,
      "фызы": 1452,
      "вым": 1453,
      "щхъуэ": 1454,
      "16": 1455,
      "литературэ": 1456,
      "вор": 1457,
      "ом": 1458,
      "хьмэ": 1459,
      "Нэхъ": 1460,
      "Ли": 1461,
      "ублицист": 1462,
      "пцI": 1463,
      "нэры": 1464,
      "упщIэ": 1465,
      "кIуэн": 1466,
      "ут": 1467,
      "лIэужьы": 1468,
      "Iауэ": 1469,
      "КIы": 1470,
      "дыр": 1471,
      "дейм": 1472,
      "зэкIэ": 1473,
      "гъуэхэм": 1474,
      "зигъэ": 1475,
      "жам": 1476,
      "ствен": 1477,
      "хэту": 1478,
      "уэри": 1479,
      "щыгъуазэ": 1480,
      "ури": 1481,
      "къыб": 1482,
      "пщIантIэм": 1483,
      "вы": 1484,
      "хьыну": 1485,
      "хьэлI": 1486,
      "къегъэ": 1487,
      "щIыб": 1488,
      "пэщIэ": 1489,
      "джэу": 1490,
      "сыкъэ": 1491,
      "итIанэ": 1492,
      "мар": 1493,
      "щIат": 1494,
      "къыщIо": 1495,
      "къалэн": 1496,
      "Щоджэн": 1497,
      "тэдж": 1498,
      "дэкIэ": 1499,
      "лъащ": 1500,
      "зэпы": 1501,
      "ник": 1502,
      "ящыщщ": 1503,
      "тер": 1504,
      "Пщы": 1505,
      "Хъы": 1506,
      "ейщ": 1507,
      "мыгъуэ": 1508,
      "ствэм": 1509,
      "къыхи": 1510,
      "зэгъэ": 1511,
      "мэкъу": 1512,
      "льт": 1513,
      "Сэри": 1514,
      "логи": 1515,
      "къыд": 1516,
      "псынщIэу": 1517,
      "имыIэу": 1518,
      "адэкIэ": 1519,
      "щыIэщ": 1520,
      "зэхэс": 1521,
      "арти": 1522,
      "зэригъэ": 1523,
      "дыхьэшх": 1524,
      "дыгъэ": 1525,
      "Дэнэ": 1526,
      "сэрэ": 1527,
      "ух": 1528,
      "тепсэлъы": 1529,
      "дэтхэнэ": 1530,
      "къыу": 1531,
      "хъунур": 1532,
      "Зауэ": 1533,
      "къыфIэ": 1534,
      "жыхуи": 1535,
      "Ин": 1536,
      "лъэгъуащ": 1537,
      "Пэжщ": 1538,
      "дэIэпы": 1539,
      "Шэр": 1540,
      "лэжьакIуэ": 1541,
      "цIэм": 1542,
      "дам": 1543,
      "ейт": 1544,
      "щIигъу": 1545,
      "тIысхьэ": 1546,
      "бэлы": 1547,
      "хукIэ": 1548,
      "дыщэ": 1549,
      "нэхъыб": 1550,
      "хэлъу": 1551,
      "мис": 1552,
      "жаIэу": 1553,
      "тетым": 1554,
      "Зэм": 1555,
      "ек": 1556,
      "тар": 1557,
      "унафэщI": 1558,
      "чес": 1559,
      "хэкум": 1560,
      "жыIэ": 1561,
      "къыхуи": 1562,
      "Аб": 1563,
      "япэу": 1564,
      "кIуэр": 1565,
      "хъуам": 1566,
      "Къэр": 1567,
      "увыIэ": 1568,
      "Илъэс": 1569,
      "Уа": 1570,
      "иро": 1571,
      "лъэгъуэ": 1572,
      "Фи": 1573,
      ".,": 1574,
      "кхъуэ": 1575,
      "лъэпкъыр": 1576,
      "гъуэгум": 1577,
      "пэкIэ": 1578,
      "урысы": 1579,
      "пцIы": 1580,
      "къыщIы": 1581,
      "Нэхъы": 1582,
      "зыху": 1583,
      "джэрий": 1584,
      "лъэныкъуэкIэ": 1585,
      "аным": 1586,
      "бла": 1587,
      "НэгъуэщI": 1588,
      "лъагъум": 1589,
      "Ку": 1590,
      "къыIу": 1591,
      "Кавказ": 1592,
      "дэн": 1593,
      "Iакъым": 1594,
      "Къамбо": 1595,
      "Iам": 1596,
      "сфIэ": 1597,
      "зыкъо": 1598,
      "къыху": 1599,
      "апхуэдизкIэ": 1600,
      "Iуфэм": 1601,
      "До": 1602,
      "Уэр": 1603,
      "бзыр": 1604,
      "закъуэу": 1605,
      "хъуат": 1606,
      "ыныр": 1607,
      "гъэмрэ": 1608,
      "гуэрхэр": 1609,
      "мыхъумэ": 1610,
      "АтIэ": 1611,
      "зыхьэ": 1612,
      "ублицистикэ": 1613,
      "дэри": 1614,
      "фIэкI": 1615,
      "фыз": 1616,
      "ыра": 1617,
      "Iыс": 1618,
      "акIуэр": 1619,
      "сызы": 1620,
      "реда": 1621,
      "къэралым": 1622,
      "чэн": 1623,
      "Iэджэ": 1624,
      "гущIэгъу": 1625,
      "зэхуа": 1626,
      "загъэ": 1627,
      "дагъэ": 1628,
      "къахэ": 1629,
      "нэхъыжь": 1630,
      "фIащ": 1631,
      "зыры": 1632,
      "ир": 1633,
      "Сабий": 1634,
      "НтIэ": 1635,
      "Ро": 1636,
      "пщIа": 1637,
      "нарт": 1638,
      "Гъуэгу": 1639,
      "гурымы": 1640,
      "сурэт": 1641,
      "хыж": 1642,
      "зыщ": 1643,
      "лIэщIы": 1644,
      "пащхьэ": 1645,
      "уIэ": 1646,
      "фэн": 1647,
      "теплъэ": 1648,
      "Хьэм": 1649,
      "хъарзы": 1650,
      "плI": 1651,
      "акIуэу": 1652,
      "Ху": 1653,
      "щып": 1654,
      "кIуэды": 1655,
      "макъыр": 1656,
      "00": 1657,
      "къыщо": 1658,
      "щIэмы": 1659,
      "кIыпIэ": 1660,
      "ТIэ": 1661,
      "ген": 1662,
      "фIа": 1663,
      "пщIэн": 1664,
      "къыдо": 1665,
      "Iыгъыу": 1666,
      "По": 1667,
      "То": 1668,
      "сызэры": 1669,
      "Iэщэ": 1670,
      "хъуу": 1671,
      "щIэс": 1672,
      "дызэры": 1673,
      "уэрам": 1674,
      "Iуащхьэмахуэ": 1675,
      "ежьэ": 1676,
      "зыхи": 1677,
      "мэс": 1678,
      "ува": 1679,
      "лам": 1680,
      "щIам": 1681,
      "щIэдзауэ": 1682,
      "дауи": 1683,
      "псалъэхэр": 1684,
      "дащ": 1685,
      "ящ": 1686,
      "Хьэж": 1687,
      "тен": 1688,
      "лIыжь": 1689,
      "пщыхьэ": 1690,
      "ЩIалэ": 1691,
      "Урысейм": 1692,
      "твор": 1693,
      "кIакъым": 1694,
      "гъкIэ": 1695,
      "мывэ": 1696,
      "СС": 1697,
      "пшы": 1698,
      "хутэ": 1699,
      "жыжьэ": 1700,
      "хуейкъым": 1701,
      "фар": 1702,
      "гъэри": 1703,
      "къызыхэ": 1704,
      "сэрей": 1705,
      "къэралы": 1706,
      "къэбэрдей": 1707,
      "зэт": 1708,
      "Iуэры": 1709,
      "напэ": 1710,
      "рейм": 1711,
      "Къуэ": 1712,
      "абыкIэ": 1713,
      "Джэ": 1714,
      "17": 1715,
      "ститу": 1716,
      "хам": 1717,
      "Алим": 1718,
      "нэкIу": 1719,
      "лъэн": 1720,
      "жынущ": 1721,
      "сатыр": 1722,
      "нум": 1723,
      "сыма": 1724,
      "щIэрт": 1725,
      "гупым": 1726,
      "гъат": 1727,
      "ягу": 1728,
      "ынущ": 1729,
      "цIыхухэр": 1730,
      "хэлъщ": 1731,
      "Шэрджэ": 1732,
      "кс": 1733,
      "яу": 1734,
      "къимы": 1735,
      "зыгуэрым": 1736,
      "гуащэ": 1737,
      "Гуащэ": 1738,
      "дри": 1739,
      "ынщ": 1740,
      "щхьэхуэ": 1741,
      "щIэрэ": 1742,
      "куэдкIэ": 1743,
      "нэгум": 1744,
      "бей": 1745,
      "тIэу": 1746,
      "ныбжь": 1747,
      "Къамбот": 1748,
      "Ус": 1749,
      "пл": 1750,
      "IэщIа": 1751,
      "Iум": 1752,
      "Публицистикэ": 1753,
      "къэп": 1754,
      "Iыхьэ": 1755,
      "фIыщIэ": 1756,
      "ину": 1757,
      "кIэрэ": 1758,
      "зыIу": 1759,
      "зэрагъэ": 1760,
      "лъэхъэнэм": 1761,
      "хьам": 1762,
      "къэна": 1763,
      "кIуар": 1764,
      "бгыры": 1765,
      "Усы": 1766,
      "ащэр": 1767,
      "ырщ": 1768,
      "Iуэу": 1769,
      "хэтщ": 1770,
      "жествен": 1771,
      "мым": 1772,
      "нэщ": 1773,
      "Нобэ": 1774,
      "сте": 1775,
      "къыщIи": 1776,
      "го": 1777,
      "къутэ": 1778,
      "быд": 1779,
      "лъап": 1780,
      "гъэн": 1781,
      "194": 1782,
      "лэжьыгъэм": 1783,
      "бжьэ": 1784,
      "обра": 1785,
      "Тем": 1786,
      "гра": 1787,
      "зауэлI": 1788,
      "жей": 1789,
      "тхьэкIу": 1790,
      "ещ": 1791,
      "жызо": 1792,
      "макIуэ": 1793,
      "Джэрий": 1794,
      "джэщ": 1795,
      "Гъэ": 1796,
      "дыдэр": 1797,
      "къамэ": 1798,
      "блэм": 1799,
      "джи": 1800,
      "КIыщо": 1801,
      "еуэ": 1802,
      "гъауэ": 1803,
      "щIэхэр": 1804,
      "кIуауэ": 1805,
      "зэран": 1806,
      "лъэщ": 1807,
      "джыр": 1808,
      "хьэры": 1809,
      "къэзыгъэ": 1810,
      "ческэ": 1811,
      "еджэ": 1812,
      "унагъуэм": 1813,
      "Псори": 1814,
      "гузэвэ": 1815,
      "иным": 1816,
      "Мари": 1817,
      "абдеж": 1818,
      "ков": 1819,
      "ии": 1820,
      "Къар": 1821,
      "щIагъуэ": 1822,
      "хуабжьу": 1823,
      "пщэдджы": 1824,
      "плъа": 1825,
      "щэр": 1826,
      "къуан": 1827,
      "нат": 1828,
      "Япэ": 1829,
      "акъыл": 1830,
      "бзи": 1831,
      "хьэлэ": 1832,
      "нут": 1833,
      "щхьэц": 1834,
      "вер": 1835,
      "бжэр": 1836,
      "Ка": 1837,
      "хъурт": 1838,
      "къэт": 1839,
      "Iэдэм": 1840,
      "сыху": 1841,
      "дахэу": 1842,
      "КIу": 1843,
      "Пщэ": 1844,
      "Тх": 1845,
      "рыр": 1846,
      "сху": 1847,
      "че": 1848,
      "къыздэ": 1849,
      "уни": 1850,
      "Iо": 1851,
      "Ел": 1852,
      "зэж": 1853,
      "ИкIи": 1854,
      "КIэ": 1855,
      "быдэ": 1856,
      "художествен": 1857,
      "кIат": 1858,
      "зон": 1859,
      "Мади": 1860,
      "фIым": 1861,
      "нэмыщI": 1862,
      "тауэ": 1863,
      "къит": 1864,
      "дыщы": 1865,
      "кла": 1866,
      "къал": 1867,
      "хьри": 1868,
      "къэу": 1869,
      "пщыкIу": 1870,
      "ищIащ": 1871,
      "Хьэсэн": 1872,
      "Псом": 1873,
      "жиIэр": 1874,
      "ки": 1875,
      "нобэр": 1876,
      "зэпыт": 1877,
      "Iэпкъ": 1878,
      "етIуанэ": 1879,
      "Фэ": 1880,
      "Мурат": 1881,
      "…»": 1882,
      "хуу": 1883,
      "щIэхэм": 1884,
      "арщхьэкIэ": 1885,
      "ЩоджэнцIыкIу": 1886,
      "теле": 1887,
      "хъуэм": 1888,
      "щIэныгъэм": 1889,
      "кэр": 1890,
      "лъагэ": 1891,
      "Кавка": 1892,
      "бу": 1893,
      "узэры": 1894,
      "сыщIэ": 1895,
      "щIэныгъэлI": 1896,
      "Мар": 1897,
      "къуи": 1898,
      "тригъэ": 1899,
      "кIыркъым": 1900,
      "екIу": 1901,
      "гъап": 1902,
      "кIэри": 1903,
      "гужь": 1904,
      "тхыгъэхэм": 1905,
      "лъхьащ": 1906,
      "пхы": 1907,
      "сыпы": 1908,
      "щымыIэу": 1909,
      "хужь": 1910,
      "къэгъэ": 1911,
      "КъБ": 1912,
      "зекIуэ": 1913,
      "тхыгъэхэр": 1914,
      "не": 1915,
      "бзылъху": 1916,
      "Ра": 1917,
      "тырку": 1918,
      "лэжьащ": 1919,
      "Мухьэ": 1920,
      "телъ": 1921,
      "Езы": 1922,
      "Къан": 1923,
      "макъым": 1924,
      "дэIу": 1925,
      "лэхьи": 1926,
      "IэдакъэщIэкI": 1927,
      "уей": 1928,
      "ращ": 1929,
      "кIэлъ": 1930,
      "къыди": 1931,
      "щыгъ": 1932,
      "тхыгъэм": 1933,
      "лIыжьым": 1934,
      "Къэбэр": 1935,
      "рыкъуэ": 1936,
      "Заказ": 1937,
      "къыщ": 1938,
      "хъуакъым": 1939,
      "къыпы": 1940,
      "ащIэр": 1941,
      "хуэмыдэу": 1942,
      "республикэм": 1943,
      "артист": 1944,
      "лъакъуэ": 1945,
      "мэз": 1946,
      "хабзэр": 1947,
      "дзыхь": 1948,
      "щIыгъуу": 1949,
      "Iэты": 1950,
      "щымыт": 1951,
      "Совет": 1952,
      "гуапэу": 1953,
      "КIуэ": 1954,
      "уо": 1955,
      "рити": 1956,
      "щIакъым": 1957,
      "хуащI": 1958,
      "хъуре": 1959,
      "иIэу": 1960,
      "шей": 1961,
      "лIыгъэ": 1962,
      "къытри": 1963,
      "ран": 1964,
      "гъэщIэгъуэн": 1965,
      "жрэ": 1966,
      "мам": 1967,
      "фило": 1968,
      "яIэ": 1969,
      "кIэу": 1970,
      "джащ": 1971,
      "Махуэ": 1972,
      "зэрыт": 1973,
      "къыщIэкIынщ": 1974,
      "Ва": 1975,
      "кхъухь": 1976,
      "лю": 1977,
      "пэщы": 1978,
      "къиу": 1979,
      "пIы": 1980,
      "мыщIэ": 1981,
      "мащIэу": 1982,
      "нэкIэ": 1983,
      "жыла": 1984,
      "ящыщу": 1985,
      "Балъкъэрым": 1986,
      "лъэу": 1987,
      "фIэу": 1988,
      "бийм": 1989,
      "щхьэгъусэ": 1990,
      "плъэу": 1991,
      "иIэщ": 1992,
      "сщIэ": 1993,
      "Бет": 1994,
      "Хуэ": 1995,
      "цер": 1996,
      "хуар": 1997,
      "щытар": 1998,
      "пшэ": 1999,
      "тал": 2000,
      "хэмыт": 2001,
      "хыжащ": 2002,
      "пащтыхьым": 2003,
      "Мадинэ": 2004,
      "фэу": 2005,
      "щапхъэ": 2006,
      "Iуатэ": 2007,
      "цIыкIухэр": 2008,
      "художественнэ": 2009,
      "мыIэу": 2010,
      "дакъи": 2011,
      "уеблэмэ": 2012,
      "къыхо": 2013,
      "зэхэт": 2014,
      "хъуркъым": 2015,
      "щаб": 2016,
      "эн": 2017,
      "200": 2018,
      "Нэху": 2019,
      "ыгъэ": 2020,
      "199": 2021,
      "Лъа": 2022,
      "Адыг": 2023,
      "Тыркум": 2024,
      "Iыхь": 2025,
      "къызэра": 2026,
      "щIапIэ": 2027,
      "щхъу": 2028,
      "мэр": 2029,
      "шэн": 2030,
      "лъхьа": 2031,
      "зыкIи": 2032,
      "илъагъу": 2033,
      "уигу": 2034,
      "къытхуэ": 2035,
      "ато": 2036,
      "гъазэ": 2037,
      "щауэ": 2038,
      "джылы": 2039,
      "195": 2040,
      "Бэч": 2041,
      "щIрэ": 2042,
      "псэкIэ": 2043,
      "шхын": 2044,
      "акъ": 2045,
      "яуэ": 2046,
      "лътI": 2047,
      "гъуэгуры": 2048,
      "кIыжа": 2049,
      "лIащ": 2050,
      "Лэ": 2051,
      "уш": 2052,
      "хэку": 2053,
      "даха": 2054,
      "шэры": 2055,
      "гуа": 2056,
      "мыбдеж": 2057,
      "Мыбы": 2058,
      "гузавэ": 2059,
      "Усыгъэ": 2060,
      "лъи": 2061,
      "текIуэ": 2062,
      "кIыурэ": 2063,
      "Iуэхугъуэ": 2064,
      "бгъэды": 2065,
      "ахъшэ": 2066,
      "удз": 2067,
      "Iэмэ": 2068,
      "къыщIэкIащ": 2069,
      "икъу": 2070,
      "ххэ": 2071,
      "плъагъу": 2072,
      "пэмы": 2073,
      "Iэзэ": 2074,
      "теты": 2075,
      "апхъ": 2076,
      "лажьэр": 2077,
      "хутыр": 2078,
      "къэзгъэ": 2079,
      "бакъуэ": 2080,
      "Бы": 2081,
      "лу": 2082,
      "зэха": 2083,
      "хъунт": 2084,
      "гъуи": 2085,
      "мел": 2086,
      "кIкIэ": 2087,
      "дахэр": 2088,
      "пща": 2089,
      "нэмыцэ": 2090,
      "здэщы": 2091,
      "апхуэдизу": 2092,
      "жал": 2093,
      "гъупщэ": 2094,
      "кIэлъыплъ": 2095,
      "щIыналъэм": 2096,
      "лъагъуныгъэ": 2097,
      "гушыIэ": 2098,
      "тэу": 2099,
      "кIуэкIа": 2100,
      "фе": 2101,
      "щIырт": 2102,
      "пщыр": 2103,
      "Шу": 2104,
      "пь": 2105,
      "гъэрэ": 2106,
      "жьхэр": 2107,
      "сытми": 2108,
      "зонкэ": 2109,
      "Къэбэрдейм": 2110,
      "хур": 2111,
      "лъэпкъхэм": 2112,
      "зэгу": 2113,
      "гъуэта": 2114,
      "ама": 2115,
      "ЕтIу": 2116,
      "жкIэ": 2117,
      "нэхэр": 2118,
      "мэн": 2119,
      "урэм": 2120,
      "щIыпIэм": 2121,
      "дахэм": 2122,
      "лъабжьэ": 2123,
      "бгъэр": 2124,
      "ами": 2125,
      "сам": 2126,
      "быдэу": 2127,
      "пщIащ": 2128,
      "дапщэ": 2129,
      "хуэдэт": 2130,
      "хьэлIэу": 2131,
      "хэмылъу": 2132,
      "пар": 2133,
      "институ": 2134,
      "так": 2135,
      "журналым": 2136,
      "Би": 2137,
      "жыным": 2138,
      "хьэлэмэ": 2139,
      "гы": 2140,
      "пх": 2141,
      "къабзэ": 2142,
      "щхьэусыгъуэ": 2143,
      "зит": 2144,
      "кым": 2145,
      "кIуэт": 2146,
      "жриIащ": 2147,
      "Су": 2148,
      "гъи": 2149,
      "хуэмыдэ": 2150,
      "еры": 2151,
      "ныбжьы": 2152,
      "Моск": 2153,
      "тес": 2154,
      "Къе": 2155,
      "Хэку": 2156,
      "кIэщI": 2157,
      "хъури": 2158,
      "абзэ": 2159,
      "къысхуи": 2160,
      "бзу": 2161,
      "Ари": 2162,
      "из": 2163,
      "шин": 2164,
      "уэс": 2165,
      "кърагъэ": 2166,
      "зимыIэ": 2167,
      "усэм": 2168,
      "хьырт": 2169,
      "нкъым": 2170,
      "цы": 2171,
      "гъуащ": 2172,
      "тегъэ": 2173,
      "ант": 2174,
      "усхьэн": 2175,
      "тре": 2176,
      "хъурэ": 2177,
      "хыурэ": 2178,
      "дэIэпыкъу": 2179,
      "дар": 2180,
      "хакъым": 2181,
      "Дахэ": 2182,
      ".)": 2183,
      "ент": 2184,
      "уар": 2185,
      "кон": 2186,
      "сыхьэ": 2187,
      "Зым": 2188,
      "уэу": 2189,
      "лIыр": 2190,
      "гурыIуащ": 2191,
      "къудейуэ": 2192,
      "мэт": 2193,
      "нэхъей": 2194,
      "мэзым": 2195,
      "Iущ": 2196,
      "тIысы": 2197,
      "щIэлъ": 2198,
      "пэшым": 2199,
      "Хьэми": 2200,
      "щIыкI": 2201,
      "пов": 2202,
      "щIагъым": 2203,
      "зыхуей": 2204,
      "Уэрэ": 2205,
      "щэу": 2206,
      "гъакIуэ": 2207,
      "дэлъ": 2208,
      "хэти": 2209,
      "Кавказым": 2210,
      "Ко": 2211,
      "хуэмурэ": 2212,
      "фIэфI": 2213,
      "дежи": 2214,
      "Iуры": 2215,
      "гъуэлъы": 2216,
      "гъуэтын": 2217,
      "хъыджэбзым": 2218,
      "Iэну": 2219,
      "убыды": 2220,
      "генер": 2221,
      "196": 2222,
      "гугъуе": 2223,
      "тхакIуэм": 2224,
      "упщIащ": 2225,
      "Дуней": 2226,
      "Ахьмэ": 2227,
      "тэкъэ": 2228,
      "япэкIэ": 2229,
      "Москва": 2230,
      "яхэ": 2231,
      "лъытэр": 2232,
      "тэкъыми": 2233,
      "Псалъэм": 2234,
      "тэмэму": 2235,
      "яху": 2236,
      "плъащ": 2237,
      "лъит": 2238,
      "къыпхуэ": 2239,
      "Хъун": 2240,
      "Мэз": 2241,
      "ИтI": 2242,
      "лъэмы": 2243,
      "дихьэ": 2244,
      "тхылъыр": 2245,
      "скэ": 2246,
      "фэеплъ": 2247,
      "бжь": 2248,
      "хъуэр": 2249,
      "сауэ": 2250,
      "хьэлIа": 2251,
      "щхьэгъусэм": 2252,
      "нет": 2253,
      "зэгуэ": 2254,
      "шэрджэс": 2255,
      "Iал": 2256,
      "убыдэу": 2257,
      "къызди": 2258,
      "вэу": 2259,
      "хьат": 2260,
      "Хъан": 2261,
      "Мэр": 2262,
      "Арати": 2263,
      "тынш": 2264,
      "ехъулIэ": 2265,
      "ери": 2266,
      "IутIы": 2267,
      "культ": 2268,
      "гулъытэ": 2269,
      "адрейм": 2270,
      "щэнхабзэм": 2271,
      "Та": 2272,
      "газетым": 2273,
      "театрым": 2274,
      "верси": 2275,
      "бгъэм": 2276,
      "пшын": 2277,
      "хьэж": 2278,
      "Дауи": 2279,
      "ссказ": 2280,
      "жынур": 2281,
      "Сэр": 2282,
      "Хьэмид": 2283,
      "лэр": 2284,
      "зэрыхуэ": 2285,
      "нэхъыщхьэр": 2286,
      "зехьэ": 2287,
      "кIынущ": 2288,
      "Iут": 2289,
      "нов": 2290,
      "стэ": 2291,
      "лъэпкъэ": 2292,
      "егъэджакIуэ": 2293,
      "Адэ": 2294,
