{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 1,
      "content": "[PAD]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "[UNK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "[CLS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 4,
      "content": "[SEP]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 5,
      "content": "[MASK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 6,
      "content": "жь",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 7,
      "content": "ку",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 8,
      "content": "кӀ",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 9,
      "content": "кIу",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 10,
      "content": "къ",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 11,
      "content": "къу",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 12,
      "content": "кхъ",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 13,
      "content": "кхъу",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 14,
      "content": "лъ",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 15,
      "content": "лI",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 16,
      "content": "пI",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 17,
      "content": "тI",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 18,
      "content": "фI",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 19,
      "content": "ху",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 20,
      "content": "хь",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 21,
      "content": "хъ",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 22,
      "content": "хъу",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 23,
      "content": "цI",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 24,
      "content": "щI",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 25,
      "content": "Ӏу",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 26,
      "content": "хуэ",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    }
  ],
  "normalizer": null,
  "pre_tokenizer": null,
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "Unigram",
    "unk_id": 0,
    "vocab": [
      [
        "UNK",
        0.0
      ],
      [
        "[PAD]",
        0.0
      ],
      [
        "[UNK]",
        0.0
      ],
      [
        "[CLS]",
        0.0
      ],
      [
        "[SEP]",
        0.0
      ],
      [
        "[MASK]",
        0.0
      ],
      [
        "\n",
        -1.4544492842917922
      ],
      [
        "у",
        -3.466733756594728
      ],
      [
        "т",
        -4.226692712623333
      ],
      [
        "щ",
        -4.250061350937628
      ],
      [
        "и",
        -4.252382995668954
      ],
      [
        "р",
        -4.448011661826865
      ],
      [
        "ри",
        -4.475317202931885
      ],
      [
        "м",
        -4.659965157934792
      ],
      [
        "зы",
        -4.910360496428778
      ],
      [
        "рэ",
        -4.933792344869342
      ],
      [
        "кIэ",
        -4.992656475070643
      ],
      [
        "сы",
        -5.08051557435893
      ],
      [
        "мэ",
        -5.147840646152854
      ],
      [
        "с",
        -5.206174921775046
      ],
      [
        "-",
        -5.325170105056564
      ],
      [
        "зэры",
        -5.3561944676793285
      ],
      [
        "щы",
        -5.381584202801175
      ],
      [
        "ми",
        -5.386044578989784
      ],
      [
        "я",
        -5.431584217309091
      ],
      [
        "хэр",
        -5.452390544591765
      ],
      [
        "къы",
        -5.472028162596878
      ],
      [
        "хэм",
        -5.472566424855865
      ],
      [
        "мы",
        -5.482525873298325
      ],
      [
        "ды",
        -5.487672649208266
      ],
      [
        "а",
        -5.509569362803438
      ],
      [
        "ыр",
        -5.5212510790124085
      ],
      [
        "н",
        -5.535086939283007
      ],
      [
        "зэ",
        -5.5482521247512935
      ],
      [
        "ым",
        -5.659182298780424
      ],
      [
        "…",
        -5.663759060237741
      ],
      [
        "е",
        -5.678492872414603
      ],
      [
        "п",
        -5.686470001062016
      ],
      [
        "уэ",
        -5.779256340199371
      ],
      [
        "ху",
        -5.8236558415787645
      ],
      [
        "щIэ",
        -5.836195149314076
      ],
      [
        "къа",
        -5.890734244271462
      ],
      [
        "нэ",
        -5.897555299704953
      ],
      [
        "къэ",
        -5.89782375795583
      ],
      [
        "ащ",
        -5.902947705718486
      ],
      [
        "гъэ",
        -5.935725951908632
      ],
      [
        "д",
        -5.9835999521248855
      ],
      [
        "къым",
        -6.0247485420405855
      ],
      [
        "хэ",
        -6.041639532849521
      ],
      [
        "щи",
        -6.068053601186422
      ],
      [
        "Iу",
        -6.082621580646675
      ],
      [
        "хуэ",
        -6.113237087462133
      ],
      [
        "ф",
        -6.11874556475726
      ],
      [
        "дэ",
        -6.1585707105661704
      ],
      [
        "э",
        -6.165009626184601
      ],
      [
        "къи",
        -6.178441162937325
      ],
      [
        "ауэ",
        -6.1903031481632365
      ],
      [
        "ар",
        -6.203250286329208
      ],
      [
        "з",
        -6.239173618744793
      ],
      [
        "У",
        -6.246053120166023
      ],
      [
        "Iэ",
        -6.286950087994162
      ],
      [
        "рт",
        -6.324906244210123
      ],
      [
        "б",
        -6.335733869952271
      ],
      [
        "урэ",
        -6.357567676214838
      ],
      [
        "хьэ",
        -6.395299651148671
      ],
      [
        "щIы",
        -6.433730544434219
      ],
      [
        "ти",
        -6.452640477954434
      ],
      [
        "да",
        -6.459719866039453
      ],
      [
        "Сы",
        -6.460207694955807
      ],
      [
        "ж",
        -6.4622240688021115
      ],
      [
        "къе",
        -6.506263865495798
      ],
      [
        "къыщы",
        -6.507738697403923
      ],
      [
        "гу",
        -6.536029009097339
      ],
      [
        "фы",
        -6.537574781971935
      ],
      [
        "в",
        -6.539336267504805
      ],
      [
        "са",
        -6.561497776060814
      ],
      [
        "х",
        -6.578122491599464
      ],
      [
        "ну",
        -6.616670500357788
      ],
      [
        "къызэры",
        -6.625533947961821
      ],
      [
        "лъэ",
        -6.626003970636274
      ],
      [
        "ыну",
        -6.626418170539948
      ],
      [
        "щIа",
        -6.631570685398339
      ],
      [
        "мрэ",
        -6.655074228479211
      ],
      [
        "за",
        -6.673283779781406
      ],
      [
        "ра",
        -6.677317739182153
      ],
      [
        "пэ",
        -6.677629965681933
      ],
      [
        "шэ",
        -6.704535213983143
      ],
      [
        "ди",
        -6.713580429375102
      ],
      [
        "ын",
        -6.740455181375434
      ],
      [
        "те",
        -6.742024866982858
      ],
      [
        "хъу",
        -6.745740937211768
      ],
      [
        "ш",
        -6.762227197787838
      ],
      [
        "хэри",
        -6.805568467779193
      ],
      [
        "бгъэ",
        -6.805740638064585
      ],
      [
        "л",
        -6.807369907161883
      ],
      [
        "на",
        -6.819865337437251
      ],
      [
        "гъу",
        -6.844609557059475
      ],
      [
        "хэмрэ",
        -6.8716759404386
      ],
      [
        "кIуэ",
        -6.8792598865258165
      ],
      [
        "щхьэ",
        -6.889263177897335
      ],
      [
        "ща",
        -6.921374897541641
      ],
      [
        "фIэ",
        -6.925804875813592
      ],
      [
        "кIи",
        -6.926921449032017
      ],
      [
        "акъым",
        -6.9289518632692735
      ],
      [
        "фэ",
        -6.941802521171058
      ],
      [
        "къыс",
        -6.94863693235336
      ],
      [
        "к",
        -6.949742818611508
      ],
      [
        "ырт",
        -6.950288296823011
      ],
      [
        "къу",
        -6.9550247654498945
      ],
      [
        "ам",
        -6.959054947515392
      ],
      [
        "Къы",
        -6.9630602594227735
      ],
      [
        "къызэ",
        -6.96355384669431
      ],
      [
        "игъэ",
        -6.964865220091785
      ],
      [
        "къуэ",
        -6.978219805076301
      ],
      [
        "ат",
        -6.986619354482589
      ],
      [
        "зи",
        -7.008196228821283
      ],
      [
        "ры",
        -7.010925377092893
      ],
      [
        "П",
        -7.014456687363665
      ],
      [
        "С",
        -7.0189683789067
      ],
      [
        "Зы",
        -7.023797444073962
      ],
      [
        "ха",
        -7.0309489485286525
      ],
      [
        "до",
        -7.032025030486956
      ],
      [
        "тэкъым",
        -7.0531819084635625
      ],
      [
        "кI",
        -7.065851827326386
      ],
      [
        "лъ",
        -7.066456041354325
      ],
      [
        "жь",
        -7.067736425678469
      ],
      [
        "ркъым",
        -7.068358243491496
      ],
      [
        "дзэ",
        -7.072072543363901
      ],
      [
        "де",
        -7.075379093269749
      ],
      [
        "Зэ",
        -7.078844963227491
      ],
      [
        "уа",
        -7.087993263487104
      ],
      [
        "къып",
        -7.091671942172603
      ],
      [
        "щI",
        -7.094446310253057
      ],
      [
        "мкIэ",
        -7.100844534543361
      ],
      [
        "сэ",
        -7.108138669783203
      ],
      [
        "лэ",
        -7.119766593683005
      ],
      [
        "А",
        -7.120153697846072
      ],
      [
        "гъуэ",
        -7.126460394205434
      ],
      [
        "зэра",
        -7.1354893321377055
      ],
      [
        "згъэ",
        -7.135942831138988
      ],
      [
        "пIэ",
        -7.13722951531092
      ],
      [
        "къыт",
        -7.137366822033515
      ],
      [
        "лъагъу",
        -7.141829219080939
      ],
      [
        "И",
        -7.14527354515211
      ],
      [
        "зыгъэ",
        -7.149235076463939
      ],
      [
        "ны",
        -7.150536542972406
      ],
      [
        "хь",
        -7.184228049723113
      ],
      [
        "шы",
        -7.186775744587344
      ],
      [
        "бэ",
        -7.194455631386447
      ],
      [
        "Ды",
        -7.196536808285095
      ],
      [
        "Е",
        -7.197829939789611
      ],
      [
        "хуа",
        -7.2092917985146165
      ],
      [
        "къыдэ",
        -7.211584716619472
      ],
      [
        "щIи",
        -7.2237986172544195
      ],
      [
        "ыж",
        -7.230797604118218
      ],
      [
        "си",
        -7.244081359296263
      ],
      [
        "къо",
        -7.244901816082454
      ],
      [
        "жа",
        -7.253876501844372
      ],
      [
        "къ",
        -7.265682462112596
      ],
      [
        "ре",
        -7.267510555036949
      ],
      [
        "ч",
        -7.271115844239579
      ],
      [
        ".",
        -7.287863058270444
      ],
      [
        "хэми",
        -7.293949625979022
      ],
      [
        "къри",
        -7.300062598232553
      ],
      [
        "Хьэ",
        -7.3091190907515795
      ],
      [
        "ро",
        -7.315632729614332
      ],
      [
        "ы",
        -7.330894659979092
      ],
      [
        "зэри",
        -7.332036964060685
      ],
      [
        "жэ",
        -7.354442125293644
      ],
      [
        "шхуэ",
        -7.356436945683953
      ],
      [
        "фI",
        -7.35886083986792
      ],
      [
        "г",
        -7.370493487577844
      ],
      [
        "ст",
        -7.377260093396797
      ],
      [
        "плъ",
        -7.377837217840747
      ],
      [
        "ымрэ",
        -7.399833087809659
      ],
      [
        "хэу",
        -7.400519245623928
      ],
      [
        "жьэ",
        -7.40595247716825
      ],
      [
        "па",
        -7.409301341155266
      ],
      [
        "итI",
        -7.412860536190266
      ],
      [
        "джэ",
        -7.415371421399105
      ],
      [
        "кIа",
        -7.429850505695827
      ],
      [
        "къыхэ",
        -7.437154099960128
      ],
      [
        "зе",
        -7.444970681215503
      ],
      [
        "се",
        -7.446545431036929
      ],
      [
        "къыщIэ",
        -7.451074342086605
      ],
      [
        "ла",
        -7.451541222208133
      ],
      [
        "Къэ",
        -7.4611211610039945
      ],
      [
        "хи",
        -7.4663325201447215
      ],
      [
        "ша",
        -7.466439119886658
      ],
      [
        "со",
        -7.470768974279576
      ],
      [
        "мыгъэ",
        -7.473592428222042
      ],
      [
        "ей",
        -7.476245163675868
      ],
      [
        "ным",
        -7.481336921072464
      ],
      [
        "нщ",
        -7.484525632181869
      ],
      [
        "Т",
        -7.48758826835568
      ],
      [
        "нур",
        -7.489359021849634
      ],
      [
        "Б",
        -7.493957650374378
      ],
      [
        "о",
        -7.496475155280728
      ],
      [
        "ни",
        -7.512998457571645
      ],
      [
        "жащ",
        -7.5216248294421035
      ],
      [
        "жу",
        -7.530401425110575
      ],
      [
        "кIу",
        -7.531580776719646
      ],
      [
        "нущ",
        -7.535125409285026
      ],
      [
        "лъы",
        -7.541506439555537
      ],
      [
        "гъа",
        -7.5467392692461654
      ],
      [
        "пы",
        -7.552260215529828
      ],
      [
        "лы",
        -7.555526050487173
      ],
      [
        "къра",
        -7.556203305165533
      ],
      [
        "амэ",
        -7.556750954215411
      ],
      [
        "ли",
        -7.559332507048785
      ],
      [
        "хьа",
        -7.563143017755694
      ],
      [
        "цIыху",
        -7.567124438589462
      ],
      [
        "зэхэ",
        -7.568863858537735
      ],
      [
        "хэт",
        -7.569317123467776
      ],
      [
        "ира",
        -7.569805694238746
      ],
      [
        "дз",
        -7.586261958404413
      ],
      [
        "кIыу",
        -7.599181506127791
      ],
      [
        "Щы",
        -7.6003543236697855
      ],
      [
        "имы",
        -7.6141250214925345
      ],
      [
        "ами",
        -7.615354137630118
      ],
      [
        "лъа",
        -7.618132250379059
      ],
      [
        "Я",
        -7.623727964390884
      ],
      [
        "къыте",
        -7.628719765090451
      ],
      [
        "дгъэ",
        -7.644215940695115
      ],
      [
        "гъ",
        -7.65430704395496
      ],
      [
        "умы",
        -7.656068052157852
      ],
      [
        "ати",
        -7.663110363782672
      ],
      [
        "хо",
        -7.674300570182588
      ],
      [
        "зэре",
        -7.67782180257111
      ],
      [
        "егъэ",
        -7.684487499272066
      ],
      [
        "лIэ",
        -7.685711625034292
      ],
      [
        "ныр",
        -7.686088470551692
      ],
      [
        "ыркъым",
        -7.6871491575956865
      ],
      [
        "фа",
        -7.689172050184985
      ],
      [
        "ртэкъым",
        -7.696192125092302
      ],
      [
        "ба",
        -7.711649113781587
      ],
      [
        "джа",
        -7.72361613149342
      ],
      [
        "щызэ",
        -7.726842841674147
      ],
      [
        "хъуэ",
        -7.731730230913637
      ],
      [
        "хы",
        -7.733464561088559
      ],
      [
        "тIэ",
        -7.733653601878759
      ],
      [
        "гъуэт",
        -7.734099033802882
      ],
      [
        "ынущ",
        -7.737731145099965
      ],
      [
        "ращ",
        -7.744571523978143
      ],
      [
        "рти",
        -7.745039387241615
      ],
      [
        "ыу",
        -7.746210264850652
      ],
      [
        "ягъэ",
        -7.746983061004738
      ],
      [
        "дызэ",
        -7.754014568250502
      ],
      [
        "ынщ",
        -7.754047100069974
      ],
      [
        "Къа",
        -7.7543286901882515
      ],
      [
        "псэу",
        -7.761460560347952
      ],
      [
        "плъэ",
        -7.764158624577919
      ],
      [
        "Ма",
        -7.7642691312781755
      ],
      [
        "псэ",
        -7.765853079457573
      ],
      [
        "Iа",
        -7.766846487906797
      ],
      [
        "къыщи",
        -7.770074304032348
      ],
      [
        "то",
        -7.772037580542547
      ],
      [
        "хуи",
        -7.774440648277844
      ],
      [
        "рат",
        -7.778801569929432
      ],
      [
        "дза",
        -7.782640511087521
      ],
      [
        "ку",
        -7.785063356131093
      ],
      [
        "къызы",
        -7.7854563471676315
      ],
      [
        "къэзы",
        -7.799906222466795
      ],
      [
        "Iэт",
        -7.801218092905331
      ],
      [
        "кIуэт",
        -7.804276216016428
      ],
      [
        "ынур",
        -7.807480752029369
      ],
      [
        "по",
        -7.809701088086737
      ],
      [
        "хъ",
        -7.814737492812076
      ],
      [
        "пхъэ",
        -7.82463517674331
      ],
      [
        "псы",
        -7.826394690743115
      ],
      [
        "щ…",
        -7.830502063575371
      ],
      [
        "хэмкIэ",
        -7.834460082864314
      ],
      [
        "жыну",
        -7.8345572511046395
      ],
      [
        "пс",
        -7.842659660757432
      ],
      [
        "Iуэ",
        -7.844627820846144
      ],
      [
        "жын",
        -7.8453764065198905
      ],
      [
        "къэс",
        -7.848617002888848
      ],
      [
        "гуэ",
        -7.852741483513353
      ],
      [
        "пщэ",
        -7.853216691106888
      ],
      [
        "бо",
        -7.8533214194957015
      ],
      [
        "Д",
        -7.855092190548706
      ],
      [
        "жы",
        -7.857985307260613
      ],
      [
        "нукъым",
        -7.859329868961487
      ],
      [
        "-тIэ",
        -7.8634928773466815
      ],
      [
        "ыным",
        -7.864953769671139
      ],
      [
        "пи",
        -7.8687222017552685
      ],
      [
        "Гу",
        -7.869168889525519
      ],
      [
        "псалъэ",
        -7.870058532723442
      ],
      [
        "кэ",
        -7.8835029313848315
      ],
      [
        "Мы",
        -7.884784448630471
      ],
      [
        "лъхьэ",
        -7.8876841222921
      ],
      [
        "кIыж",
        -7.898031865954761
      ],
      [
        "блэ",
        -7.900980247556656
      ],
      [
        "К",
        -7.904872227464975
      ],
      [
        "ка",
        -7.906528976891396
      ],
      [
        "нт",
        -7.910032903252902
      ],
      [
        "иригъэ",
        -7.910173977108204
      ],
      [
        "ий",
        -7.910843898723189
      ],
      [
        "зэщIэ",
        -7.916367280617022
      ],
      [
        "хуэмы",
        -7.917508297322277
      ],
      [
        "хыж",
        -7.920792189277714
      ],
      [
        "сыщы",
        -7.921161039710223
      ],
      [
        "къуа",
        -7.936113847501685
      ],
      [
        "ц",
        -7.939971624820669
      ],
      [
        "щэху",
        -7.943399856997495
      ],
      [
        "жри",
        -7.944990532773131
      ],
      [
        "пщы",
        -7.945899360248778
      ],
      [
        "къигъэ",
        -7.951565344269958
      ],
      [
        "къыз",
        -7.95911403135749
      ],
      [
        "нкIэ",
        -7.9602036975759205
      ],
      [
        "ты",
        -7.9606666999909494
      ],
      [
        "къызэри",
        -7.966315609612959
      ],
      [
        "хыу",
        -7.967076551515071
      ],
      [
        "19",
        -7.972628204919026
      ],
      [
        "ин",
        -7.979836418491619
      ],
      [
        "ымкIэ",
        -7.98172361062277
      ],
      [
        "що",
        -7.987276859775573
      ],
      [
        "лI",
        -7.988793072690433
      ],
      [
        "З",
        -7.988930613329357
      ],
      [
        "пщIэ",
        -7.9891344306423235
      ],
      [
        "Зэры",
        -7.991254456261034
      ],
      [
        "вэ",
        -7.994683964669255
      ],
      [
        "щIэн",
        -7.999045991866929
      ],
      [
        "вгъэ",
        -7.999333363403045
      ],
      [
        "къыхуэ",
        -8.001712498703366
      ],
      [
        "сызэры",
        -8.005553728429868
      ],
      [
        "ле",
        -8.006575832213572
      ],
      [
        "ужь",
        -8.012344531779643
      ],
      [
        "щIэж",
        -8.013457535927804
      ],
      [
        "Нэ",
        -8.013504893439881
      ],
      [
        "бы",
        -8.015220616599107
      ],
      [
        "ыжу",
        -8.015826140245114
      ],
      [
        "хъумэ",
        -8.01737240431168
      ],
      [
        "зо",
        -8.020431297815424
      ],
      [
        "увэ",
        -8.02237266358538
      ],
      [
        "кIащ",
        -8.022932909229684
      ],
      [
        "тет",
        -8.023037160967355
      ],
      [
        "къысхуэ",
        -8.024883898560294
      ],
      [
        "ащи",
        -8.02879177737746
      ],
      [
        "дж",
        -8.030719138598293
      ],
      [
        "ышхуэ",
        -8.03336676166742
      ],
      [
        "бзэ",
        -8.039649997782229
      ],
      [
        "ыф",
        -8.039870822155184
      ],
      [
        "итIым",
        -8.044086112608671
      ],
      [
        "но",
        -8.046507826802449
      ],
      [
        "дызэры",
        -8.04736229458549
      ],
      [
        "ва",
        -8.049311271906632
      ],
      [
        "Фы",
        -8.063748550164298
      ],
      [
        "ыжащ",
        -8.069184687468125
      ],
      [
        "шх",
        -8.07339724995268
      ],
      [
        "къыд",
        -8.076058181566513
      ],
      [
        "кIыр",
        -8.079351866213482
      ],
      [
        "зыхуэ",
        -8.08305291892643
      ],
      [
        "хъуа",
        -8.086361873917344
      ],
      [
        "хуо",
        -8.08854323129506
      ],
      [
        "ыху",
        -8.094302284766531
      ],
      [
        "кIуа",
        -8.096175020184916
      ],
      [
        "ахэм",
        -8.096947143801383
      ],
      [
        "бжэ",
        -8.100453631812236
      ],
      [
        "щIе",
        -8.102995977976963
      ],
      [
        "йо",
        -8.10406009197238
      ],
      [
        "гъуа",
        -8.109283697094904
      ],
      [
        "хьэн",
        -8.10960764278828
      ],
      [
        "1",
        -8.110007443069247
      ],
      [
        "Мэ",
        -8.111642436390595
      ],
      [
        "жауэ",
        -8.111938604564
      ],
      [
        "езгъэ",
        -8.114450831246646
      ],
      [
        "ыныр",
        -8.11592568859177
      ],
      [
        "Те",
        -8.117443818610557
      ],
      [
        "фи",
        -8.12534356722382
      ],
      [
        "ль",
        -8.12601060043076
      ],
      [
        "хэщ",
        -8.13147440563335
      ],
      [
        "лэжь",
        -8.132057589609088
      ],
      [
        "ал",
        -8.136787206626297
      ],
      [
        "кIэры",
        -8.13947054482282
      ],
      [
        "лIа",
        -8.144245973212922
      ],
      [
        "во",
        -8.144486276409115
      ],
      [
        "жьа",
        -8.144541000703935
      ],
      [
        "зэте",
        -8.145978348661426
      ],
      [
        "ынукъым",
        -8.149701555144313
      ],
      [
        "къыху",
        -8.149979450098831
      ],
      [
        "агъэ",
        -8.150921902094549
      ],
      [
        "ан",
        -8.151113599369854
      ],
      [
        "тI",
        -8.154488934496781
      ],
      [
        "не",
        -8.159194247221652
      ],
      [
        "жыр",
        -8.159204131045371
      ],
      [
        "анэ",
        -8.163823031740364
      ],
      [
        "къыща",
        -8.164995109129109
      ],
      [
        "къыщIы",
        -8.165965339848064
      ],
      [
        "тра",
        -8.16768323126374
      ],
      [
        "уд",
        -8.174602461667064
      ],
      [
        "рей",
        -8.176369940776116
      ],
      [
        "ыртэкъым",
        -8.177246377513436
      ],
      [
        "ю",
        -8.178046735981704
      ],
      [
        "емы",
        -8.179025256378516
      ],
      [
        "ыжын",
        -8.179388342753057
      ],
      [
        "хьащ",
        -8.179934268452858
      ],
      [
        "ырщ",
        -8.18175590832907
      ],
      [
        "ь",
        -8.183469504669333
      ],
      [
        "–",
        -8.194653050916223
      ],
      [
        "ев",
        -8.196500285901577
      ],
      [
        "чэ",
        -8.198587729053994
      ],
      [
        "щIо",
        -8.201291256900749
      ],
      [
        "Са",
        -8.206833009428182
      ],
      [
        "гъащIэ",
        -8.210380851513875
      ],
      [
        "Э",
        -8.210388956603472
      ],
      [
        "кIыну",
        -8.212276065000399
      ],
      [
        "фIы",
        -8.216850134296859
      ],
      [
        "пщ",
        -8.219913389832916
      ],
      [
        "убыд",
        -8.221224930319604
      ],
      [
        "здэ",
        -8.221496030697717
      ],
      [
        "О",
        -8.22304891761668
      ],
      [
        "щтэ",
        -8.228415712240412
      ],
      [
        "Iуа",
        -8.229385103061457
      ],
      [
        "зэпы",
        -8.231153640213382
      ],
      [
        "лъытэ",
        -8.231832061401905
      ],
      [
        "он",
        -8.234054472355192
      ],
      [
        "тхьэ",
        -8.238166452241417
      ],
      [
        "кIын",
        -8.241187354407108
      ],
      [
        "агъ",
        -8.242266976021337
      ],
      [
        "Да",
        -8.25042280573275
      ],
      [
        "щIащ",
        -8.250571365356873
      ],
      [
        "пху",
        -8.253331553585143
      ],
      [
        "жьы",
        -8.2564255946474
      ],
      [
        "На",
        -8.260795890028064
      ],
      [
        "зэфIэ",
        -8.260818415478372
      ],
      [
        "ыжа",
        -8.264111576626235
      ],
      [
        "Iыгъ",
        -8.266397263162622
      ],
      [
        "М",
        -8.272293836571768
      ],
      [
        "зри",
        -8.272375593382428
      ],
      [
        "й",
        -8.273729374655533
      ],
      [
        "зригъэ",
        -8.276886360800113
      ],
      [
        "ыкI",
        -8.282974033350062
      ],
      [
        "итIыр",
        -8.286401033094666
      ],
      [
        "ныкъуэ",
        -8.286452457846128
      ],
      [
        "ыжь",
        -8.291460760845782
      ],
      [
        "ло",
        -8.296096720140067
      ],
      [
        "ирагъэ",
        -8.296902223794042
      ],
      [
        "щып",
        -8.297285777517981
      ],
      [
        "къэп",
        -8.299130269130588
      ],
      [
        "гупсыс",
        -8.302631614718562
      ],
      [
        "дэс",
        -8.304709279511524
      ],
      [
        "ншэ",
        -8.3083514315447
      ],
      [
        "ко",
        -8.31079074209633
      ],
      [
        "хуе",
        -8.312081634924343
      ],
      [
        "яхуэ",
        -8.315921820152159
      ],
      [
        "сыкъы",
        -8.317131294085256
      ],
      [
        "лъэIу",
        -8.31809010395693
      ],
      [
        "щIын",
        -8.319824137420552
      ],
      [
        "пе",
        -8.320629768708606
      ],
      [
        "щыс",
        -8.321286186744175
      ],
      [
        "джы",
        -8.322652318459422
      ],
      [
        "хын",
        -8.323814757225863
      ],
      [
        "цIэ",
        -8.324907741793181
      ],
      [
        "хьэж",
        -8.327040189540181
      ],
      [
        "фIи",
        -8.328444860501415
      ],
      [
        "мо",
        -8.329554523890852
      ],
      [
        "гуры",
        -8.329865126892415
      ],
      [
        "уз",
        -8.3318056885356
      ],
      [
        "дыщы",
        -8.332246678152663
      ],
      [
        "къимы",
        -8.333650182313598
      ],
      [
        "кIухь",
        -8.341016362958381
      ],
      [
        "Г",
        -8.343132632613145
      ],
      [
        "щIэну",
        -8.345969155235082
      ],
      [
        "гъэзэж",
        -8.348267501608298
      ],
      [
        "ес",
        -8.348819737007638
      ],
      [
        "щIыж",
        -8.34954640442067
      ],
      [
        "щыт",
        -8.351820051428515
      ],
      [
        "шхэ",
        -8.354865877852259
      ],
      [
        "кIэлъы",
        -8.356501340780282
      ],
      [
        "хэлъ",
        -8.360985339279242
      ],
      [
        "упщI",
        -8.36161378212741
      ],
      [
        "щIар",
        -8.364851926909848
      ],
      [
        "щхьэщы",
        -8.369434909333833
      ],
      [
        "ыгъуэ",
        -8.37597678830506
      ],
      [
        "хэс",
        -8.37838413827453
      ],
      [
        "За",
        -8.380401703027925
      ],
      [
        "лажьэ",
        -8.381984065523804
      ],
      [
        "ынкIэ",
        -8.38245576951403
      ],
      [
        "щымы",
        -8.382688596682009
      ],
      [
        "эм",
        -8.384640228055696
      ],
      [
        "укI",
        -8.391157133813662
      ],
      [
        "эр",
        -8.392261897193803
      ],
      [
        "джэгу",
        -8.395133284106183
      ],
      [
        "тх",
        -8.395756656285322
      ],
      [
        "къыще",
        -8.396866159685207
      ],
      [
        "зэхуэ",
        -8.397106698441288
      ],
      [
        "зауэ",
        -8.39804984343025
      ],
      [
        "пхы",
        -8.403033024660523
      ],
      [
        "махуэ",
        -8.405809599193017
      ],
      [
        "сри",
        -8.408047688022009
      ],
      [
        "щIэс",
        -8.411001852070687
      ],
      [
        "зэрызэ",
        -8.413238373586411
      ],
      [
        "гъэкI",
        -8.41525778157169
      ],
      [
        "Къи",
        -8.417270168413415
      ],
      [
        "схуэ",
        -8.417771022757151
      ],
      [
        "сызы",
        -8.418187453179751
      ],
      [
        "къысху",
        -8.418505372054632
      ],
      [
        "ахэр",
        -8.423348029242288
      ],
      [
        "ЩIэ",
        -8.424389783948111
      ],
      [
        "щIэмы",
        -8.426375292236143
      ],
      [
        "пхуэ",
        -8.42833704508341
      ],
      [
        "IэщIэ",
        -8.428672317327916
      ],
      [
        "ырти",
        -8.432358517428556
      ],
      [
        "Iуэху",
        -8.432758085222272
      ],
      [
        "Ш",
        -8.434267334846043
      ],
      [
        "щIыкI",
        -8.434626670073754
      ],
      [
        "атэкъым",
        -8.43534992908956
      ],
      [
        "плъыхь",
        -8.43760999901728
      ],
      [
        "къызэра",
        -8.440184043065992
      ],
      [
        "утIыпщ",
        -8.441751154526985
      ],
      [
        "лъыхъуэ",
        -8.4460772524873
      ],
      [
        "Iэры",
        -8.447885495458888
      ],
      [
        "мыщI",
        -8.449547703338997
      ],
      [
        "гъэпщкIу",
        -8.450227166358433
      ],
      [
        "ыжыну",
        -8.450236339131806
      ],
      [
        "акIуэ",
        -8.451031037326075
      ],
      [
        "Къе",
        -8.45414812225126
      ],
      [
        "цIыкIу",
        -8.454465942531575
      ],
      [
        "ире",
        -8.455260514706906
      ],
      [
        "кIауэ",
        -8.45529047291084
      ],
      [
        "къызэре",
        -8.455605193415073
      ],
      [
        "эну",
        -8.456296095247119
      ],
      [
        "хыну",
        -8.456480554699606
      ],
      [
        "Со",
        -8.457992845946798
      ],
      [
        "хьыж",
        -8.458346875928193
      ],
      [
        "гъакIуэ",
        -8.459857750674805
      ],
      [
        "темы",
        -8.467199425296268
      ],
      [
        "цэ",
        -8.467947964721635
      ],
      [
        "дри",
        -8.468076437402884
      ],
      [
        "ча",
        -8.470301702697268
      ],
      [
        "ыхь",
        -8.470966390248497
      ],
      [
        "шхуэм",
        -8.471453221815786
      ],
      [
        "шу",
        -8.472772609945563
      ],
      [
        "гъанэ",
        -8.475524261267879
      ],
      [
        "нкъым",
        -8.476161277500527
      ],
      [
        "Хэ",
        -8.478262690670721
      ],
      [
        "хе",
        -8.479393472981677
      ],
      [
        "ыпэ",
        -8.487342335899566
      ],
      [
        "Ба",
        -8.489485726462348
      ],
      [
        "къригъэ",
        -8.490167770615747
      ],
      [
        "гъуэтыж",
        -8.490456590870288
      ],
      [
        "жьым",
        -8.490457955112038
      ],
      [
        "эн",
        -8.495303874548549
      ],
      [
        "къутэ",
        -8.496249673743895
      ],
      [
        "дигъэ",
        -8.502249610667995
      ],
      [
        "тын",
        -8.50317820655524
      ],
      [
        "зыте",
        -8.504386015770134
      ],
      [
        "Къу",
        -8.50614835757035
      ],
      [
        "гъэувэ",
        -8.50788787319299
      ],
      [
        "ви",
        -8.510628692835326
      ],
      [
        "бгъу",
        -8.511743323254874
      ],
      [
        "дыгъу",
        -8.511971303310844
      ],
      [
        "хьэлIэ",
        -8.512384426162651
      ],
      [
        "ай",
        -8.51371905277576
      ],
      [
        "Къ",
        -8.513995416443205
      ],
      [
        "тIысхьэ",
        -8.514851643471614
      ],
      [
        "фIа",
        -8.516773992494624
      ],
      [
        "6",
        -8.517397052026794
      ],
      [
        "Дэ",
        -8.51779360895391
      ],
      [
        "щIауэ",
        -8.518847266741991
      ],
      [
        "кIуэж",
        -8.521619526639057
      ],
      [
        "Х",
        -8.524860457977201
      ],
      [
        "лъэф",
        -8.525424181268864
      ],
      [
        "хри",
        -8.525885040971035
      ],
      [
        "ши",
        -8.526399394753131
      ],
      [
        "унэ",
        -8.529115965340683
      ],
      [
        "лъхьа",
        -8.531885760617598
      ],
      [
        "къыпхуэ",
        -8.53193787732127
      ],
      [
        "хащ",
        -8.532290005596874
      ],
      [
        "кIри",
        -8.535255293546141
      ],
      [
        "къытхуэ",
        -8.53590216854202
      ],
      [
        "тхэ",
        -8.538935652853725
      ],
      [
        "шынэ",
        -8.539294431634588
      ],
      [
        "зигъэ",
        -8.539318862000336
      ],
      [
        "щIэр",
        -8.539913999048508
      ],
      [
        "Р",
        -8.541175638937471
      ],
      [
        "жым",
        -8.54161321650913
      ],
      [
        "ыжри",
        -8.541968314986136
      ],
      [
        "дагъэ",
        -8.54268627976012
      ],
      [
        "лъэт",
        -8.544550477019495
      ],
      [
        "мыхъу",
        -8.549969977131141
      ],
      [
        "кIар",
        -8.55198051706622
      ],
      [
        "щагъэ",
        -8.552006131917869
      ],
      [
        "шэн",
        -8.554733820689716
      ],
      [
        "хьар",
        -8.555640972067936
      ],
      [
        "Уэ",
        -8.557415433270293
      ],
      [
        "Ху",
        -8.558325928110207
      ],
      [
        "ныгъэ",
        -8.558381828611267
      ],
      [
        "бжьэ",
        -8.558775053013711
      ],
      [
        "Ка",
        -8.559670225135449
      ],
      [
        "фын",
        -8.562023155079705
      ],
      [
        "жырт",
        -8.56900982432624
      ],
      [
        "жынщ",
        -8.569052964883443
      ],
      [
        "Ар",
        -8.570255659548515
      ],
      [
        "ер",
        -8.57028492032881
      ],
      [
        "зыщы",
        -8.574285671257432
      ],
      [
        "гъэсэбэп",
        -8.574773706852266
      ],
      [
        "благъэ",
        -8.574840837944905
      ],
      [
        "ыбзэ",
        -8.577789964580662
      ],
      [
        "дзы",
        -8.578233110452068
      ],
      [
        "пцIэ",
        -8.579356205136463
      ],
      [
        "ыфI",
        -8.579617114625403
      ],
      [
        "Iи",
        -8.581577412861908
      ],
      [
        "тригъэ",
        -8.581650470353257
      ],
      [
        "жьыр",
        -8.582583536639568
      ],
      [
        "же",
        -8.584247442014945
      ],
      [
        "би",
        -8.58523878488549
      ],
      [
        "мыIэ",
        -8.586274630833675
      ],
      [
        "тес",
        -8.590318397640909
      ],
      [
        "бл",
        -8.591131192373089
      ],
      [
        "зыхэ",
        -8.591556099077895
      ],
      [
        "Шы",
        -8.592018594716652
      ],
      [
        "кIы",
        -8.596995942730402
      ],
      [
        "щIагъэ",
        -8.598357753255652
      ],
      [
        "Сэ",
        -8.600086632883393
      ],
      [
        "ыгъэ",
        -8.60115312061141
      ],
      [
        "лъадэ",
        -8.605687697640061
      ],
      [
        "зэрыщы",
        -8.606086161238128
      ],
      [
        "яху",
        -8.606334486773779
      ],
      [
        "къэз",
        -8.607462589583275
      ],
      [
        "лIы",
        -8.609464722350552
      ],
      [
        "7",
        -8.611146083110743
      ],
      [
        "къыIу",
        -8.613799434662251
      ],
      [
        "нум",
        -8.61435169757567
      ],
      [
        "Iэбэ",
        -8.614484571563828
      ],
      [
        "кърагъэ",
        -8.615917971484894
      ],
      [
        "зыщи",
        -8.618406051396702
      ],
      [
        "В",
        -8.620704241146228
      ],
      [
        "тIыс",
        -8.621175201600575
      ],
      [
        "мыкIуэ",
        -8.621246764472208
      ],
      [
        "щигъэ",
        -8.622659786743073
      ],
      [
        "лъагъун",
        -8.622940022896353
      ],
      [
        "зра",
        -8.623413040067188
      ],
      [
        "афэ",
        -8.623787596761602
      ],
      [
        "ищэ",
        -8.623851160667947
      ],
      [
        "хьауэ",
        -8.623986931053041
      ],
      [
        "хуей",
        -8.626760834331062
      ],
      [
        "къэмы",
        -8.62700526740359
      ],
      [
        "чы",
        -8.628216638250237
      ],
      [
        "ет",
        -8.632203104208926
      ],
      [
        "8",
        -8.63309613257324
      ],
      [
        "щIигъэ",
        -8.635643031382564
      ],
      [
        "къыщIи",
        -8.636042978363145
      ],
      [
        "шэж",
        -8.637029970468333
      ],
      [
        "Iуатэ",
        -8.637057812775993
      ],
      [
        "зэрымы",
        -8.638876870866206
      ],
      [
        "9",
        -8.639566712785209
      ],
      [
        "5",
        -8.639798698916746
      ],
      [
        "тэмэ",
        -8.642684387997607
      ],
      [
        "зыкъы",
        -8.642749095555967
      ],
      [
        "гуфIэ",
        -8.642776996636846
      ],
      [
        "тре",
        -8.644064359229738
      ],
      [
        "хыр",
        -8.645578180004698
      ],
      [
        "Бэ",
        -8.647547277035478
      ],
      [
        "шын",
        -8.64986631116582
      ],
      [
        "ейуэ",
        -8.652478854684393
      ],
      [
        "хъун",
        -8.653489217110335
      ],
      [
        "адэ",
        -8.654198336995282
      ],
      [
        "зыщIэ",
        -8.65501809833238
      ],
      [
        "фыну",
        -8.655561892106775
      ],
      [
        "нут",
        -8.657461016417201
      ],
      [
        "кIуэну",
        -8.660806180768567
      ],
      [
        "Ф",
        -8.663192367767737
      ],
      [
        "къэб",
        -8.664373885492331
      ],
      [
        "къызо",
        -8.664888082943307
      ],
      [
        "сху",
        -8.6651418645473
      ],
      [
        "къыди",
        -8.665709085574115
      ],
      [
        "къыб",
        -8.666336037303996
      ],
      [
        "мыщIэ",
        -8.666645602118578
      ],
      [
        "сымы",
        -8.667604940740834
      ],
      [
        "къыда",
        -8.668329337428093
      ],
      [
        "гуэш",
        -8.670525466420688
      ],
      [
        "хьи",
        -8.670866686414126
      ],
      [
        "зэригъэ",
        -8.671079171753568
      ],
      [
        "къагъэ",
        -8.671111005126475
      ],
      [
        "зды",
        -8.671511459214198
      ],
      [
        "Щхьэ",
        -8.67163886193022
      ],
      [
        "ыпIэ",
        -8.672783149296027
      ],
      [
        "жаIэ",
        -8.674486514475618
      ],
      [
        "бий",
        -8.675733444084832
      ],
      [
        "Хуэ",
        -8.6785198234012
      ],
      [
        "окъуэ",
        -8.679870266252095
      ],
      [
        "загъэ",
        -8.682231509266913
      ],
      [
        "щIыр",
        -8.683019409536914
      ],
      [
        "3",
        -8.683816144043636
      ],
      [
        "едгъэ",
        -8.690363162463747
      ],
      [
        "Се",
        -8.69056572098821
      ],
      [
        "къыхуи",
        -8.692026721378996
      ],
      [
        "сыкъэ",
        -8.69273960397219
      ],
      [
        "ник",
        -8.69495941532247
      ],
      [
        "сыкъи",
        -8.697282391028494
      ],
      [
        "хьын",
        -8.697311775648203
      ],
      [
        "хъэ",
        -8.697421190826422
      ],
      [
        "хауэ",
        -8.703214584935107
      ],
      [
        "щыIэ",
        -8.704310950079432
      ],
      [
        "тэм",
        -8.704727641548377
      ],
      [
        "ямы",
        -8.705365786722869
      ],
      [
        "нщи",
        -8.707098120686165
      ],
      [
        "ыфын",
        -8.708489388205646
      ],
      [
        "вы",
        -8.709576137950796
      ],
      [
        "ынкъым",
        -8.710650233819472
      ],
      [
        "дэкI",
        -8.711776503978205
      ],
      [
        "тэкъэ",
        -8.712853821974456
      ],
      [
        "гъауэ",
        -8.71288447179084
      ],
      [
        "дызы",
        -8.713221699933882
      ],
      [
        "пхъуэ",
        -8.714316799578318
      ],
      [
        "зыха",
        -8.714328326348483
      ],
      [
        "4",
        -8.71465619930149
      ],
      [
        "сып",
        -8.714795842115521
      ],
      [
        "зэгъ",
        -8.717436158889955
      ],
      [
        "лъхьэж",
        -8.718106208495254
      ],
      [
        "тхы",
        -8.718440250927925
      ],
      [
        "шхуэр",
        -8.718500998462204
      ],
      [
        "умыгъэ",
        -8.718978355581429
      ],
      [
        "щIыхь",
        -8.719417902128423
      ],
      [
        "зэIу",
        -8.720381636603186
      ],
      [
        "лъху",
        -8.722306516736852
      ],
      [
        "ск",
        -8.722609925674412
      ],
      [
        "Ж",
        -8.722992629450584
      ],
      [
        "Iауэ",
        -8.723342466714115
      ],
      [
        "пIа",
        -8.724399419231517
      ],
      [
        "эгъу",
        -8.724826163991075
      ],
      [
        "ейм",
        -8.726103943981661
      ],
      [
        "гупсысэ",
        -8.726545568708477
      ],
      [
        "убыда",
        -8.727038710057393
      ],
      [
        "зехьэ",
        -8.727742635282688
      ],
      [
        "ыщэ",
        -8.72819188176065
      ],
      [
        "щIэм",
        -8.728631451088383
      ],
      [
        "зэха",
        -8.729171123897085
      ],
      [
        "пхъу",
        -8.729740496457127
      ],
      [
        "ынт",
        -8.729790079388252
      ],
      [
        "имыгъэ",
        -8.729799374560777
      ],
      [
        "щIэкI",
        -8.729966487495416
      ],
      [
        "т…",
        -8.730130617063296
      ],
      [
        "Л",
        -8.731443575922306
      ],
      [
        "Хъу",
        -8.731902179607824
      ],
      [
        "къре",
        -8.735878019237242
      ],
      [
        "ыххэ",
        -8.738423797186856
      ],
      [
        "къэт",
        -8.740096163654458
      ],
      [
        "убыдэ",
        -8.740097371162726
      ],
      [
        "хутэ",
        -8.740116199061951
      ],
      [
        "къыхуа",
        -8.742470120590209
      ],
      [
        "зэтри",
        -8.743137526647551
      ],
      [
        "хыхьэ",
        -8.744299560792486
      ],
      [
        "шэч",
        -8.745825022771971
      ],
      [
        "Щ",
        -8.746031914583675
      ],
      [
        "эж",
        -8.746480060915143
      ],
      [
        "гъазэ",
        -8.747158923760281
      ],
      [
        "ншэу",
        -8.747344537485905
      ],
      [
        "ебгъэ",
        -8.747546764160827
      ],
      [
        "гъэув",
        -8.751681419776126
      ],
      [
        "хьэлIа",
        -8.753780157425798
      ],
      [
        "къуи",
        -8.753837836245186
      ],
      [
        "кIыхь",
        -8.754865144503555
      ],
      [
        "Iуры",
        -8.75526775647311
      ],
      [
        "даIуэ",
        -8.755621939794722
      ],
      [
        "зэхи",
        -8.757383887542614
      ],
      [
        "упс",
        -8.757539742900248
      ],
      [
        "хигъэ",
        -8.759475559378194
      ],
      [
        "бж",
        -8.762588905950334
      ],
      [
        "нэм",
        -8.76291363945629
      ],
      [
        "ис",
        -8.763627312701566
      ],
      [
        "къысхуи",
