from django.test import TestCase

from ocr.services.spell_check_service import SpellCheckService


class SpellCheckServiceTestCase(TestCase):
    def setUp(self):
        self.spell_check_service = SpellCheckService()

    def test_real_text(self):
        text = """
 -- Сыт сэ уи гупсысэм сыщ1ыхэтар?

 - Уэ ф1ыуэ уамылъагъунк1э 13мал макъым!

 - Хэт сызылъагъунур? Уэ сэ дэнэ сыкъыщып-
 ц1ыхурэ?

 __ Узоц1ыху... .

 - Ик1и ф1ыуэ сыкъыболъагъу?

 _ Узолъагъу, сэ схуэдэу узылъагъу щымы13у.

 - Ф13щ хъугъуейщ...

 __ Сытк1и тхьэ пхуэс[уэпщ!

 _-- Си ф1эщ хъуащ. Сэри ф1ыуэ услъэгъуащ...

 - Ф1ыуэ сыкъэплъэгъуауи?!

 - Услъэгъуащ. Сыт абы гъэщ1эгъуэну хэлъыр?
 Сэ зыри 1ейуэ схуэлъагъунукъым.

 - Ит1ани, псори зэхуэдэу ф1ыуэ плъагъуу
 къыщ1эк1ынкъым?

 __ Уэ нэхъыбэ!уэк1э услъагъуу тщ1ынщ. Аракъэ
 уэри адрейхэм нэхърэ нэхъ сыкъыщ1илъэгъуар?

 - Си щхьэм нэхърэ нэхъыф1у узолъагъу...

 - Абы щыгъуэ ныбжьэгъу дызэхуэхъунщ.

 Залихъэ и 1э ижьыр къишиящ; сэ ар субыдащ,
 си бгъэм маф1эр къыщызэщ13науэ.

 Гум дынэсыжа къудейуэ, шу гъусэхэм ящыщ зы
 къэк1иящ: «1уащхьэ щ1ыбым мэрак1уэ щыкуэды-
 к1ейщ!»-жери. Мэрак1уэр, вагъуэм хуэдэу, щы-
 куэд 1уащхьэ щ1ыбагъымк13 к1уэну псори арэзы
 хъуащ. Арэзы хъуак1э 1уэхур зэф13к1ькнутэкъым:
 1уащхьэр задэт, вы уэдыкъуахэм удашынутэкъым.
 «Щ1алэхэм щыпщэмэ дыдахынщ!»-жи1ащ За-
 лихъэ. Пщащэхэр акъылэгъу хъуащ, щхьэж ф1эда-
 хэ щ1алэм и шыпл1эм дэт1ысхьащ. Къэрэбэхъин
 мыбдежми къыбгъэдыхьащ Залихъэ, арщхъэк13
 пщащэм идакъьш абы и шыпл1эм дэт1ысхьэн; къы-
 щамыдэм, щ1алэр, шым хэуэри, джабэм к1эрылъэ-
 дащ.

 Сыхьэт закъуэ ф1эк1 сызыщ1ымыгъуа пщащэр
 си шыпл1эм дэзгъэт1ысхьэн къезгъэк1уртэкъым,
 къезмыгъэк1уми, нэгъуэщ1 си 1эмалтэкъыми, сэ
 шыр Залихъэ бгъэдэсшащ. Пщащэм и пл1эм къыдэ-
 хута нэужь, шыр пырхъащ, и тхьэк1умэр игъэк1ащ,
 дыдэгушы13 и гугъэу, т13к1урэ зи1эжьащ, ит1анэ,
 пщащэм епсыхыжын мурад зэримы1эр къыщищ13м,
 зрит1ащ, зигъэк1эрахъуэу щ1ндзащ. Залихъэ къызэ-
 рыщтам гу лъытэгъуейтэкъым: хэпщ1ык1ыу хужь
        """
        markers = self.spell_check_service.check(text)
        self.maxDiff = None
        self.assertListEqual(markers, [])

    def test_spell_check_empty_text(self):
        text = ""
        markers = self.spell_check_service.check(text)
        self.assertEqual(markers, [])

    def test_spell_check_valid_text(self):
        text = "This is a test sentence."
        markers = self.spell_check_service.check(text)
        self.assertEqual(markers, [])

    def test_spell_check_invalid_text(self):
        text = "Th1s 1s an inv@lid sent3nce."
        markers = self.spell_check_service.check(text)
        self.assertEqual(len(markers), 2)  # Ожидаем 2 маркера
        self.assertEqual(markers[0]['severity'], 'error')
        self.assertEqual(markers[1]['severity'], 'error')
